{
  "results": [
    {
      "id": "068da99c-e3d5-4660-ac18-a90a49eb5663",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/068da99c-e3d5-4660-ac18-a90a49eb5663",
      "created_at": "Tue Dec 08 09:09:13 UTC 2020",
      "company": "InnoGames GmbH",
      "company_url": "https://www.innogames.com",
      "location": "Hamburg",
      "title": "Senior Mobile Game Developer (C++) - Forge of Empires",
      "description": "<p>Our <strong>Forge of Empires</strong> team wants to strengthen the technical infrastructure of the game. Therefore we need a <strong>Senior Mobile Game Developer</strong> who is willing to join the technical infrastructure team of our most successful gaming project!</p>\n<p>As a Senior Mobile Game Developer in the tech team, you will have touch-points with all the Game Developers of the project, but your focus will be on the infrastructure for our mobile Cocos2D-X game. Thus you would need to be skilled in developing in C++.</p>\n<p>Are you an experienced Mobile Game Developer looking for a new, long-term challenge in your career? Live your passion for online games/Mobile Development and grow even further professionally as part of our driven &amp; experienced Game Developer community!</p>\n<p><strong>Your mission:</strong></p>\n<ul>\n<li>Have a positive impact on the development of the Forge of Empires mobile game</li>\n<li>Build a better technical infrastructure for our Game Developers by continuously refining and optimizing the existing development environment</li>\n<li>Grow professionally and influence the professional growth of your colleagues by fostering a culture of knowledge sharing, best practices, and standards</li>\n<li>Collaborate closely with Mobile-, Frontend- &amp; Backend Developers, Game Designers, and Artists to increase the user experience for our players</li>\n</ul>\n<p><strong>Your skillset:</strong></p>\n<ul>\n<li>Team player and a good communicator with fluent English language skills</li>\n<li>At least 4 years of professional experience working with C++, ideally using Cocos2D-X</li>\n<li>At least 2 years of professional experience in native app development (Android, iOS)</li>\n<li>Excellent understanding of software architecture and design</li>\n<li>Profound knowledge of continuous integration and tools (e.g., git, Jenkins, Fastlane, Go)</li>\n<li>Good knowledge of Rendering and Profiling</li>\n</ul>\n<p><em>Favorable</em></p>\n<ul>\n<li>Passion for online games (strategy/F2P) and knowledge of relevant game mechanics</li>\n<li>Professional experience in the gaming industry, ideally working on comparable mobile games</li>\n<li>Theoretical understanding of Software Development, ideally based on a University degree in Computer Sciences, Business Information Systems or similar studies</li>\n<li>A proactive and motivated individual with a willingness to learn</li>\n</ul>\n<p><strong>Your power-ups:</strong></p>\n<ul>\n<li>Get competitive compensation as well as a sabbatical, mobile device, contribution to your public transport ticket, and more</li>\n<li>De-stress your private life with flexible working hours, the in-house gym, services such as a hairdresser, massage, bike inspection, and more</li>\n<li>Participate in tons of the company's get-togethers ranging from an in-house sofa concert to a virtual wine tasting</li>\n<li>Make the most of our excellent training and development opportunities</li>\n<li>Feel comfortable in an atmosphere to empower creative thinking and strong results</li>\n<li>Work in an agile multicultural team – enabling you and your team to form and actively optimize work processes</li>\n<li>Our company language is English, and we support all our employees and their partners with optional German lessons</li>\n<li>Receive exceptional support with your relocation to Hamburg</li>\n<li>Shape the success story of InnoGames with our international team of driven experts in a stable growing company and award-winning employer</li>\n</ul>\n<p><strong>Our story:</strong></p>\n<p>InnoGames is Germany's leading developer and publisher of mobile and online games.\nThe company based in Hamburg is best known for Forge of Empires, Elvenar, and Tribal Wars. InnoGames' complete portfolio encompasses seven live games and several mobile titles in production.</p>\n<p>Born as a hobby, InnoGames today has a team of 400 employees from more than 30 nations who share the passion of creating unique games that players across the globe enjoy for years.\nTo further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.</p>\n<p><strong>Excited to start your journey with InnoGames and join our dynamic team as a Senior Mobile Game Developer?</strong>\nWe look forward to receiving your application as well as your salary expectations and earliest possible starting date through our <a href=\"https://www.innogames.com/career/detail/job/senior-mobile-game-developer-c-forge-of-empires/?s=GitHub\">online application form</a>. Maximilian Kaeding would be happy to answer any questions you may have.</p>\n<p><strong>Apply and #stayhome!</strong>\nDue to the <strong>coronavirus</strong> outbreak, we switched our operations company-wide to home office and turned our hiring process into a <strong>fully virtual one</strong>.\nWhen hiring, we are also open for our new team members starting their work remotely at the time being or adjusting contract start dates accordingly.\nStay home and safe!</p>\n",
      "how_to_apply": "<p><a href=\"https://www.innogames.com/career/detail/job/senior-mobile-game-developer-c-forge-of-empires/?s=GitHub\">https://www.innogames.com/career/detail/job/senior-mobile-game-developer-c-forge-of-empires/?s=GitHub</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXVTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1d62d573176fbe3eeab0405b5d5622066626f416/logo_innogames_devlop.png"
    },
    {
      "id": "6ad65ab4-197e-4d05-b709-7674d448b031",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/6ad65ab4-197e-4d05-b709-7674d448b031",
      "created_at": "Mon Dec 07 23:18:19 UTC 2020",
      "company": "MapLarge, Inc.",
      "company_url": "http://MapLarge.com",
      "location": "United States",
      "title": "Senior Software Architect / Engineer who enjoys coding web services in c#",
      "description": "<p><strong>100% Remote:</strong> This role allows working remotely 100% of the time from anywhere in the US.  Workers must be authorized to work in the US (No Non US Applicants Please).</p>\n<p><strong>What We Do</strong></p>\n<p>The team at MapLarge builds cutting edge products for data analytics and visualization to make us safer, more productive, and more efficient.  The Maplarge API provides real time geospatial analytics for over 15 billion location events per day and trillions of historical events. Analysts using our geospatial visualization capability can instantly visualize and publish for data discovery and model testing on any desktop, mobile or tablet device.</p>\n<p><strong>Who We Need</strong></p>\n<p><strong>Cultural Fit</strong> - While we hire all kinds of people and invent roles to fit them, there are three key traits we require of every team member that really define our team.</p>\n<p><strong>Fun to Work With</strong> - Life is short and work should be fun.\n<strong>Extremely Smart</strong> - We work on cutting edge hard problems and we need people who can both architect and code these systems at the same time while working with a highly intelligent peer group.\n<strong>Passionate Engineers</strong> - We need people who really love programming and exhibit the energy and creativity that comes from being fully engaged in what you do.</p>\n<p><strong>Types of Roles &amp; Requirements</strong></p>\n<p>We need talented people to help add cool new features to our platform.  Below are the general categories of tasks we are working on, but often people straddle multiple areas so take them more as the general \"gist\" of what you might do with us. We are looking for smart, hard working, fun people and we will invent the right role to fit them.  The key trait we are looking for is people who like to both architect/design and write the code for complex systems.</p>\n<p><strong>(1) Client Side - Interactive Visuals:</strong> We maintain a JavaScript API for for interactive Data Visualization using our high performance web services. We need people both to help add new dynamic animated UI components and other features to the JS API. We also need people to build data driven visuals for our demo gallery if you are artistically or data analysis inclined. Enjoy working with Knockout, Angular, D3.js, HTML5? Check our our galleries to see the kind of stuff you will be working on <a href=\"http://maplarge.com/demos\">http://maplarge.com/demos</a></p>\n<p>**(2) Full Stack Web Services - **Full stack developers who are comfortable working on both client and server side to produce high performance applications powered by scalable web services are the backbone of our team.  We run c# in both .net and mono server side and also maintain a flexible client side API with a large library of reusable components. We host and run large deployments that sometimes scale to thousands of computers for scientific/industrial/gov users and in a typical day process data over 15 billion records from 110 million streaming data sources.</p>\n<p><strong>(3) Algorithm / Core Database Development -</strong>  We built our own in memory database and distributed data analytics pipeline from the ground up with funding from DARPA, and we have a team of really talented researchers working on Pattern analysis, Streaming analytics, Spatial queries and Network graph functions that power our visual engines. We are always looking for practical people who love writing highly optimized code that straddles the line between research and software development. We don't usually publish scientific papers, but we are right out on the edge pulling algorithms out of the latest research papers finding really fast \"good enough\" approaches that let us tease interesting patterns out of data without getting lost in \"science experiment land\"</p>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>US Person based anywhere in the US (100% remote allowed but no off shore)</li>\n<li>5 Years work experience as a programmer</li>\n<li>Highly Comfortable with C# and Visual Studio</li>\n<li>Experienced with Web Development &amp; JavaScript</li>\n</ul>\n<p>MapLarge is committed to a diverse and inclusive workplace. MapLarge is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.</p>\n",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:jobs@maplarge.com\">jobs@maplarge.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbW1TIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b3cad37dc980a8d5ba649d5004dde3ba226c47e0/maplargelogo23.png"
    },
    {
      "id": "113e5b39-0d51-4010-8795-39e20be2f3f2",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/113e5b39-0d51-4010-8795-39e20be2f3f2",
      "created_at": "Mon Dec 07 23:09:22 UTC 2020",
      "company": "MapLarge",
      "company_url": "http://MapLarge.com",
      "location": "United States",
      "title": "Senior Full Stack .Net Web Application Developer",
      "description": "<p><strong>What We Do</strong></p>\n<p>The team at MapLarge builds cutting edge products for data analytics and visualization to make the world safer, more productive, and more efficient for our millions of users and thousands of customers.  The Maplarge API provides real time geospatial analytics for billions of location events every day. Analysts using our geospatial visualization capability can instantly visualize and publish for data discovery and predictive model testing on any desktop, mobile or tablet device.</p>\n<p><strong>Who We Need</strong></p>\n<p><strong>Cultural Fit</strong> - While we hire all kinds of people and invent roles to fit them, there are three key traits we require of every team member that really define our team.</p>\n<p><strong>Fun to Work With</strong> - Life is short and work should be fun.\n<strong>Extremely Smart</strong> - We work on cutting edge hard problems and we need people who can both architect and code these systems at the same time while working with a highly intelligent peer group.\n<strong>Passionate Engineers</strong> - We need people who really love programming and exhibit the energy and creativity that comes from being fully engaged in what you do.</p>\n<p><strong>About the Role</strong></p>\n<p>This role is for full stack .Net web developers who enjoy working with WebService API's in C# on the server side and creating sophisticated single page applications in TypeScript and JavaScript on the client side. In this role you will be helping to design and build the server and client side API's for MapLarge components that we combine into new interactive dashboards.    This job is for advanced programmers only and you do not have to have any design, css or other artistic skills.   Please be ready to tell us about any experience you have working with complex single page applications, designing C# web service API's and building reusable components with JavaScript or TypeScript.</p>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>US Person based anywhere in the US (100% remote allowed but no off shore)</li>\n<li>5 Years work experience as a programmer</li>\n<li>Highly Comfortable with Typescript, C# and Visual Studio</li>\n<li>Very Experienced with Web Development &amp; JavaScript</li>\n</ul>\n<p>MapLarge is committed to a diverse and inclusive workplace. MapLarge is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.</p>\n<p><strong>About MapLarge</strong>\nMapLarge provides Big Data Analytics and Visualization to make us safer, more productive, and more efficient.   Our platform powers high traffic website visualizations, data discovery, and business intelligence applications. These visualizations can be synchronized in a dashboard to quickly discover insights by simultaneously viewing a segment of the data in multiple forms including maps.</p>\n",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:jobs@maplarge.com\">jobs@maplarge.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbVdTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--143c4090b8589d66e821a0881d829a2a9e92db77/maplargelogo23.png"
    },
    {
      "id": "4516e97f-bbb0-4773-a9ec-cc8051f2a6a7",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/4516e97f-bbb0-4773-a9ec-cc8051f2a6a7",
      "created_at": "Mon Dec 07 23:01:59 UTC 2020",
      "company": "MapLarge",
      "company_url": "https://maplarge.com",
      "location": "United States",
      "title": "Lead Application Developer / Technical Project Manager",
      "description": "<p><strong>100% Remote:</strong> This role allows working remotely 100% of the time from anywhere in the US.  Workers must be authorized to work in the US (No Non US Applicants Please).</p>\n<p><strong>Who We Need:</strong> We are looking for experienced senior software developers to act as lead application developers helping to design and build applications for customers on top of the MapLarge product suite.  Applicants should have a strong history as a lead software developer (no non-technical project managers, please) and should be a top notch C# and JavaScript programmer. We are looking for sophisticated team members who are passionate about not only how UI is used, but also how the APIs, ontology, data structures, documentation, and examples come together to make both the UI components and technical APIs a pleasure for customers to use.</p>\n<p><strong>Typical Tasks:</strong> Typical Tasks include both writing code and leading planning activities.  You will often be acting as the lead technical point of contact on customer engagements, running internal and external planning meetings, helping to wireframe user interfaces, creating specs for the public facing APIs that drive them, doing deep dive code reviews with developers, and writing code for key portions of the deployed application.</p>\n<p><strong>Skills:</strong> While we hire all kinds of people and invent roles to fit them, these are the key traits we prefer for this role:</p>\n<p><strong>Smart &amp; High Energy Engineer</strong> - We work at a very fast pace on cutting edge hard problems and we need people who can keep up.   We need people who really love producing results for customers and who enjoy programming and exhibit the energy and creativity that comes from being fully engaged in the technical side of what we do.</p>\n<p><strong>Strong Software Development background</strong> - This job is definitely NOT for non technical project managers. Recent, hands-on experience coding both server side (C#) and client side (JavaScript) are strongly suggested, and 5+ years work experience as a professional programmer is required.</p>\n<p><strong>Experience Wireframing UI &amp; Designing APIs</strong> - You do not have to have strong artistic skills, but you should be comfortable not only spec-ing out UI wireframes but also designing the supporting technical web service API’s and/or client side component API’s.</p>\n<p><strong>Technical Project Management:</strong>  You should be highly organized with a strong history in either technical project management or as the lead developer for complex software development projects.\nCustomer Facing: comfortable meeting with sophisticated customers and managing expectations on large high value projects.</p>\n<p>MapLarge is committed to a diverse and inclusive workplace. MapLarge is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.</p>\n<p><strong>About MapLarge:</strong></p>\n<p><strong>Real World Impact:</strong> At MapLarge we’re passionate about building software that solves some of the world’s hardest and most interesting problems across dozens of industries. We partner with the largest and most sophisticated institutions in the world to improve the lives of their users and customers with clever use of data and technology. Our products have been used to keep the world safe, improve global healthcare outcomes, deliver billions of packages on time, keep every plane in the sky safe and fuel efficient, improve navigation and safety for every boat in the ocean in real-time and more. If these types of projects excite you, we'd love for you to join us.</p>\n<p><strong>High Value Innovative Enterprise Products &amp; Solutions:</strong> MapLarge products provide an enterprise focused platform for geospatial analytics and visualization. Our solution teams develop integrated solutions on top of our products across multiple different industry verticals and use cases - all focused on large enterprise and government agencies. If you enjoy working with sophisticated teammates, to build cutting edge solutions for high value customers that appreciate innovative solutions, then MapLarge is the place for you.</p>\n",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:jobs@maplarge.com\">jobs@maplarge.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUdTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5e3574f822a422e5d9a30ae019947e63a42d08d4/maplargelogo23.png"
    },
    {
      "id": "e3ea8dee-e47b-4459-ab95-9f170abab60e",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/e3ea8dee-e47b-4459-ab95-9f170abab60e",
      "created_at": "Mon Dec 07 22:52:56 UTC 2020",
      "company": "Life.Church",
      "company_url": "https://jobs.lever.co/life/23e844c6-2678-46b2-9b11-30e9c36bd398",
      "location": "Edmond, Oklahoma",
      "title": "YouVersion Mobile Android ",
      "description": "<p>YouVersion Mobile Engineer - Android\nEDMOND, OK /YOUVERSION – YOUVERSION PRODUCT &amp; ENGINEERING /FULL-TIME\nThe YouVersion Mobile Engineer will help people around the world engage with God’s Word by developing, refining, and growing the YouVersion Bible App mobile experience on Android devices.</p>\n<p>God has placed you on the earth for a reason, at this crucial moment in time. He’s given you a purpose. With the smartest tech at our fingertips and more distractions vying for our attention than ever before, the need for the Bible has never been greater. If you’re looking for a place you can combine the skills God has given you with your passion to see people engage with His Word in new ways—no matter where they are or what languages they speak—the YouVersion Team is the place to start. Come change the world with us!</p>\n<p>We’re looking for a unique individual with a passion for Android application development to serve as a Mobile App Engineer. With more than a quarter of a billion installs of the Bible App and 40 million installs of the Bible App for Kids, the YouVersion team continues to grow and evolve in an effort to appropriately steward the opportunities brought our way. Are you excited about building awesome mobile apps for a variety of tablets and smart phone devices and interested in exploring the unique challenges of large-scale mobile apps? Then keep reading!</p>\n<p>You'll be:\n-Contributing to all aspects of development on our mobile engineering team helping to drive\nenhancements to our Android application\n-Engaging as an active member within our agile development process\n-Collaborating with our various platform teams to ensure features and software design patterns are\nconsistent\n-Testing, debugging, and maintaining software throughout the product lifecycle</p>\n<p>You'll fit right in if you are:\n-Passionate about the mission of YouVersion: Helping people engage with the Bible\n-Great at solving large, complicated, and difficult technology problems\n-Looking to dedicate your life to something that makes a difference on a global scale\n-A team player who is willing to do whatever it takes to make the team successful\n-Living in or willing to relocate to the Oklahoma City metro area</p>\n<p>You'll work well if you:\n-Are experienced with Android technologies (Java, Android SDK, etc.)\n-Have strong time management and organizational skills to drive projects to completion\n-Published one or more applications in the Android Market\n-Know Git</p>\n<p>You'll love us if:\nBrewing your morning cup requires at least seven different apparatuses, none of which are a coffeemaker\nYour root@localhost password is the chemical formula for caffeine\nYou can translate English into Binary</p>\n<p>This role is located at Life.Church Central Offices in Edmond, OK.</p>\n",
      "how_to_apply": "<p>Apply at Life.Church/Careers or using the link in logo.</p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHlTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7bb5d8fcae9c488cbce10496448849018aff27c2/_LifeChurch_Logo_square.png"
    },
    {
      "id": "09c70af5-9906-4ecd-ad11-a15cc492e2ed",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/09c70af5-9906-4ecd-ad11-a15cc492e2ed",
      "created_at": "Mon Dec 07 21:56:07 UTC 2020",
      "company": "Isometric Technologies",
      "company_url": "https://iso.io",
      "location": "San Francisco | Remote (US/Canada)",
      "title": "Full Stack Software Engineer",
      "description": "<h2>About us</h2>\n<p>Our mission is to redefine the multi-trillion dollar logistics industry - transforming it to address the pressing needs of the 21st century. Supply chain accounts for ~10% of Global GDP and is one of the largest barriers to addressing major global challenges like sustainability, air pollution and food waste. By changing how organizations work together across the global supply chain, we will play a critical role in tackling these challenges head on and unblocking human advancement. We are a team of serial entrepreneurs with extensive backgrounds building world class product, engineering, operations, sales &amp; marketing teams. We know what it takes to go from zero-to-one AND what it takes to achieve scale and transform markets.</p>\n<h2>About the role</h2>\n<p>We are looking for a product-minded software engineer who is comfortable with both front and back-end software development to join our founding engineering team. You will be responsible for development and architecture of the application while ensuring stability, security and responsiveness. You will be one of the early technical hires and will help define engineering architecture, process and culture for years to come.</p>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Collaborate with product management, operations and sales to build a product that our customers genuinely love.</li>\n<li>Communicate effectively within the organization with people sitting next to you and those multiple time zones away. We believe in breaking down silos with strong communication.</li>\n<li>Own features from start to finish: test, development, deployment, and infrastructure.</li>\n<li>Never stop learning. You’ll be responsible for mentoring and learning through code review process, tech talks, and many ad hoc technical conversations.</li>\n<li>Use your judgment to decide what areas of codebase to invest in, when to incur technical debt, when to move fast, and when to slow down.</li>\n<li>Wear many hats: help with scaling our engineering team, define engineering processes, understand the logistics business, and collaborate with other functions within ISO.</li>\n</ul>\n<h2>We get excited about candidates who have:</h2>\n<ul>\n<li>Highly experienced with back-end programming languages like Ruby, Python, Java, or JavaScript and frameworks such as Ruby on Rails, Django, or Express.js</li>\n<li>Enjoy building amazing customer experience using React, Redux or TypeScript</li>\n<li>Experience using cloud infrastructure providers such as AWS, Microsoft Azure or Google Cloud</li>\n<li>Real-world experience with PostgreSQL</li>\n<li>Advanced knowledge of Git and Github</li>\n<li>Experience working in an agile and fast-paced working environment</li>\n</ul>\n<h2>Nice to Have:</h2>\n<ul>\n<li>Experience in the early-mid stages of a fast-growing company</li>\n<li>You are a self-starter: clubs, volunteer work, passion projects - we want to hear about them!</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://jobs.lever.co/IsometricTechnologies/ced96d5d-6249-433e-9a18-eab0820ad388?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/IsometricTechnologies/ced96d5d-6249-433e-9a18-eab0820ad388?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGVTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7f9f9383f70363f0bd802ee6b8bb7934cdc732bd/iso.png"
    },
    {
      "id": "b1691d49-ee1d-4793-9c1d-7a10a9b8b84a",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/b1691d49-ee1d-4793-9c1d-7a10a9b8b84a",
      "created_at": "Mon Dec 07 19:23:19 UTC 2020",
      "company": "EME Hive",
      "company_url": "http://emehive.co",
      "location": "New York City",
      "title": "Infrastructure Engineer for Social Livestreaming App",
      "description": "<p>WHO WE ARE</p>\n<p>EME Hive is a community-based, social live streaming app for finding like-minded friends and partners. Through the power of live streaming technology, users are able to form real-time connections with members of their own communities. By offering a subscription dating service as well as a live streaming platform, EME makes it easy for users to flirt, chat, and date in real-time -- all within the same app!</p>\n<p>We are a team of innovative, and friendly individuals who are redefining the rules of connection. We believe that our dedication to live-streaming and online dating technologies will bring highly efficient and safer connections to many minority communities all over the world. We are currently looking for a strong Infrastructure Engineer to join our growing team and share in our enthusiasm for taking on today’s toughest challenges in live-streaming.</p>\n<p>WHAT YOU'LL DO</p>\n<p>-Design, build, and maintain distributed content and service systems</p>\n<p>-Research and develop content and media delivery technology, such as WebRTC, HTTP Multicast, Anycast, etc.</p>\n<p>-Develop network and service metrics-gathering solutions that inform automation and perform system monitoring/alerting to secure our services, validate network security configurations, and protect against network disruption.</p>\n<p>-System development, configuration and deployment of infrastructure atop cloud VPS or 3rd party platform, namely:</p>\n<pre><code> -Proxy Servers such as haproxy, nginx, ProxySQL\n\n -Database/Web servers such as Redis, Redis Cluster, MySQL, MySQL cluster, Rails, Go, Vapor\n\n -Services such as PubSub messaging, video recording, video transcoding, managed + distributed \n  cloud store, CDN\n\n -Supporting servers and services such as orchestrator, CircleCI, GCP, AWS, GitHub, Ansible\n</code></pre>\n<p>-Manage and work with 3rd party infrastructure-as-a-service and video software vendors.</p>\n<p>-Assist with writing formal requirements and specifications documents; building and documenting solutions.</p>\n<p>-Maintain communication of project statuses and drive continued improvement in quality and availability of each the systems and product.</p>\n<p>-Contribute to our culture of shipping greatness, quality and customer focused approach.</p>\n<p>WHAT YOU MUST HAVE</p>\n<p>-BS or MS degree in Computer Science.</p>\n<p>-2+ years of engineering experience building scalable distributed systems</p>\n<p>-Deep technical background in or strong familiarity with JavaScript, Python, HTML, CSS, and Ruby, C++, MySQL,, HTML, CSS, Cloud VPS, Linux, Redis.</p>\n<p>-Ability to learn and understand new technologies/systems quickly.</p>\n<p>-Solid software development fundamentals (data structures, algorithms, problem solving, and system architecture).</p>\n<p>-Experience integrating low-level software for purpose-built solutions.</p>\n<p>-Working knowledge of content delivery networks and data center infrastructure.</p>\n<p>-In depth knowledge of video compression, encoding, decoding, streaming, and analytics.</p>\n<p>-Experience in developing/deploying streaming infrastructure on cloud services.</p>\n<p>-Previous experience with video processing services or infrastructure such as AWS Elemental MediaConvert/MediaLive, MediaConnect, or ffmpeg in-a-box</p>\n<p>-Experience working closely across a variety of teams including product management, designers, and backend engineers.</p>\n<p>-Creative problem-solving skills while working in a fast-paced, start-up environment.</p>\n",
      "how_to_apply": "<p>Email your resume and cover letter to <a href=\"mailto:recruiting@emehive.co\">recruiting@emehive.co</a> (not .com!).  Looking forward to hearing from you!</p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbFNTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f8a7d57b1091ad6c57a6d522d8b280372a303ce8/Screen%20Shot%202020-12-07%20at%202.22.26%20PM.png"
    },
    {
      "id": "96b44ca5-1d3b-42d5-83bd-f33afaea9279",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/96b44ca5-1d3b-42d5-83bd-f33afaea9279",
      "created_at": "Mon Dec 07 15:08:05 UTC 2020",
      "company": "Covestro Deutschland AG",
      "company_url": "https://vonq.io/37E2e0K",
      "location": "Leverkusen",
      "title": "R&D Programmer (m/w/d)",
      "description": "<p>Wir sind Covestro. Wir sind neugierig. Wir sind mutig. Wir sind vielfältig. Wir haben chemische Materiallösungen mit bahnbrechenden Produkten verfeinert. Lassen Sie uns gemeinsam Grenzen überschreiten. Schließen Sie sich uns und unseren 17.200 Kollegen an und zusammen werden wir die Welt lebenswerter machen.</p>\n<p><strong>R&amp;D Programmer (m/w/d)</strong></p>\n<h2>IHRE AUFGABEN UND VERANTWORTLICHKEITEN</h2>\n<p>Das Team Digital R&amp;D (DRD) ist verantwortlich für innovative computerunterstützte Lösungen für die chemische Produkt- und Anwendungsentwicklung bei Covestro. DRD integriert Expertise einerseits für Materialsimulationen und Computational Chemistry, andererseits Kompetenzen für Laborautomatisierung, R&amp;D Data Science und High Performance Computing (HPC).</p>\n<ul>\n<li>In Ihrer neuen Position sind Sie verantwortlich für das Programmieren und Scripten von Softwarekomponenten und -Workflows im Bereich Scientific Computing als Teil eines interdisziplinären Teams aus Simulationswissenschaftlern (m/w(d) und Data Scientists / Data Engineers (m/w/d) etc.</li>\n<li>Sie unterstützen die Wissenschaftler, Ingenieure und Techniker (m/w/d) der Abteilung bei der effizienten Umsetzung und Optimierung von Inhouse-Lösungen und Expertentools</li>\n<li>Der Aufbau und die Pflege von Programm- und Daten-Workflows mit modernen Methoden fällt ebenfalls in Ihren Aufgabenbereich</li>\n<li>Sie übernehmen auch die Vorbereitung von Software Deployments und die Schnittstellenassistenz zum HPC-Administrations-Team</li>\n</ul>\n<h2>WAS SIE MITBRINGEN</h2>\n<ul>\n<li>Sie verfügen über eine Hochschulstudium oder abgeschlossene Ausbildung in den Bereichen Mathematik, Informatik, Naturwissenschaften, Technologie (MINT) oder vergleichbar</li>\n<li>Ihr Profil zeigt sehr gute Kenntnisse in Programmier- und Skriptsprachen wie C/C++, Python, VBA (optional) und JavaScript (optional)</li>\n<li>Sie haben zudem Kenntnisse von relationalen Datenbanken (SQL) sowie Interesse an dokumentenorientierten Datenbanken (NoSQL) und verteilten Dateisystemen (DFS)</li>\n<li>Eine proaktive Arbeitseinstellung, Eigeninitiative und der Wunsch, das Fachwissen zu erhalten und neue Fähigkeiten und Kenntnisse für die erforderlichen Bereiche zu erwerben, sind für Sie selbstverständlich</li>\n<li>Fließende Deutsch und Englischkenntnisse, in Wort und Schrift, runden Ihr Profil ab</li>\n</ul>\n<h2>IHRE BEWERBUNG</h2>\n<p>Sind Sie neugierig, mutig und vielfältig? Dann bieten wir Ihnen spannende Karrieremöglichkeiten. Wir freuen uns auf Ihre Bewerbung über den <strong>Bewerben-Button</strong> mit Anschreiben, Lebenslauf und Ihren relevanten Zeugnissen. Werden Sie Teil unseres Teams – Bewerben Sie sich jetzt!</p>\n<p>Für einen ersten telefonischen Kontakt steht Ihnen Frau Isabell Ramrath, Telefon 02146009 8246, gerne zur Verfügung.</p>\n<p><strong>Land</strong>\nDeutschland</p>\n<p><strong>Standort</strong>\nLeverkusen</p>\n<p><strong>Referenzcode</strong>\nJR-2020-01732</p>\n<p><a href=\"mailto:recruiting@covestro.com\">recruiting@covestro.com</a></p>\n<p>Covestro begrüßt Bewerbungen aller Menschen ungeachtet von ethnischer Herkunft, Nationalität, Religion, Weltanschauung, Geschlecht, Alter, Behinderung, Aussehen und/oder sexueller Identität. Wir bekennen uns zu dem Grundsatz, alle Bewerberinnen und Bewerber fair zu behandeln und Benachteiligungen zu vermeiden.</p>\n<p>Wir möchten, dass Sie sich bei Covestro wie zu Hause fühlen. Dass Sie das Gefühl haben, fair und transparent behandelt zu werden. Das bedeutet finanzielle Sicherheit, eine gesunde Work-Life-Balance und ansprechende Sozialleistungen. Konkret heißt es für uns: flexible Arbeitszeiten, die Vereinbarkeit von Familie und Beruf, eine aktive Gesundheitsförderung und die Möglichkeit einen Teil Ihres Gehalts ins</p>\n<p>Langzeitkonto oder für die Altersvorsorge umzuwandeln. Und das ist nicht alles.</p>\n<p>Klingt spannend? Weitere Informationen zum Thema Karriere und zu unseren Benefits finden Sie unter: <a href=\"http://www.career.covestro.de\">www.career.covestro.de</a></p>\n<p><a href=\"https://vonq.io/37E2e0K\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/37E2e0K\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbENTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2aaa10ed828322bce3ff09167423670862e50818/covestro.jpg"
    },
    {
      "id": "7377bda6-f665-4728-a0e1-4059d7d94280",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/7377bda6-f665-4728-a0e1-4059d7d94280",
      "created_at": "Mon Dec 07 14:14:42 UTC 2020",
      "company": "PGGM",
      "company_url": "http://www.pggm.nl",
      "location": "Zeist",
      "title": "Lead Software Engineer",
      "description": "<p>PGGM heeft voor haar locatie in Zeist een vacature voor een</p>\n<p><strong>Lead Software Engineer</strong>\n32-36 uur - Zeist</p>\n<p><strong>Software ontwikkelen waardoor continuïteit en kwaliteit van onze applicaties, waarin we de pensioenen administreren, nog beter wordt. Zo ga jij impact maken bij PGGM!</strong></p>\n<p><strong>Jouw rol als Lead Software Engineer</strong>\nVanuit een klein team werken jij en je collega developers aan back-end oplossingen. Het team beheert en ontwikkelt softwaresystemen waarmee we met pensioendeelnemers communiceren, via pensioenoverzichten (UPO’s) en via het Pensioenregister (<a href=\"http://www.mijnpensioenoverzicht.nl\">www.mijnpensioenoverzicht.nl</a>). Jouw werk zal uit een breed scala aan activiteiten bestaan, waaronder het analyseren, ontwikkelen, testen en beheren van IT-oplossingen. Wat je doet, hangt af van wat er nodig is voor het team en vraagt een hoge mate van flexibiliteit. Jouw topprioriteit is om te leveren wat je belooft: toekomstbestendige IT-oplossingen.</p>\n<p>Omdat de wereld snel verandert, wordt er binnen het team constant gewerkt aan persoonlijke en vaktechnische ontwikkeling. Jij als Lead Developer hebt daar een belangrijke en impactvolle rol in. Jij gaat collega's binnen het team coachen en begeleiden, zodat zij kunnen groeien in hun rol en op een hoger niveau kunnen meedraaien. Samen met je team bepaal je of het aanwezige kennis- en vaardigheidsniveau binnen het team voldoende is en blijft. Ook krijg jij binnen het team de trekkersrol als het aankomt op het oppakken van initiatieven en op het gebied van innovatie. Een mooie veelzijdige rol waarin zowel jouw technische kennis en skills aan bod komen, maar waarbij je ook aan de slag gaat met het overbrengen van deze vaardigheden en coachen op social skills.</p>\n<p>Wil je weten hoe het is om bij PGGM binnen software development te werken? Bekijk dan deze video, waarin onze collega's je vertellen over hun ervaringen - <a href=\"https://www.youtube.com/watch?app=desktop&amp;v=W6rGMsPvM7Y\">Software Development</a>.</p>\n<p>Eric Jan Aling, Lead Software Engineer: “Samen met je DevOps team kwalitatief hoge software ontwikkelen die bijdraagt aan een betrouwbare dienstverlening voor de pensioengerechtigden. Een mooie inhoudelijke en impactvolle uitdaging, waar ieder teamlid aan bijdraagt.”</p>\n<p><strong>Jouw afdeling binnen PGGM</strong>\nPGGM heeft als pensioenuitvoeringsorganisatie de missie om mensen te helpen bij het realiseren van een waardevolle toekomst. Maatschappelijk betrokken en duurzaam handelen zijn daarbij onze uitgangspunten. Vanuit Zeist werken zo’n 1.500 medewerkers aan de oude dag van miljoenen Nederlanders.</p>\n<p>Samen met 5 collega’s werk je in scrumteam Pensioencommunicatie, dat jaarlijks ruim 3 miljoen pensioenoverzichten voor deelnemers maakt, en 1,5 miljoen raadplegingen van <a href=\"http://www.mijnpensioenoverzicht.nl\">www.mijnpensioenoverzicht.nl</a> ondersteunt. Je komt dus te werken in een multidisciplinair team bestaand uit een scrummaster, developers en een tester.</p>\n<p>Het pensioencommunicatieteam is een zelfsturend team, waarbinnen er kritisch naar elkaar gekeken wordt en waar open en eerlijk met elkaar gecommuniceerd wordt. Het verantwoordelijkheidsgevoel is groot en jouw collega’s inspireren en motiveren elkaar om tot een hoger niveau te komen. Binnen dit professionele maar zeker ook gezellige team, krijg jij volop kansen om jouw vakmanschap te tonen en met de nieuwste tooling en technieken te werken.</p>\n<p>Wil je een breder beeld zien van Software Development binnen PGGM? Klik door naar deze <a href=\"https://www.youtube.com/watch?app=desktop&amp;v=bhcFjbz4dBQ\">video</a></p>\n<p><strong>Jouw achtergrond als Lead Software Engineer</strong>\nJe bent analytisch sterk en met jouw oplossingsgerichte instelling ga jij een uitdaging niet snel uit de weg. Dat je vooral ook een echte teamspeler moet zijn zal je inmiddels wel duidelijk zijn. Vanwege de intensieve samenwerking moeten teamleden elkaar vertrouwen en op elkaar kunnen bouwen. Wij vinden het belangrijk om kennis met elkaar te delen en zien dit ook graag bij jou terug. En jouw topprioriteit, het werken aan toekomstbestendige IT-oplossingen? Dit heb jij altijd scherp op je netvlies.</p>\n<p>Verder breng je mee:</p>\n<ul>\n<li>hbo werk- en denkniveau, bij voorkeur een opleiding in een IT of technische richting.</li>\n<li>minimaal 5 jaar relevante werkervaring , bijvoorbeeld als backend engineer, developer of software ontwikkelaar.</li>\n<li>kennis van en ruime ervaring met .Net, ASP.Net Core, SQL en SSIS, design patterns zoals dependency injection, onion architecture, DDD, Azure, MS build / pipelines.</li>\n<li>ook ben je bekend met GIT en Testautomatisering.</li>\n<li>ervaring met Agile werken.</li>\n<li>Uitstekende beheersing van de Nederlandse taal, zowel mondeling als schriftelijk.</li>\n</ul>\n<p><strong>Dutch speaking candidates only!</strong></p>\n<p><strong>Wat wij bieden:</strong>\nPGGM staat bekend om goed werkgeverschap. We belonen onze medewerkers voor hun inzet en hechten veel waarde aan een goede balans tussen werk en privé. Uiteraard zien we graag dat jij je verder ontwikkelt en daarom ondersteunen we je hierin.\nJij mag rekenen op:</p>\n<ul>\n<li>een functie met gegarandeerde maatschappelijke impact.</li>\n<li>een brutomaandsalaris tussen € 3.000 en € 5.300, afhankelijk van je kennis en ervaring.</li>\n<li>een vaste aanstelling bij indiensttreding - contract voor onbepaalde tijd.</li>\n<li>een 32 tot 36-urige werkweek met de mogelijkheid om je uren flexibel in te delen.</li>\n<li>ruime mogelijkheden om vanuit huis te werken, nu werken wij volledig thuis en naar verwachting zullen wij in de toekomst ook deels vanuit huis blijven werken.</li>\n<li>ruim 26 vakantiedagen.</li>\n<li>een goede pensioenregeling als deelnemer van pensioenfonds PFZW. (71,5% betaald door PGGM, 28,5% door werknemer)</li>\n<li>een eindejaarsuitkering van 7,5%.</li>\n<li>een ruim opleidingsbudget voor interne en externe trainingen of opleidingen.</li>\n<li>een collectieve ziektekostenverzekering bij CZ. Je krijgt korting op de basisverzekering en aanvullende pakketten van CZ.</li>\n</ul>\n<p>Meer informatie over onze arbeidsvoorwaarden en salarisschalen lees je in onze CAO, die je vindt onder <a href=\"https://www.pggm.nl/werken-bij/arbeidsvoorwaarden/\">'Arbeidsvoorwaarden'</a> op <a href=\"https://www.pggm.nl/werken-bij\">pggm.nl/werken-bij</a>.</p>\n",
      "how_to_apply": "<p>Wil jij als Lead Software Engineer de verantwoordelijkheid dragen voor een goed pensioen van 4,4 miljoen pensioendeelnemers? Solliciteer dan op deze vacature en kies voor een baan met impact.\nWij ontvangen je sollicitatie graag via onze <a href=\"https://www.pggm.nl/werken-bij/vacatures/vacature/lead-software-engineer---zeist-32-tot-36-uur/?id=a0w1v00000CX5onAAD&amp;utm_source=github&amp;utm_medium=referral&amp;utm_term=2021&amp;utm_content=172888&amp;utm_campaign=lead-software-engineer\">sollicitatiepagina</a>.</p>\n<p>Informatie over de sollicitatieprocedure vind je terug op onze <a href=\"https://www.pggm.nl/werken-bij/sollicitatieprocedure/\">website</a>.</p>\n<p><strong>PGGM en Corona</strong>\nDoor de Corona situatie, werken de meeste PGGM’ers momenteel vanuit huis. Als we met je kennis willen maken, betekent dit dat de interviews grotendeels via videocalls plaatsvinden. Een afrondend gesprek doen we op kantoor. Nemen we je aan? Dan zal het grootste deel van jouw inwerktraject op afstand gebeuren. Hierbij maken we gebruik van Microsoft Teams. Het is beperkt mogelijk om collega’s op kantoor te ontmoeten.</p>\n<p><strong>Aan intermediairs\nWe weten dat er veel partijen zijn die graag met ons mee willen zoeken of hun diensten willen aanbieden voor deze vacature, maar bij PGGM werven we nieuwe collega’s zelf. Acquisitie naar een werving &amp; selectie-opdracht of onaangekondigde aanbiedingen van CV's stellen we dan ook niet op prijs en nemen wij niet in behandeling. Mochten we er niet uitkomen, dan bellen we jou.</strong></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBazZTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--78a7c3606488689c17bb18d12768afeeaf8007bb/Logo%20PGGM.jpg"
    },
    {
      "id": "4ee82287-3566-4cff-a926-09a83e5cc71b",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/4ee82287-3566-4cff-a926-09a83e5cc71b",
      "created_at": "Mon Dec 07 12:56:29 UTC 2020",
      "company": "azeti GmbH",
      "company_url": "https://www.azeti.net/",
      "location": "Berlin / Remote",
      "title": "Fullstack Entwickler (Kotlin, React)",
      "description": "<p>Wir sind ein Berliner Internet of Things (IoT) Software Unternehmen. Unsere IoT Plattform ermöglicht es, einfach und schnell industrielle IoT Anwendungen umzusetzen. Bereits seit 2006 bieten wir Software „Made in Germany” für nationale und internationale Kunden an. Sowohl in Europa, Amerika als auch in China, sind unsere IoT-Lösungen im Einsatz. Als Spezialisten für Digitalisierung und IoT wird unsere TÜV-geprüfte IoT-Plattform bereits in verschiedensten Branchen eingesetzt. Diverse Forschungsprojekte und langjährige OEM-Partnerschaften in der Industrie unterstreichen unsere Kompetenz und Expertise zur Lösung anspruchsvollster IoT-Projekte. Mit unserer Open Source Edge Software und der brandneuen IoT Plattform gehen wir noch einen Schritt weiter und werden das Internet der Dinge für alle ermöglichen.</p>\n<p>Weitere Informationen über uns unter <a href=\"www.azeti.net\">www.azeti.net</a>.</p>\n<p><strong>Deine Aufgaben</strong></p>\n<p>Werde Teil unseres Teams und hilf uns eine moderne Anwendung from scratch zu implementieren. Dabei kannst Du dich auf einen top Technologie Stack (Kotlin, React, Kafka) freuen. Als Fullstack Entwickler wirst Du direkt involviert beim Design und der Implementierung und bist integraler Bestandteil des Teams.</p>\n<p><strong>Dein Profil</strong></p>\n<ul>\n<li>Erfahrung in der Entwicklung in agilen Umgebungen (Scrum, Kanban)</li>\n<li>Hohes Maß an Eigenorganisation und aktive Kommunikation</li>\n<li>Umfangreiche Erfahrung mit <strong>Kotlin und Spring</strong>\n</li>\n<li>Mindestens 1 Jahr Erfahrung Umgang mit Functional Components <strong>ReactJS und TypeScript</strong>\n</li>\n<li>Erfahrung in der Entwicklung Event getriebener Applikationen</li>\n<li>Erfahrung mit <strong>Kafka ist ein Plus</strong>\n</li>\n<li>Fundierte Erfahrung mit Git sowie CI/CD</li>\n<li>PWA Erfahrung ist ein plus</li>\n<li>Du sprichst fließend Englisch</li>\n<li>Deutsch Sprachkenntnisse sind ein Plus aber kein Muss</li>\n</ul>\n<p><strong>Warum wir?</strong></p>\n<p>Diese seltsamen Zeiten verlangen uns allen viel ab. <strong>Wir bieten unserem Team ein sicheres und langfristiges Arbeitsumfeld und sind auf der Suche nach neuen Teammitgliedern, die unser Team für die nächsten Jahre ergänzen.</strong> Neben einem sicheren Geschäftsmodell, sind wir als Tochterunternehmen der Aurubis AG ein sicherer Arbeitgeber für Deine berufliche Zukunft.</p>\n<ul>\n<li><strong>Stabiles und sicheres Arbeitsumfeld</strong></li>\n<li>Flexible Arbeitszeiten und Rücksicht auf deine Familienbedürfnisse (Kita, Home Schooling etc.)\nHome Office</li>\n<li>Freie Wahl des Arbeitsgerätes (Linux, Mac, Windows) und Ausrüstung für Dein Home Office</li>\n<li>Überdurchschnittliches Gehalt und großartige Karriereentwicklungsmöglichkeiten</li>\n<li>Buntes, internationales Team, flache Hierarchien und agiles Arbeiten</li>\n<li>Jeder trägt bei uns Verantwortung und gestaltet Produkte aktiv mit</li>\n<li>Top-notch Technologie Stack mit spannenden Entwicklungen und kontinuerlicher Lernkurve</li>\n<li>\n<a href=\"http://t3u1.mjt.lu/lnk/AM0AAIpTzLcAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBfymVDWgtDKaxZRe6J6K6UgXyxDwAGCXo/3/BnezYWzjcys3apoHyTMUbg/aHR0cHM6Ly9jb3Jwb3JhdGUudXJiYW5zcG9ydHNjbHViLmNvbS9lbg\">Urban Sports Club</a> Mitgliedschaft, vollständig von uns bezahlt</li>\n<li>Bike Leasing bei <a href=\"http://t3u1.mjt.lu/lnk/AM0AAIpTzLcAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBfymVDWgtDKaxZRe6J6K6UgXyxDwAGCXo/4/b_C3YzAnKh2YVKB2ICMYkA/aHR0cDovL3d3dy5idXNpbmVzc2Jpa2UuZGUv\">business-bike</a> oder <a href=\"http://t3u1.mjt.lu/lnk/AM0AAIpTzLcAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBfymVDWgtDKaxZRe6J6K6UgXyxDwAGCXo/5/CIMJOrom23xCVqD_6ijEfg/aHR0cDovL3d3dy5qb2JyYWQub3JnLw\">jobrad</a>\n</li>\n<li>\n<a href=\"http://t3u1.mjt.lu/lnk/AM0AAIpTzLcAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBfymVDWgtDKaxZRe6J6K6UgXyxDwAGCXo/6/C95Ru3z3lTX9qEOsFEpChw/aHR0cHM6Ly93d3cuY29ycG9yYXRlLWJlbmVmaXRzLmRlLw\">Corporate Benefits Programm</a> mit attraktiven Rabatten</li>\n<li>Kontinuierliche Weiterbildung, 100 EUR <a href=\"http://t3u1.mjt.lu/lnk/AM0AAIpTzLcAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBfymVDWgtDKaxZRe6J6K6UgXyxDwAGCXo/7/uiodq8gC-WlxXd0h2bomNw/aHR0cHM6Ly93d3cudWRlbXkuY29tLw\">Udemy Kursbudget</a> pro Monat</li>\n</ul>\n<p><img src=\"https://camo.githubusercontent.com/57d19ab5b3e17d0f19edb8247c026890bd2f2780/68747470733a2f2f742e676f686972696e672e636f6d2f682f39356230363238373166643536393135373330303732343065303766613235333966663361643066666233646466373933373036613661636636383666613964\"></p>\n",
      "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/18345496d91f6db09bfc6a587ddc8dda699e2075f74d790d249f708bc171b06e\">application form</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3VTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--abe46fec6fe8cbbf1907597fe6500192404e28f9/azeti%20GmbH.png"
    },
    {
      "id": "ce71734f-0c92-4057-8f07-93e51962465a",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/ce71734f-0c92-4057-8f07-93e51962465a",
      "created_at": "Mon Dec 07 10:32:51 UTC 2020",
      "company": "Rhenus Freight Network GmbH & Co. KG",
      "company_url": "https://www.rhenus-freightlogistics.de/",
      "location": "Holzwickede",
      "title": "Senior Entwickler (w/m/d) Self-Contained-Systems",
      "description": "<p>Gibt es eine Logistik für Karrieren? Bei uns schon. Als weltweit operierender Logistikdienstleister mit 33.000 Mitarbeitern in über 50 Ländern managen wir komplexe Supply Chains und bieten unseren Kunden innovative Mehrwertdienste. Als interner Software-Dienstleister entwickelt Rhenus Freight Network standardisierte Softwarelösungen zur Steuerung, Optimierung und Kontrolle von Transportprozessen zu Land, zu Wasser und in der Luft. Ziel dabei: Agile Lösungen zu finden und stetig an sich ändernde Bedarfe anzupassen.</p>\n<p><strong>Senior Entwickler (w/m/d) Self-Contained-Systems</strong></p>\n<p>Als Experte auf deinem Gebiet, hast du Lust darauf Verantwortung zu übernehmen und deinen Kollegen bei der Entwicklung unserer Profukte helfend zur Seite zu stehen. Dir bringt es Spaß, Neuheiten zu entdecken, um daraus einen Mehrwert für das Unternehmen zu ziehen und in Projekte umzuwandeln. Darüber hinaus sind dir Technologien wie Spring Boot oder Git nicht fremd.</p>\n<p><strong>Das erwartet Dich bei uns</strong></p>\n<ul>\n<li>Du konzipierst und entwickelst Self-Contained-Systems, für mehrere webbasierte Angebots- und Tarifsysteme der Rhenus.</li>\n<li>Dein Aufgabenfeld deckt alle Bereiche des Entwicklungsprozesses ab, sowohl Backend als auch Frontend und reicht von der Spezifikation, bis zum Test der fertigen Systeme.</li>\n<li>Dabei arbeitest du mit aktuellen Technologien wie Spring Boot, Vue.js, Docker und Git.</li>\n<li>In deiner Rolle als Senior Entwickler leitest du deine Kollegen an und stehst ihnen, auch als Ansprechpartner bei Fragen zur Technik, Architektur und den Technologien, zur Seite.</li>\n<li>Darüber hinaus unterstützt du uns bei der Steuerung von externen Dienstleistern.</li>\n</ul>\n<p><strong>Das bringst Du mit</strong></p>\n<ul>\n<li>Neben einem Studium der Informatik oder einer vergleichbaren Ausbildung, kannst du uns mit deinen Erfahrungen im Backend-Entwicklungsbereich Java begeistern.</li>\n<li>Deine Kenntnisse in den Bereichen Spring und Datenbanktechnologien wie SQL, MongoDB oder Elasticsearch, sind die eines Senior Entwicklers.</li>\n<li>In der Frontend-Entwicklung hast du Erfahrung mit JavaScript (bzw. Node.js, TypeScript) und aktuellen Frameworks wie Vue.js, Angular oder React.</li>\n<li>Dein Qualitätsanspruch, hochwertige Software zu entwickeln, erreichst du durch Clean Codes, Softwaretests und durchdachte Architekturen.</li>\n<li>Aktuelle Trends in der Softwareentwicklung behältst du gerne im Blick und hast den Wunsch, diese sinnvoll in Projekte umzusetzen.</li>\n</ul>\n<p><strong>Darauf kannst Du Dich freuen</strong></p>\n<ul>\n<li>Agile Arbeitswelt</li>\n<li>Ergonomische Arbeitsplätze</li>\n<li>Firmenfahrrad</li>\n<li>Flexible Arbeitszeiten</li>\n<li>Kostenlose Getränke</li>\n<li>Mobiles Arbeiten</li>\n</ul>\n<p><strong>Dein Kontakt:</strong></p>\n<p>Rhenus Freight Network GmbH\nJulia Schuermann\n+492301292540</p>\n<p><img src=\"https://camo.githubusercontent.com/8efcd08a314bd249db592d77a28a9b59b0f6a848/68747470733a2f2f742e676f686972696e672e636f6d2f682f61386537343937616233386432313962306465666666623464393930396630303236666236396363323130303730666366326333386132373065313363343132\"></p>\n",
      "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/2de9ca363a2f08a7c0c769eba0adb75b27e96457cfce4ccf9cbfa11d1b676f4a\">application form</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2FTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--81b835e4c7c4ce9dfc525860004145bff3b3ea77/Rhenus.jpg"
    },
    {
      "id": "459cf11a-ba8d-4c30-99f0-ec9971cbb731",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/459cf11a-ba8d-4c30-99f0-ec9971cbb731",
      "created_at": "Mon Dec 07 10:10:53 UTC 2020",
      "company": "Limango",
      "company_url": "https://www.limango.de/ehp",
      "location": "München",
      "title": "Backend Developer (m/w/d)",
      "description": "<p><strong>OUR MISSION</strong></p>\n<p>limango is the Online Shop for families – We wow our customers every day with a fantastic range of brands at very attractive prices. Based in Munich, our 300 employees share a passion for families. We do everything we can to understand their needs and fulfil their wishes. limango has everything families need: Fashion for Babies, Kids, Women and Men as well as Homeware, Toys, Cosmetics and Family holidays. At limango you’ll find both classic brands and upcoming brands from across Europe. Founded in 2007 and a member of the Otto Group since 2009 limango now has over 14 million members across Germany, Austria, France, the Netherlands and Poland and sells over 40 000 products daily to German customers alone. We want to continue to grow and win the trust of all mums in Europe. To help us achieve this, we’re looking for motivated, talented individuals to work with us and be a part of something big.</p>\n<p><strong>YOUR JOB</strong></p>\n<ul>\n<li>In the limango IT you get the chance to contribute your own ideas and know-how to the development of services all around the different processes of our ecommerce business</li>\n<li>Together with our experienced and international development teams you will improve and expand our backend systems.</li>\n<li>You will become part of our well-rehearsed agile teams of versatile and experienced developers and a dedicated product owner</li>\n</ul>\n<p><strong>YOUR PROFILE</strong></p>\n<ul>\n<li>A degree with a focus on IT or a comparable training</li>\n<li>You have sound professional experience in the development of scalable eCommerce applications in common PHP frameworks such as Symfony3+ as well as knowledge of OOP and design patterns</li>\n<li>You bring practical experience with RESTful APIs and service-oriented architecture</li>\n<li>You have profound experience in relational databases (MySQL/MariaDB)</li>\n<li>DevOps and GoLang experience are desirable</li>\n<li>A well-functioning tool is not enough for you - you enjoy optimizing complex IT processes!</li>\n</ul>\n<p><strong>OUR OFFER</strong></p>\n<ul>\n<li>Challenging tasks, independent work and a great deal of creative freedom in a working environment that burns for results and is happy to be measured against them</li>\n<li>An open, team-oriented working atmosphere</li>\n<li>A steep learning curve in a dynamic company with international orientation</li>\n<li>A great office in Munich's Tech-Spot with probably the coolest roof terrace in the city</li>\n<li>Corporate events, fresh fruit and soft drinks</li>\n</ul>\n<p>Interested? We look forward to receiving your complete application including a letter of motivation, salary requirements and your earliest possible starting date.</p>\n<p><img src=\"https://camo.githubusercontent.com/45acb531433649a0bec7cd061f20361845751f92/68747470733a2f2f742e676f686972696e672e636f6d2f682f62353665646436636137616466346137346166336563303331653663633432313365343765653866323032653961333933643533386131313336363962633362\"></p>\n",
      "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/c17c2630f354729781db3ab5e1d2c3722c44f03871ccc16b0986940e05ba2dac\">application form</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa09TIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--84ac6bbc32e03c8e273bfb3fe341dae1b0ab1683/Limango.jpg"
    },
    {
      "id": "f9ed227f-5412-421c-8dc4-58ffd263493e",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/f9ed227f-5412-421c-8dc4-58ffd263493e",
      "created_at": "Mon Oct 26 12:59:27 UTC 2020",
      "company": "wundertax GmbH",
      "company_url": "https://wundertax.de",
      "location": "Berlin",
      "title": "Senior Frontend Developer (m/f/d)",
      "description": "<h2>RESPONSIBILITIES</h2>\n<ul>\n<li>Researching, designing, implementing and maintain our new product’s frontend.</li>\n<li>Understanding and documenting the existing product (in Ruby on Rails) together with our Backend\ndevelopers.</li>\n<li>Find ways for a reliable infrastructure/product, implement and ensure them.</li>\n<li>See yourself as a user and recommend improvements for the existing product.</li>\n<li>Be part of developing the whole company culture and mindset.</li>\n</ul>\n<h2>YOUR PROFILE</h2>\n<ul>\n<li>Software development is not a science for you where many years of university are required for –\nyou see it as a craftsmanship which you have to practice over and over again.</li>\n<li>You see a product not as parts – you see it as one thing and want to take ownership for it.</li>\n<li>Meaningful and solid experience in frontend development with JS, React, HTML and CSS.</li>\n<li>Fluent in English (German is a plus).</li>\n<li>Knowledge about German taxes and/or law is a plus.</li>\n</ul>\n<h2>OUR OFFER</h2>\n<ul>\n<li>Tech stack\n<ul>\n<li>React</li>\n<li>Kubernetes on AWS</li>\n<li>GitLab (repository, CI/CD, images, packages, issue tracking)</li>\n<li>Hugo</li>\n</ul>\n</li>\n<li>Be part of an international, professional and growing team.</li>\n<li>Be able to really contribute to the architectural and product decision process.</li>\n<li>And everything else you expect from a Tech Startup located in Berlin Kreuzberg: regular team\nevents, office kicker as well as free drinks and fruits. :-)</li>\n</ul>\n<h2>ABOUT US</h2>\n<p>wundertax simplifies the filing of taxes for everyone. With our state-of-the-art online tool, we help our customers to do their taxes fast, simple and without the need for an expensive tax advisor. As a result, we already generated more than 200 million euros in tax refunds for our customers.\nNext to our general employee tool, wundertax operates several target specific online portals such as for students, police officers, soldiers or trainees to respond to the different needs of our users. We also operate the leading English-language portal for expats.</p>\n",
      "how_to_apply": "<p><a href=\"https://wundertax-jobs.personio.de/job/111785#apply\">Apply here</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHFNIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1c81bf1edb48c4d7567a8a223b4eb435a6c877c6/wundertax_Logo_80x80.png"
    },
    {
      "id": "5199e140-35e8-4d5e-b8b7-2e7b7e744709",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/5199e140-35e8-4d5e-b8b7-2e7b7e744709",
      "created_at": "Mon Oct 26 14:29:05 UTC 2020",
      "company": "wundertax GmbH",
      "company_url": "https://wundertax.de",
      "location": "Berlin",
      "title": "Senior Backend Developer (m/f/d)",
      "description": "<h2>RESPONSIBILITIES</h2>\n<ul>\n<li>Researching, designing, implementing and maintain our new product’s backend (in Java\necosystem).</li>\n<li>Understanding and documenting the existing product (in Ruby on Rails).</li>\n<li>Find ways for a reliable infrastructure/product, implement and ensure them.</li>\n<li>See yourself as a user and recommend improvements for the existing product.</li>\n<li>Be part of developing the whole company culture and mindset.</li>\n</ul>\n<h2>YOUR PROFILE</h2>\n<ul>\n<li>Software development is not a science for you where many years of university are required for – you see it as a craftsmanship which you have to practice over and over again.</li>\n<li>You see a product not as parts – you see it as one thing and want to take ownership for it.</li>\n<li>Meaningful and solid experience with the Java environment (Ruby on Rails is a plus).</li>\n<li>Fluent in English (German is a plus).</li>\n<li>Knowledge about German taxes and/or law is a plus.</li>\n</ul>\n<h2>OUR OFFER</h2>\n<ul>\n<li>Tech stack:\n<ul>\n<li>Java ecosystem</li>\n<li>Kubernetes on AWS</li>\n<li>GitLab (repository, CI/CD, images, packages, issue tracking),</li>\n<li>Postgresql</li>\n</ul>\n</li>\n<li>Be part of an international, professional and growing team.</li>\n<li>Be able to really contribute to the architectural and product decision process.</li>\n<li>And everything else you expect from a Tech Startup located in Berlin Kreuzberg: regular team events, office kicker as well as free drinks and fruits. :-)</li>\n</ul>\n<h2>ABOUT US</h2>\n<p>wundertax simplifies the filing of taxes for everyone. With our state-of-the-art online tool, we help our customers to do their taxes fast, simple and without the need for an expensive tax advisor. As a result, we already generated more than 200 million euros in tax refunds for our customers.\nNext to our general employee tool, wundertax operates several target specific online portals such as for students, police officers, soldiers or trainees to respond to the different needs of our users. We also operate the leading English-language portal for expats.</p>\n",
      "how_to_apply": "<p><a href=\"https://wundertax-jobs.personio.de/job/116269?_pc=250044#apply\">Apply here</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUNNIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c7b9663d530714518dbb06d474987c3e815edb88/wundertax_Logo_80x80.png"
    },
    {
      "id": "ff9219e4-6cb7-4e22-9beb-d660ef2edfb5",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/ff9219e4-6cb7-4e22-9beb-d660ef2edfb5",
      "created_at": "Sat Dec 05 17:19:38 UTC 2020",
      "company": "eHealth Innovation @ UHN",
      "company_url": "https://ehealthinnovation.org",
      "location": "Toronto, Canada (or remote within Canada)",
      "title": "iOS Developer",
      "description": "<p>Our mission at eHealth Innovation is to change healthcare delivery for all by designing thoughtful digital technologies that are empathetic and ultimately empower people. We work tirelessly with whip-smart local and international minds from multidisciplinary areas like science, design, technology, and health fields to transform health systems around the globe.</p>\n<p>Embedded within Toronto General Hospital (University Health Network), we are a part of one of the largest medical research centres in North America and have unparalleled access to insights from those who use our healthcare system the most - patients and their clinicians. Due to this unique positioning and our vast skill set, our work is making an impact right now in areas the of diabetes, heart failure, asthma, chronic pain, juvenile arthritis, and prostate cancer.</p>\n<p>Being in a research environment, we are able to concentrate on this goal without being distracted by short term profit motives, or keeping investors happy. Every member of our tightly knit development team has full input in every stage of project architecture, design and implementation.</p>\n<p>We are thrilled to be working with Apple on the future of digital health and to continue to find uses for Apple Watch in the clinic and for our patients! We seek passionate software developers and engineers to help us realize this vision.</p>\n<p>We are building teams to address the full user experience and not just for Apple technology. However, for this role, knowledge of iOS and Swift development is required to drive the development of the digital therapeutics we build.</p>\n<p><strong>The ideal candidate would have</strong>:</p>\n<ul>\n<li>\n<p>A BSc/MSc in Computer Science, Software/Computer Engineering, or equivalent</p>\n</li>\n<li>\n<p>At least 3 years of work experience in iOS software programming.</p>\n</li>\n<li>\n<p>Strong fundamentals in computer science and software construction.</p>\n</li>\n<li>\n<p>Writing readable, idiomatic and maintainable Swift code</p>\n</li>\n<li>\n<p>Deep understanding of iOS application design patterns and API design.</p>\n</li>\n<li>\n<p>Experienced with a variety of iOS frameworks.</p>\n</li>\n<li>\n<p>Empathy and cares about quality and knows what it means to ship high quality code.</p>\n</li>\n<li>\n<p>Experience shipping iOS apps to the App Store.</p>\n</li>\n<li>\n<p>Experience with build or test automation.</p>\n</li>\n<li>\n<p>Deep curiosity about new technology, techniques and ideas.</p>\n</li>\n<li>\n<p>Knowledge of the health system and building healthcare applications is an asset, but is not mandatory.</p>\n</li>\n<li>\n<p>An interest in open source - projects contributed to or created</p>\n</li>\n<li>\n<p>An interest in UI/UX design. Previous experience working directly with UI/UX design is an asset.</p>\n</li>\n<li>\n<p>Experience with (or an interest in) various server stacks and languages (Rails, Spring, Django, Node, etc.)</p>\n</li>\n<li>\n<p>Drive and enthusiasm to engage with peers in team discussions and decision-making processes.</p>\n</li>\n<li>\n<p>Interest in collaborating with others of diverse technical ability.</p>\n</li>\n</ul>\n<p><strong>Relevant links</strong>:</p>\n<p><a href=\"https://www.ehealthinnovation.org\">https://www.ehealthinnovation.org</a></p>\n<p><a href=\"https://www.iphoneincanada.ca/news/tim-cook-apple-proud-canadian-researchers/\">https://www.iphoneincanada.ca/news/tim-cook-apple-proud-canadian-researchers/</a></p>\n<p><strong>Job Type</strong>: Full-time, Permanent</p>\n<p><strong>Salary</strong>: $75,000.00-$90,000.00 per year</p>\n<p><strong>COVID-19 considerations</strong>:\nOur software team has been working remotely since the March 2020 and will continue to do so. Laptops and other hardware will be shipped to your home before your first day of work. All onboarding and meetings are virtual.</p>\n",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:careers@ehealthinnovation.org\">careers@ehealthinnovation.org</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaStTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0ad6d016c16fe9c6b05611e88ec2ec925e888742/ehi-new-logo-orange.png"
    },
    {
      "id": "912fc53b-1b7f-427a-bc69-25f03b597f8c",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/912fc53b-1b7f-427a-bc69-25f03b597f8c",
      "created_at": "Fri Oct 30 15:33:27 UTC 2020",
      "company": "Defendify",
      "company_url": "https://www.defendify.io/",
      "location": "Portland, ME (Remote OK)",
      "title": "Senior Full Stack Developer",
      "description": "<p>Thanks for your interest in working with us! Defendify is a fast-growing, fun-loving cybersecurity startup with a small, vibrant team based in Portland, Maine. Resourcefulness, responsiveness, problem-solving, and simplicity are values that shape who we are, what we do, and how we deliver amazing customer experiences.</p>\n<p><strong>Position Details</strong></p>\n<p>We're looking for a senior level full stack developer to join us full-time, locally and/or in a remote capacity. This is a unique and exciting opportunity as we continue to expand the footprint of our groundbreaking, all-in-one cybersecurity platform. Every team member is a valuable contributor to our core SaaS product with day-to-day responsibilities covering a variety of development needs including building, maintaining, QA, and support for every aspect of the Defendify platform.</p>\n<p><strong>We are looking for a team player who:</strong></p>\n<ul>\n<li>Has a passion for solving problems and is eager to grow, learn, and tackle daily and long-term challenges and goals.</li>\n<li>Will dig in and ask questions from users to understand requirements; make a plan; dive into an existing codebase and learn where to make changes, or where to start new code.</li>\n<li>Is a good communicator who enjoys collaboration and thrives in a development culture that values clean code, automation and testability.</li>\n<li>Maintains excellent knowledge of how modern web applications work, including REST API usage, application security, cloud deployment and development best practices.</li>\n<li>Is comfortable self-directing their own work. No micro-management here!</li>\n</ul>\n<p><strong>Requirements – Experience</strong></p>\n<ul>\n<li>5+ years of Full-Stack Development experience</li>\n<li>Has been responsible for the entire lifecycle of code in at least one project, from scratch to QA to deployment to maintenance.</li>\n<li>Has experience implementing a RESTful API and an application which consumes it.</li>\n<li>Is familiar with the philosophy and implementation of development automation: tests, continuous integration, cloud deployment, and frequent production releases using an Agile/SCRUM process.</li>\n<li>DevOps experience is a plus.</li>\n</ul>\n<p><strong>Requirements – Technical</strong></p>\n<ul>\n<li>Experienced in JavaScript including ES6, await/async, linting and front-end frameworks. We use libraries and frameworks as needed, but you need to be able to write and understand plain JS.</li>\n<li>Experience with Node and Browser based environments is required.</li>\n<li>Understand REST APIs and their role in application architectures.</li>\n<li>Experience with front end development: HTML, CSS, and familiarity with the ecosystem of related technologies (SASS, DOM). In addition, Vue (or similar framework) experience and knowledge of static site generators such as Jekyll/Hugo are helpful.</li>\n<li>Understand how to use Git(+Hub) and GitHub Flow.</li>\n<li>Some relational database experience is needed. Pluses include: Experiences in relational and in-memory databases (MySQL, Postgres, Redis) as well as knowledge in generic SQL.</li>\n<li>Some experience with Amazon Web Services (AWS), Heroku, or similar services.</li>\n</ul>\n<p><strong>Your Success</strong></p>\n<p>You are not alone in your role – Defendify's development team is made up of \"A\" players dedicated to your training and success. We thrive on an open-door policy and transparent management system that fosters team collaboration.</p>\n<p><strong>Compensation and Benefits</strong></p>\n<p>This is a flexible position open to candidates with varying levels of experience and offers long term growth potential via a well-defined career path. Compensation is competitive and commensurate with experience, and is variable based on personal and team performance. Our benefits package is comprehensive and includes health, dental, and vision coverage, educational reimbursement, a 401(k) program, paid time-off and more.</p>\n<p><strong>Love What You Do</strong></p>\n<p>Defendify employees enjoy a modern work environment and culture where everyone genuinely cares about the work they do. We're passionate about our product, the problems we're solving, our customers, our partners, and our team. We're in it together, enjoying work and play every day from team lunches, impromptu social outings and celebrations, and charity missions. And yes, there is coffee, lots and lots of coffee!</p>\n<p><strong>Opportunity Knocks</strong></p>\n<p>This position offers a great opportunity to make an impact as a part of a small team solving big problems, making cybersecurity possible for Small Business. Are you a creative self-starter with an appetite to learn and grow? If so, we'd love to hear from you!</p>\n",
      "how_to_apply": "<p>Apply now at <a href=\"https://defendify.breezy.hr/p/267bbae0c690-senior-full-stack-developer\">https://defendify.breezy.hr/p/267bbae0c690-senior-full-stack-developer</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBblNOIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a2730d55401adcd2e1832cebe43cc72f28ecbf83/Defendify_grey_R.png"
    },
    {
      "id": "1ea82024-3a55-4a55-9a46-cb9c84220ce3",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/1ea82024-3a55-4a55-9a46-cb9c84220ce3",
      "created_at": "Fri Dec 04 15:49:40 UTC 2020",
      "company": "Renewi",
      "company_url": "https://vonq.io/39HGbZN",
      "location": "eindhoven ",
      "title": "Infrastructure Designer",
      "description": "<p>Ready to design our cloud infrastructure? Are you hands-on and want to make an impact? And do you – last but not least – want to bring your knowledge towards a company that’s in the middle of the circular economy? Than we are looking for you!</p>\n<h2>Fulltime Infrastructure Designer, Eindhoven</h2>\n<p>Our mission is to recycle the waste we collect up to 75% in 2025. With our clear vision ‘Waste no more’ we make the world more sustainable and cleaner every day.</p>\n<p>In this role you will be responsible for the design, procurement, management and support of all Renewi IT infrastructure services in the Infrastructure &amp; Cloud (I&amp;C) domain. In short you’ll lead us the way in designing our cloud roadmap and in phasing out old servers. We recently started to digital transform our organization where our IT department will lead the way. In this role you will report directly to the Manager I&amp;C and you are part of the I&amp;C Team.</p>\n<p>As Infrastructure Designer, you’ll have a clear vision and know how to translate trends in your domain to policies and how to implement them.</p>\n<h2>What are your main responsibilities?</h2>\n<ul>\n<li>Support the IT I&amp;O department in translating business requirements to functional and non-functional build specifications;</li>\n<li>Develop standards, procedures and work instructions related to providing effective customer and technical support services in the assigned domain;</li>\n<li>Focus on developments in the market, technology and the organization;</li>\n<li>Coordinate the build activities with suppliers and participate in the service acceptance;</li>\n<li>Maintain a document repository for all services related in the domain;</li>\n<li>Collaborate closely with other domains for a consistent infrastructure strategy;</li>\n<li>Support direction for delivering infrastructure roadmap topics within the domain.</li>\n</ul>\n<h2>What we are looking for in an Infrastructure Designer?</h2>\n<ul>\n<li>Bachelor level of professional and intellectual ability;</li>\n<li>3+ years of experience in designing, implementing and maintaining infrastructure (especially cloud) environments;</li>\n<li>Knowledge and experience with ICT processes such as ITIL, ITSM, ASL, BiSL and Prince-2;</li>\n<li>Ability to combine ownership with a strong desire to make impact;</li>\n<li>To take responsibility and show personal leadership;</li>\n<li>Excellent in Dutch and English, both spoken as written;</li>\n</ul>\n<h2>Where do you end up?</h2>\n<p>At Renewi, we give new life to used materials every day through recycling. We are therefore working on sustainability in concrete terms and we are continuing to implement this in our own business operations. The working environment is informal, dynamic and challenging.</p>\n<p>This vacancy is based in Eindhoven where we have our main office. However we have locations throughout the Netherlands, Belgium and UK and working remotely is common practice within Renewi.</p>\n<h2>What can we offer you?</h2>\n<ul>\n<li>A competitive package;</li>\n<li>Laptop and telephone;</li>\n<li>27,5 paid vacation days;</li>\n<li>Good pension plan/coverage;</li>\n<li>Many more internal arrangements! (E.g.: bicycle plan, sports plan and group schemes);</li>\n<li>An environment that encourages entreneprenurship / an entreprenural mindset</li>\n</ul>\n<h2>Will you become our Infrastructure Designer?</h2>\n<p>Apply before Friday the 18th of December. Looking forward to read your motivation letter and CV. The first round of interviews is scheduled Wednesday the 23th of December via MS Teams. Apply now via the <strong>\"Apply\"</strong> button.</p>\n<p><a href=\"https://vonq.io/39HGbZN\">Click here for the application form!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/39HGbZN\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWlTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e9c92dbbe83f0dac17087922bb805e9733e59890/renewi.jpeg"
    },
    {
      "id": "c1c29e32-4caa-4831-89d6-ded3e6ca42f0",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/c1c29e32-4caa-4831-89d6-ded3e6ca42f0",
      "created_at": "Fri Dec 04 08:20:48 UTC 2020",
      "company": "LILLYDOO GmbH",
      "company_url": "https://we.are.lillydoo.com/l/en/o/senior-frontend-developer-wmd",
      "location": "Frankfurt, Germany (remote within Germany)",
      "title": "(Senior) Frontend Developer (f/m/d)",
      "description": "<p>as of now | full time | unlimited contract</p>\n<p>YOUR MISSION AS A FRONTEND DEVELOPER (F/M/D) AT LILLYDOO</p>\n<p>Together with your 18 colleagues your mission is to evolve our LILLYDOO website to the next level! Therefore, you are in constant contact with our Marketing, Project Management and Digital Product Department. As a part of the Development Team you take care of expanding our e-commerce platform so that we are always able to offer our customers the perfect purchasing experience. Furthermore, we offer you an open environment to evolve and implement your ideas. Rise to these exciting challenges with us, here at LILLYDOO!</p>\n<p>WHAT YOU SHOULD BRING</p>\n<ul>\n<li>At least four years professional experience in the area of UX design and frontend development</li>\n<li>You share our commitment to quality, work according to test based development and are disciplined in maintaining documentation</li>\n<li>You are fully competent in both written and spoken in English</li>\n</ul>\n<p>WHAT MAKES YOU STAND OUT</p>\n<ul>\n<li>Experience with an e-commerce platform</li>\n<li>Ideally you have also knowledge of Bootstrap, PHP &amp; Symfony</li>\n</ul>\n<p>WHAT WE OFFER YOU</p>\n<ul>\n<li>\n<p>Work-Life-Balance:\n30 Days of Holiday, Mobile Working, flexible working hours</p>\n</li>\n<li>\n<p>Office Life:\nTeam Events, Collective Monday Breakfast, Fruit Baskets, Big Variety of Drinks, HelloFreshGo Vending Machine</p>\n</li>\n<li>\n<p>Personal Benefits:\nFree Diaper Subscription for parents, Optional Givve Credit Card or Fitness First Membership (after probational period), Corporate Benefits Account, Babble Account, Company Pension (20% Employer Contribution), Relocation assistance and Visa Support</p>\n</li>\n</ul>\n<p>THAT DISTINGUISHES US</p>\n<p>„Within the dev team you can find a second family, everyone is eager to help out and support one another wherever they can. We value quality over quantity, share our knowledge with each other and let the best ideas win”\nAlex from the Development Team</p>\n",
      "how_to_apply": "<p>YOUR CONTACT AT LILLYDOO</p>\n<p>Pia | Senior Talent Acquisition Expert | <a href=\"mailto:career@lillydoo.com\">career@lillydoo.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVdTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--660cab2080c05e130b1c6ec25ce6e134cc8dc7fa/LLYD_Employer_Logo_RGB.jpg"
    },
    {
      "id": "e89d6f0e-59b4-4cd1-9b9f-5374877f8854",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/e89d6f0e-59b4-4cd1-9b9f-5374877f8854",
      "created_at": "Thu Dec 03 16:23:57 UTC 2020",
      "company": "StackFuel GmbH",
      "company_url": "https://stackfuel.com/",
      "location": "Berlin",
      "title": "Head of Engineering [m/w/d]",
      "description": "<p>Über Uns\nIn den letzten drei Jahren hat sich StackFuel zum führenden deutschen Anbieter für berufsbegleitende Online-Trainings im Bereich Daten und KI entwickelt. Im Rahmen der digitalen Transformation unterstützen wir Konzerne, mittelständische Unternehmen und Startups dabei, ihre Mitarbeitenden mit Daten- und KI-Skills fit für den digitalen Joballtag von morgen zu machen. Unsere Lösung? Eine Plattform, unser Data Lab, in der sich unsere Trainierenden orts- und zeitunabhängig berufsgleitend mit realen Datensets und Algorith¬men in einer innovativen Programmier- und Lernumgebung weiterbilden können.</p>\n<p>Wir arbeiten mit namhaften Kunden, wie z.B. Daimler, Telefónica, Deutsche Bahn oder Axel Springer zu-sam¬men und wurden bereits mehrfach durch Industrie-Awards ausgezeichnet. Wir sind ein wachsendes Team mit über 25 Experten in Berlin-Kreuzberg und verfolgen das gleiche Ziel: Den Kulturwandel von Unternehmen beschleunigen und lebenslanges Lernen und datenbasiertes Arbeiten für alle Mitarbeitenden unserer Kunden möglich zu machen.</p>\n<p><strong>Aufgaben</strong></p>\n<p>Entwickle mit uns zusammen Europas modernste interaktive Lern- und Coding-Plattform im Bereich der Daten- und KI-Technologien. Als Head of Engineering leitest du fachlich und disziplinarisch das gesamte Entwicklungsteam von StackFuel. Du bist neben dem CTO erster Ansprechpartner für die technische Produktentwicklung unserer Lernplattform und verantwortest den Aufbau und die Weiterentwicklung der Abteilung. Du bist in der Lage in einem schnell wachsenden Unternehmensumfeld zwischen relevanten Projekten zu priorisieren und diese abteilungsübergreifend abzustimmen und zu koordinieren. Deine Stärke liegt nicht nur in dem Wissen zur Planung und Umsetzung von Front- und Backend-Systemen, sondern auch in der Führung und dem Umgang mit einem umsetzungsstarken und motivierten Entwicklerteam.</p>\n<p><em>Deine Aufgaben</em></p>\n<ul>\n<li>Hauptverantwortung für die Planung und Entwicklung unserer Software (Plattform und Web)</li>\n<li>Aufbau und Management eines agilen und prozessgetriebenen Entwicklerteams</li>\n<li>Kollaborativer Austausch mit anderen Abteilungen zu Produktfeatures und Software-Projekten</li>\n<li>Mentoring des Teams durch persönliche Feedback-Talks und Weiterentwicklungen</li>\n<li>Kooperative Planung der Technologie Roadmap zusammen mit der Geschäftsführung</li>\n<li>Eigenverantwortliches Recruiting neuer Entwickler*Innen zusammen mit unserer HR-Abteilung</li>\n<li>Sicherstellung der Software-Qualität und einer effizienten Umsetzung von Software-Projekten</li>\n</ul>\n<p><strong>Qualifikation</strong></p>\n<ul>\n<li>Du hast Erfahrung im Aufbau und Management eines Entwicklerteams (min. 3-5 Jahre)</li>\n<li>Du hast starke Führungs-, Planungs- und Kommunikationsfähigkeiten</li>\n<li>Du hast Hands-on Erfahrung in der Umsetzung von skalierbaren Web-Applikationen (Fullstack)</li>\n<li>Du hast ein tiefes Verständnis über Systemarchitekturen und moderne Software-Technologien</li>\n<li>Du kannst andere für deine Ideen und Strategien begeistern und motivieren</li>\n<li>Du kannst Projektanforderungen in Abhängigkeit von strategischen Zielen planen und priorisieren</li>\n<li>Du sprichst Deutsch und Englisch auf einem Business Level</li>\n</ul>\n<p><strong>Unser Technologie-Stack</strong></p>\n<ul>\n<li>Python</li>\n<li>Python Machine Learning Libs (e.g. TensorFlow, SciKit-Learn, etc.)</li>\n<li>Backend: Django / REST / GraphQL</li>\n<li>Frontend: TypeScript / JavaScript Frameworks (e.g. React.js, Next.js, Angular 2)</li>\n<li>Jupyter Ecosystem (Notebooks, Hub, Lab)</li>\n<li>Node (NPM)</li>\n<li>Docker, Docker Hub</li>\n<li>Jira, Bitbucket, Confluence, Slack, Trello</li>\n</ul>\n<p><strong>Unser Angebot</strong></p>\n<ul>\n<li>Du arbeitest direkt mit unserem CTO zusammen und bist Teil des Senior Management-Teams</li>\n<li>Du erhältst signifikante Firmenanteile durch unser ESOP-Programm</li>\n<li>Du erhältst eine hervorragende Perspektive in einem aufstrebenden, schnell wachsenden Unternehmen in der EdTech- und Software-Branche</li>\n<li>Wir bieten dir regelmäßige Schulungen und Workshops auf höchstem Niveau als festen Bestandteil deiner Weiterbildung. Auch kannst du jederzeit unsere Online-Trainings absolvieren und dich selbst zum Daten- oder KI-Experten weiterbilden</li>\n<li>Du arbeitest in einem hochmotivierten und smarten Team, dass du selbst mit aufbaust</li>\n<li>Bei uns erlebst du eine offene Feedbackkultur, flexible Organisationsstrukturen und Kommunikation auf Augenhöhe</li>\n<li>Du genießt eine flexible Einteilung deiner Arbeitszeit inkl. mobiles Arbeiten und du arbeitest in einem komplett neuen Büro im Bergmannkiez in Berlin-Kreuzberg</li>\n<li>Wir kümmern uns mit kleinen Aufmerksamkeiten wie frischem Obst, vielfältigen Teamevents und gemeinsamen Aktivitäten um jeden einzelnen unserer Kollegen</li>\n<li>Unsere Mission ist es, Europas führende Institution für digitale Weiterbildungs- und Umschulungsprogramme im Bereich Data und AI zu sein.</li>\n</ul>\n<p><strong>Fühlst Du dich angesprochen? Dann sende uns deine Bewerbung und lass uns wissen, wann du starten kannst.</strong></p>\n<p>Wir freuen uns darauf, dich kennenzulernen.</p>\n<p>StackFuel GmbH\nAnsprechpartner: Stefan Berntheisel\nNostitzstrasse 20\n10961 Berlin</p>\n",
      "how_to_apply": "<p><a href=\"https://stackfuel.join.com/jobs/1640776-head-of-engineering-m-w-d?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=head%2Bof%2Bengineering%2Bm%2Bw%2Bd\">https://stackfuel.join.com/jobs/1640776-head-of-engineering-m-w-d?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=head%2Bof%2Bengineering%2Bm%2Bw%2Bd</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHVTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--26765cd6bfbdfe7987a29f5142bdc93922701ebf/stack-fuel-gmb-h-logo-xl.jpg"
    },
    {
      "id": "9b316dca-5884-4a72-a053-47d745fdec3b",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9b316dca-5884-4a72-a053-47d745fdec3b",
      "created_at": "Thu Dec 03 15:57:56 UTC 2020",
      "company": "Rabobank",
      "company_url": "http://rabobank.jobs/en/student-and-starter/it/",
      "location": "Croeselaan 18, 3521CB, Utrecht",
      "title": "Junior CI/CD Engineer",
      "description": "<p>Please note: this position is linked to our Young Professional Program IT. In addition to your work as a Junior CI/CD Engineer, you will pursue an 18-month program in which you carry out challenging projects and receive training in the field of personal and professional growth. We help you to discover your strengths and you are challenged to become the best version of yourself. You will also learn to form an independent opinion, but also to experience the value of working together in teams. Read more here if you want to know more about the program: <a href=\"https://rabobank.jobs/en/student-and-starter/it/\">https://rabobank.jobs/en/student-and-starter/it/</a></p>\n<p>We will only shortlist candidates with a motivation letter expressing their interest in the role and in the program.</p>\n<p><strong>Imagine…</strong></p>\n<p>Being responsible for everything concerning CI/CD Automation on Azure DevOps and our Infrastructure as Code environments on Azure Cloud. As a Junior CI/CD Engineer, you will be in charge of managing and automating a diversity of platforms within the organization. You will also help to build intelligent CI/CD pipelines, implement smart monitoring using artificial intelligence and machine learning, and improve our Azure Cloud landscape with services to enable the squads to deliver every day.</p>\n<p>Besides regular support activities, you have contact with customers who ask for your advice and support.</p>\n<p><em>As a Junior CI/CD Engineer you can make a difference;</em></p>\n<p>Within our IT4IT squad, we are responsible for helping 30+ development teams across the Tribe with their automation ambition. We offer advice and help to improve these 30+ teams with their automation process, their CI/CD (Continuous Integration / Continuous Delivery) pipelines, and Infrastructure as Code on Azure Cloud.</p>\n<p><strong>Making a difference</strong></p>\n<ul>\n<li>You are part of the Distribution domain and are responsible for helping teams to continuously improve their development process.</li>\n<li>You and your team develop solutions on various cloud platforms like Azure Cloud, AWS, Pivotal Cloud Foundry, Siebel, Pega.</li>\n<li>The teams have been set a goal to be able to deliver software to production within a week before the end of the year.</li>\n<li>You are developing complete and scalable CI/CD pipelines with Kubernetes, Docker, Terraform, or Azure DevOps.</li>\n<li>These pipelines mostly reside on Azure Cloud, but we still have some Jenkins on Cattle environments on-premise which are moving towards Azure Cloud as a cloud solution.</li>\n<li>You will help teams by implementing smart monitoring using Artificial Intelligence and Machine Learning which considerably reduces the mean time to detect for squads.</li>\n<li>You will be welcomed in an agile environment where we learn from our mistakes and where the importance of having fun is understood.</li>\n</ul>\n<p><strong>With each other</strong></p>\n<p>Collaboration is at the heart of everything we do. Our team brings talented people together to build the best solutions for our clients.</p>\n<p><strong>With you</strong></p>\n<p>In the Distribution domain, we value customer focus, a good energy level, motivation to get things done, empathy, and embracing change. In addition, it's important that you recognize yourself in the checklist below:</p>\n<ul>\n<li>a Bachelor’s degree or higher in Computer Science or Engineering</li>\n<li>0 to 2 years of working experience.</li>\n<li>Interest in Machine Learning and AI.</li>\n<li>Eager to learn Azure DevOps, Azure Cloud, Kubernetes, Terraform, Helm;</li>\n<li>experience with Azure Git as version control system.</li>\n<li>Knowledge of CI/CD pipelines</li>\n<li>knowledge of and experience with Cloud (IAAS/PAAS) services like Azure Cloud or AWS;</li>\n<li>fluent in Dutch and English on a professional level.</li>\n</ul>\n<p><strong>Growing a better world together</strong></p>\n<p>You will already be aware that Rabobank is a financial services provider for 7.1 million customers in 40 countries. But did you know that we aim to contribute to real change with our 'Growing a better world together' mission? We do so in countless ways, such as:</p>\n<p>Yearly we invest heavily in the Dutch voluntary sector. We support 1250 organisations for sports and culture, which are a second home for many people.\nIn a project with Humanitas we help people with financial problems, struggling to organise their home finances.</p>\n<p><strong>Interested?</strong></p>\n<p>We would love to help you fuel and invest in your career and ambitions in an environment where you keep learning every day. We give you the space to innovate and initiate. In this way, we offer you numerous opportunities to grow and help you exceed your expectations, to do the right thing exceptionally well, and to therefore grow as a professional. In addition, with us (on the basis of a 40-hour working week), you can also expect:</p>\n<ul>\n<li>a gross monthly salary between € 3000 and 3200</li>\n<li>a thirteenth month and holiday pay;</li>\n<li>an Employee Benefit Budget (9, or 10 % of your monthly salary). You decide how to spend this budget. This may include purchasing extra leave days, making extra pension contributions, or even receiving a monthly cash pay-out;</li>\n<li>100 % reimbursement of the costs of home/work travel if you travel by public transport! Do you still - prefer to travel by car or motorbike? Then choose a home/work travel allowance;</li>\n<li>a pension scheme, to which your contribution is only 5%.</li>\n</ul>\n<p>​<strong>Let's meet…</strong></p>\n<p>Are you ready to join Rabobank as a Junior CI/CD Engineer and to make a difference for yourself, for our customers and for our society?  Then do not hesitate and send your cv and motivation letter to us via the <a href=\"https://vonq.io/37tEg8p\"><strong>application form</strong></a> so we can invite you for a personal meeting.</p>\n<p><strong>Good to know:</strong></p>\n<ul>\n<li>The onboarding process includes screening. Based on the screening procedures in place at Rabobank, we assess whether new staff are reliable enough to work at Rabobank.</li>\n<li>The onboarding process for this vacancy includes an individual assessment.</li>\n<li>Everyone is different, and it is exactly those differences that help us become an even better bank. That's why we want to know who you really are!</li>\n</ul>\n",
      "how_to_apply": "<p><strong>Click <a href=\"https://vonq.io/37tEg8p\">here</a> to apply!</strong></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHFTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c1f2f99272f4df894d85494059f3e83e2698bef1/Rabobank.jpeg"
    },
    {
      "id": "fddb7d4c-d7e0-4056-8d9a-89d5731f6a33",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/fddb7d4c-d7e0-4056-8d9a-89d5731f6a33",
      "created_at": "Thu Dec 03 15:29:50 UTC 2020",
      "company": "Amazon Web Services AWS",
      "company_url": "https://aws.amazon.com/de/",
      "location": "Berlin",
      "title": "Senior Front-End Engineer",
      "description": "<p>Do you want to shape the future of cloud computing? Are you interested in building beautiful console experiences that will shape how customers build and manage solutions on AWS? Join us in inventing experiences that are a joy for customers to use!</p>\n<p>Our team is looking for a Senior Front-End Engineer who can help our team design and build customer experiences that span multiple customer use cases and Amazon web services. To achieve this, you will collaborate closely with AWS leadership, product management, UX design, and multiple service teams to define requirements and designs that put the customer first. As a technical leader, you will drive these ideations to reality along with a team of talented engineers.</p>\n<p>The ideal candidate is passionate about building user experiences and has a track record of building interfaces which are beautiful in form, function, and simplicity. The ability to work within a creative and positive team environment are key to the role.</p>\n<p>Come join a team of bright, passionate, and customer obsessed individuals who are having fun and making history from within a start-up like environment. We'd love to talk to you!</p>\n<p>BASIC QUALIFICATIONS</p>\n<ul>\n<li>8+ years of industry experience</li>\n<li>At least 5 years of experience with one of the common Javascript based web frameworks: React, Angular, Vue, or Backbone</li>\n<li>Strong Computer Science and development fundamentals, including object-oriented design, data structures, algorithm design, and complexity analysis</li>\n<li>Experience serving as technical lead throughout the full software development lifecycle, end-to-end, from scoping, planning, conception, design, implementation, and testing to documentation, delivery and maintenance.</li>\n<li>Creates reliable/maintainable code and finds creative and scalable solutions to difficult problems</li>\n<li>Knowledge of professional software engineering and best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations</li>\n<li>Experience driving the technical design and implementation of large-scale web applications</li>\n<li>English language fluency (written &amp; verbal)</li>\n<li>Willing to relocate to Berlin, Germany</li>\n</ul>\n<p>PREFERRED QUALIFICATIONS</p>\n<ul>\n<li>Experience with React and Redux.</li>\n<li>Experience with large scale web applications</li>\n<li>Experience communicating directly with users, software development teams, or management in order to share plans/vision or collect data (e.g. requirements) to drive product improvement</li>\n<li>Demonstrated ability to mentor junior software engineers or software developers in all aspects of their engineering duties.</li>\n<li>Track record of interviewing &amp; hiring top tier engineering talent</li>\n<li>Experience and/or a strong interest in AWS and/or cloud computing in general</li>\n<li>Experience building software solutions that leverage AWS services (e.g. S3, DynamoDB, EC2)</li>\n</ul>\n<p>Explore all AWS Germany Senior Software Engineering roles available, meet our team members and get prepared for your interviews via link: <a href=\"https://awsseniorsoftwaregermany.splashthat.com/\">https://awsseniorsoftwaregermany.splashthat.com/</a></p>\n",
      "how_to_apply": "<p><a href=\"https://ad.doubleclick.net/ddm/clk/436616238;288615901;o?https://www.amazon.jobs/en/jobs/1055710/senior-front-end-engineer?cmpid=JBOTAW6349B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid\">https://ad.doubleclick.net/ddm/clk/436616238;288615901;o?https://www.amazon.jobs/en/jobs/1055710/senior-front-end-engineer?cmpid=JBOTAW6349B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFNTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e475d7d2b81ffe7d690d8cf8606abc2e37284c2b/aws.jpg"
    },
    {
      "id": "286d8321-c5e5-4311-82b5-1756e5393199",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/286d8321-c5e5-4311-82b5-1756e5393199",
      "created_at": "Thu Dec 03 15:26:50 UTC 2020",
      "company": "Amenitiz",
      "company_url": "https://www.amenitiz.io/",
      "location": "Barcelona",
      "title": "Senior Backend Developer (RoR)",
      "description": "<p>Amenitiz is a fast-growing SaaS startup based in Barcelona and servicing over 1'500 customers in 24 months. Backed by top tier investors, Amenitiz is revolutionizing Hospitality software by centralizing all the hotelier needs in a single platform (website builder, PMS, channel manager, payment system, and much more).</p>\n<p>We’re passionate and ambitious about our mission and aim to promote a culture that cares deeply about its customers.</p>\n<p>Despite the current global pandemic, we’re continuously growing and adapting to the situation, our team continues to rise stronger and that’s where you come in!</p>\n<p>Are you a Software Engineer with extensive programming experience? Is your code fast, efficient, and reliable? Do you particularly enjoy working with amazing people and building something impacting? If so, let’s talk!</p>\n<p>We’re not looking for experts. We’re looking for smart people who can bring in the knowledge and the best processes to get things done. </p>\n<p>At Amenitiz, we are customer-centric, you will work on a day-to-day basis with our product team to design, architect, and implement our product. Our mission at Amenitiz is to support the digital transformation of Hospitality through a reliable SaaS solution offering a unique experience to its users.</p>\n<p>The whole Amenitiz team is based in Barcelona (our offices are in the heart of the city, near Plaza Cataluña); the Tech team counts 4 people, intending to grow to 12 people within the next 6 months.</p>\n<p><strong>As Senior Backend Developer, this position involves:</strong></p>\n<ul>\n<li>Product development in Ruby/Rails of a hospitality-related web-based product.</li>\n<li>Integrations between our platform to 3rd party APIs.</li>\n<li>Work in an Agile environment with strong attention to scalability (We are serving hundreds of thousands of unique visitors per month through our CMS).</li>\n<li>Discuss, question, challenge, and offer technical solutions to product needs alongside the Product and Design Teams.</li>\n<li>Being able to mentor, coach, and train other colleagues as a domain expert.</li>\n<li>Identify bottlenecks, bugs, and propose solutions.</li>\n</ul>\n<p><strong>Required skills and experience:</strong></p>\n<ul>\n<li>Bachelor's degree or equivalent practical experience.</li>\n<li>6 years+ experience in web development.</li>\n<li>3 years+ experience in Ruby.</li>\n<li>Pragmatism and obsession for simplicity, efficiency, and performance.</li>\n<li>Proven knowledge of OOP, databases, development, and test methodologies.</li>\n<li>Obsession for quality and testing.</li>\n<li>Eager to learn new technologies and frameworks.</li>\n<li>Strong communication skills.</li>\n<li>Proactive, driven, entrepreneurial with a 'can do’ attitude.</li>\n</ul>\n<p><strong>Bonus points for:</strong></p>\n<ul>\n<li>Worked in a fast-growing startup environment.</li>\n<li>Experience in the hospitality industry.</li>\n</ul>\n<p><strong>Our stack:</strong></p>\n<ul>\n<li>Ruby on Rails</li>\n<li>Postgres and Redis</li>\n<li>Memcached</li>\n<li>Sidekiq</li>\n<li>HAproxy</li>\n<li>Heroku</li>\n<li>DigitalOcean</li>\n</ul>\n<p><strong>What do we offer?</strong></p>\n<ul>\n<li>A competitive salary.</li>\n<li>An amazing working environment, where you will be able to make a true contribution and get your voice heard.</li>\n<li>The opportunity to have a huge impact on developing a fast-growing business that is at a pivotal point in its growth to expand internationally.</li>\n<li>The team is growing fast and we offer plenty of career and development opportunities.</li>\n<li>Flexibility to work from home part of the week.</li>\n</ul>\n",
      "how_to_apply": "<p>Send your application on <a href=\"https://amenitiz.welcomekit.co\">https://amenitiz.welcomekit.co</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEtTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1aba9150689b0bddbf9f38332bb396e13bea6c2c/0%20(1).png"
    },
    {
      "id": "41e6da3c-3667-472f-a78e-039614ec5c1d",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/41e6da3c-3667-472f-a78e-039614ec5c1d",
      "created_at": "Thu Dec 03 15:26:25 UTC 2020",
      "company": "Amazon Web Services AWS",
      "company_url": "https://aws.amazon.com/de/",
      "location": "Berlin",
      "title": "Sr. Software Development Engineer - Amazon Redshift",
      "description": "<p>Are you passionate in building high quality products that users find super-efficient? Want to disrupt an industry by revolutionizing the way people view, manage and analyze huge volumes of data? Looking for a job where your work can have direct and massive impact on one of the newest and most exciting AWS services? If so, please read on about the opportunity to be a part of our team.</p>\n<p>We are looking for an expert software development engineer to join us to innovate on this new service that addresses the customer needs to set a new standard for data analytics tooling. If you have the skills for building high-performance and secure services that empowers services at massive scale, and are interested in cutting-edge cloud computing, this might be the job for you.</p>\n<p>Joining the Amazon Redshift team gives you the opportunity to:</p>\n<ul>\n<li>Work on the latest technology, as we constantly build the latest research concepts into our applications.</li>\n<li>Be part of something big, as you are working on a key pillar of AWSs extensive service portfolio and thousands of Amazon Redshift customers benefit from your contributions.</li>\n<li>Learn from the best, as you are working on challenging engineering tasks in a team of very experienced experts that are close to support you.</li>\n<li>Be part of a great team, as we invest a lot to create an inclusive environment that allows you to perform at your best, while maintaining a fun atmosphere.</li>\n</ul>\n<p>As a Senior Software Development Engineer at Amazon Redshift, you will:</p>\n<ul>\n<li>Help define the system architecture, own and implement specific components, build highly available, secure, scalable, distributed and event-driven systems.</li>\n<li>Contribute to planning, architecture design, implementation, testing, and process improvement. Lead the design, implementation, and delivery of software in ambiguous and complex problem spaces.</li>\n<li>Participate in code and design reviews to maintain our high development standards</li>\n<li>As an early team member, you will take responsibility for technical problem solving, creatively meeting product objectives, and developing best practices</li>\n<li>Collaborate closely with UX designers, and other SDE team members to help define the scope of the product</li>\n<li>Find out what it takes to engineer secured systems for \"Amazon Scale\"</li>\n</ul>\n<p>BASIC QUALIFICATIONS</p>\n<ul>\n<li>A Bachelor’s degree in Computer Science, Computer Engineering, or a related technical discipline (or the equivalent)</li>\n<li>Extensive production experience with developing software services and an understanding of design for scalability, performance and reliability in a continuous-integration and continuous-deployment environment</li>\n<li>Proficiency in Node.js and experience with a variety of other modern programming languages (Java, JavaScript, C/C++)</li>\n<li>Proven problem-solving skills and knowledge of data structures, algorithms, object-oriented programming and systems design</li>\n<li>Production experience with relational or non-relational database systems</li>\n<li>Proven experience in designing, building, and operating large-scale distributed systems and web services on cloud providers</li>\n<li>Experience with the hiring and mentorship/leadership of junior engineers</li>\n</ul>\n<p>PREFERRED QUALIFICATIONS</p>\n<ul>\n<li>7+ years of professional experience as an engineer working on highly scalable backend systems, preferably within AWS technologies</li>\n<li>3+ years of experience in Node.js development.</li>\n<li>A track record of successfully delivering projects as part of an agile software development team</li>\n<li>Excellence in technical communication with peers and non-technical cohorts</li>\n<li>Knowledge of professional software engineering practices and best practices for full software development life cycle, including coding standards, code reviews, source control management, continuous deployments, testing and operations</li>\n<li>Proven experience in being a self-starter who enjoys solving challenging problems and working in a fast-paced, flexible, and collaborative environment</li>\n</ul>\n<p>Explore all AWS Germany Senior Software Engineering roles available, meet our team members and get prepared for your interviews via link: <a href=\"https://awsseniorsoftwaregermany.splashthat.com/\">https://awsseniorsoftwaregermany.splashthat.com/</a></p>\n<p>Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build.</p>\n<p>Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice to know more about how we collect, use and transfer the personal data of our candidates.</p>\n",
      "how_to_apply": "<p><a href=\"https://ad.doubleclick.net/ddm/clk/436616238;288615907;u?https://www.amazon.jobs/en/jobs/1122391/sr-software-development-engineer-amazon-redshift?cmpid=JBOTAW6348B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid\">https://ad.doubleclick.net/ddm/clk/436616238;288615907;u?https://www.amazon.jobs/en/jobs/1122391/sr-software-development-engineer-amazon-redshift?cmpid=JBOTAW6348B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaENTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--876bfa21ba4ad669e87436a495d3fc7b75d75a61/aws.jpg"
    },
    {
      "id": "9f2b589e-76f2-4052-b17d-cd6fa046aa00",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9f2b589e-76f2-4052-b17d-cd6fa046aa00",
      "created_at": "Thu Dec 03 15:21:44 UTC 2020",
      "company": "Amazon Web Services AWS",
      "company_url": "https://aws.amazon.com/de/",
      "location": "Berlin",
      "title": "Senior Software Development Engineer - AWS Billing",
      "description": "<p>Are you interested in building the next generation, cloud-based commerce system for AWS that’s used by millions of customers worldwide? Are you excited by the idea of building real-time stream processing systems that operate at Petabyte scale? Do you want to make an impact at a $10-billion-a-year business? Then we need to talk!</p>\n<p>Computing AWS bills, at its core, is a challenging, distributed systems problem that requires calculations performed over trillions of usage records, millions of accounts, and hundreds of thousands of different rates. Furthermore, our applications must meet strict requirements for accuracy and once-and-only-once processing.</p>\n<p>As a software developer, you have the opportunity to develop a federated billing system that supports new pricing models using cutting edge technologies like Kinesis, DynamoDB, S3, Lambda, and more. Additionally, you will build meaningful software that helps AWS to bring our largest customers over to the Cloud. And finally, as an Amazon engineer, you get to own the full lifecycle of your systems, work on challenging problems at \"Amazon Scale\", and collaborate with high-performance technical teammates and having fun doing it.</p>\n<p>If all of this sounds exciting to you, then please come join us and help shape the future of the Cloud.</p>\n<p>BASIC QUALIFICATIONS</p>\n<ul>\n<li>Bachelor’s Degree in Computer Science or related field, or equivalent experience to a Bachelor's degree based on 3 years of work experience for every 1 year of education</li>\n<li>7+ years professional experience in software development</li>\n<li>Computer Science fundamentals in object-oriented design</li>\n<li>Computer Science fundamentals in data structures</li>\n<li>Computer Science fundamentals in algorithm design, problem solving, and complexity analysis</li>\n</ul>\n<p>PREFERRED QUALIFICATIONS</p>\n<ul>\n<li>Strong Java coding skills; you will be able to discuss in depth both the design and your significant contributions to one or more projects using the Java language</li>\n<li>Experience with distributed system performance analysis and optimization</li>\n<li>Experience working in an Agile/Scrum environment</li>\n<li>Excellent written and verbal communication skills with the ability to present complex technical information in a clear and concise manner to a variety of audiences</li>\n<li>Experience with distributed (multi-tiered) systems, algorithms, and relational databases</li>\n<li>Ability to effectively articulate technical challenges and solutions</li>\n<li>Deal well with ambiguous/undefined problems; ability to think abstractly</li>\n</ul>\n<p>Explore all AWS Germany Senior Software Engineering roles available, meet our team members and get prepared for your interviews via link: <a href=\"https://awsseniorsoftwaregermany.splashthat.com/\">https://awsseniorsoftwaregermany.splashthat.com/</a></p>\n<p>Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We value your passion to discover, invent, simplify and build.</p>\n",
      "how_to_apply": "<p><a href=\"https://ad.doubleclick.net/ddm/clk/436616238;288615880;u?https://www.amazon.jobs/de/jobs/1098684/senior-software-development-engineer-aws-billing?cmpid=JBOTAW6347B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid\">https://ad.doubleclick.net/ddm/clk/436616238;288615880;u?https://www.amazon.jobs/de/jobs/1098684/senior-software-development-engineer-aws-billing?cmpid=JBOTAW6347B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3lTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d81c806e813c818d7a32f9e3c9ee70b2d0c8fc3a/aws.jpg"
    },
    {
      "id": "de6af81b-f0fd-40d1-832c-3680fd56f6e0",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/de6af81b-f0fd-40d1-832c-3680fd56f6e0",
      "created_at": "Thu Dec 03 15:17:42 UTC 2020",
      "company": "Amazon Web Services AWS",
      "company_url": "https://aws.amazon.com/de/",
      "location": "Berlin",
      "title": "Senior Software Development Engineer - Amazon Web Services - Berlin (m/f)",
      "description": "<p>The AWS Commerce Platform provides the back and front-end services that enable AWS customers to purchase AWS services and understand and manage their infrastructure costs. Come to join our team to tackle some of the hardest scalability, performance, and distributed computing challenges in the world. We process trillions of events per month using stream processing techniques (Kinesis), process billions of line items via map reduce (EMR), and manage artifacts through the latest in database technologies (DynamoDB and Aurora). We process big data and provide tools for customers to interactively understand their bills. We also provide the analytics that let customers manage billions of dollars of IT usage and spending. Because we sit at the nexus of all AWS services and interact directly with end-customers, we also work closely across all AWS teams to ensure that we offer a great customer experience.</p>\n<p>As a senior developer in the team, you will design, build and operate services that will help AWS to meet the needs of our customers. Delivering a reliable and high-performance service at AWS scale requires team work of engineers with technical expertise and creativity. At Amazon, we also expect engineers like you to interact with customers, other teams, to understand our business goals, and to innovate rapidly, delivering high-quality and ground-breaking functionality.</p>\n<p>You are creative, curious, responsible, and able to work with others to rapidly turn an idea into working code. You’re excited about writing code, implementing big ideas, and helping to coach those around you to raise the team’s bar for code quality. You want the opportunity to grow your technical and professional skills while helping AWS grow. You relish the opportunity to dig into complex operational issues and to help customers build the next generation of applications.</p>\n<p>If you enjoy engaging in passionate discussions with smart people and letting the best ideas rise to the top while designing and building systems that can scale and solving challenging problems just push our door to know more about us.</p>\n<p>BASIC QUALIFICATIONS</p>\n<ul>\n<li>Bachelor's degree in Computer Science, Computer or Electrical Engineering, Mathematics or a related field</li>\n<li>7+ years of professional software development experience</li>\n<li>Strong Java coding skills; you will be able to discuss in depth both the design and your significant contributions to one or more projects using the Java language</li>\n<li>Experience with distributed systems, consistent hashing, distributed locking, replication, and load balancing</li>\n<li>Ability to effectively articulate technical challenges and solutions</li>\n</ul>\n<p>PREFERRED QUALIFICATIONS</p>\n<ul>\n<li>Experience in AWS technologies (SNS,SQS,Lambda,DDB.etc.)</li>\n<li>Experience in E-Commerce payments/billing/invoicing processing</li>\n<li>Experience in Agile/Scrum</li>\n<li>Excellent written and verbal communication skills with the ability to present complex technical information in a clear and concise manner to a variety of audiences</li>\n</ul>\n<p>Amazon is an Equal Opportunity-Affirmative Action Employer- Female / Minority / Disability / Veteran / Gender Identity / Sexual Orientation</p>\n",
      "how_to_apply": "<p><a href=\"https://ad.doubleclick.net/ddm/clk/436616238;288615883;x?https://www.amazon.jobs/de/jobs/1287125/senior-software-development-engineer-amazon-web-services-berlin-m-f?cmpid=JBOTAW6346B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid\">https://ad.doubleclick.net/ddm/clk/436616238;288615883;x?https://www.amazon.jobs/de/jobs/1287125/senior-software-development-engineer-amazon-web-services-berlin-m-f?cmpid=JBOTAW6346B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3FTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5d3e2e61e97bbbb9bea7260f6e921fa786a464b0/aws.jpg"
    },
    {
      "id": "3270824f-79f4-4600-9dbd-915e8573f51e",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/3270824f-79f4-4600-9dbd-915e8573f51e",
      "created_at": "Thu Dec 03 15:10:10 UTC 2020",
      "company": "Amazon Web Services AWS",
      "company_url": "https://aws.amazon.com/de/",
      "location": "Dresden",
      "title": "Senior Software developer - Kernel Engineer",
      "description": "<p>The Development Center Dresden</p>\n<p>In 2012 Amazon expanded to Dresden with it being the home-base of the Amazon Development Center team. The Kernel and Operating System team creates the heart of EC2, the actual virtual compute instance definitions and Amazon Linux, the operating system for our cloud. Being part of Amazon means constantly driving innovation and working on complex technical challenges every day.</p>\n<p>Position</p>\n<p>Amazon is looking for an experienced Linux Kernel Developer for a Kernel and Operating System team. As part of the team, you will be given the chance to have a significant impact on our systems, our business and most importantly our customers.</p>\n<p>If you passionate about Hypervisor, have deep technical knowledge and want to build solutions to challenging problems that directly affect millions of people: there may be no better place than Amazon for you to impact the world!</p>\n<p>You will be responsible for the lowest layer of the AWS software stack, managing the Linux Kernel and Hypervisor development for AWS.</p>\n<p>You will be improving the Linux Kernel to be used as a Dom0 operating system as well as a guest operating system.</p>\n<p>Your work will focus on new features and performance and reliability improvements for server workloads. You will be working on key areas of the Linux Kernel such as:</p>\n<ul>\n<li>Hypervisor</li>\n<li>Block I/O</li>\n<li>Networking</li>\n<li>PV Driver</li>\n<li>IOMMU</li>\n</ul>\n<p>BASIC QUALIFICATIONS</p>\n<ul>\n<li>BS in Computer Science or related discipline, or equivalent work experience</li>\n<li>5+ years of experience working on the Linux Kernel</li>\n<li>Strong skill in C programming</li>\n<li>Proficient in at least one CPU architecture such as x86 or ARM.</li>\n<li>Direct experience with Linux kernel and virtualization development</li>\n</ul>\n<p>PREFERRED QUALIFICATIONS</p>\n<ul>\n<li>Basic understanding of performance critical areas of the Linux Kernel</li>\n</ul>\n<p>Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice to know more about how we collect, use and transfer the personal data of our candidates.</p>\n<p>Explore all AWS Germany Senior Software Engineering roles available, meet our team members and get prepared for your interviews via link: <a href=\"https://awsseniorsoftwaregermany.splashthat.com/\">https://awsseniorsoftwaregermany.splashthat.com/</a></p>\n",
      "how_to_apply": "<p><a href=\"https://ad.doubleclick.net/ddm/clk/436616238;288615886;a?https://www.amazon.jobs/en/jobs/975149/senior-software-developer-kernel-engineer?cmpid=JBOTAW6345B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid\">https://ad.doubleclick.net/ddm/clk/436616238;288615886;a?https://www.amazon.jobs/en/jobs/975149/senior-software-developer-kernel-engineer?cmpid=JBOTAW6345B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2VTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a442714a15cb4b7487da1ae8db434e65fd8b5ea8/aws.jpg"
    },
    {
      "id": "79544da5-c2e1-4a58-9141-887f82aff720",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/79544da5-c2e1-4a58-9141-887f82aff720",
      "created_at": "Thu Dec 03 15:05:51 UTC 2020",
      "company": "Amazon Web Services AWS",
      "company_url": "https://aws.amazon.com/de/",
      "location": "Berlin",
      "title": "Software Development Engineer - Amazon Redshift Spectrum",
      "description": "<p>We are searching for Software Development Engineers with passion for large-scale system building and data-intensive applications. If you are motivated by the fact that your code helps thousands of the world biggest companies to get insights from their data – this role is for you!</p>\n<p>Our cloud data warehouse Amazon Redshift manages all the work needed to set up, operate, and scale a data warehouse, from provisioning capacity and installing software to monitoring and backing up the cluster, to applying patches and upgrades. With Redshift Spectrum, our customers can easily query data from Amazon S3, thereby scaling their warehouse out to Exabytes and allowing them to integrate data in all kinds of file formats from their data lake into their analytics.</p>\n<p>As Software Development Engineer at Amazon Redshift Spectrum, you will:</p>\n<ul>\n<li>Translate functional and technical requirements into system designs.</li>\n<li>Develop and enhance Redshift Spectrum components that are maintainable and testable, thereby leveraging the latest agile software engineering methodologies.</li>\n<li>Participate in code and design reviews to maintain our high development standards.</li>\n<li>Operate a large-scale, distributed service in the cloud.</li>\n<li>Mentor other new engineers and help mature a fast-growing team.</li>\n</ul>\n<p>Joining the Amazon Redshift Spectrum team gives you the opportunity to:</p>\n<ul>\n<li>Work on the latest technology, as we constantly build the latest research concepts into Redshift Spectrum.</li>\n<li>Be part of something big, as you are working on a key pillar of AWSs extensive service portfolio and thousands of Amazon Redshift customers benefit from your contributions.</li>\n<li>Learn from the best, as you are working on challenging engineering tasks in a team of very experienced experts that are close to support you.</li>\n<li>Be part of a great team, as we invest a lot to create an inclusive environment that allows you to perform at your best, while maintaining a fun atmosphere.</li>\n</ul>\n<p>BASIC QUALIFICATIONS</p>\n<ul>\n<li>3 or more years of experience in professional software development</li>\n<li>Experience in writing system software in a systems language such as C or C++</li>\n<li>Bachelors in Computer Science or Engineering, or equivalent experience.</li>\n<li>Very good knowledge of data structures and algorithms.</li>\n<li>Ability to write high-quality code that is robust and easy to maintain.</li>\n<li>Ability to work in a fast paced and agile development environment.</li>\n<li>Experience debugging, diagnosing, and trouble-shooting software.</li>\n<li>Good communication skills, analytical abilities, and design skills.</li>\n</ul>\n<p>PREFERRED QUALIFICATIONS</p>\n<ul>\n<li>Masters or PhD in Computer Science.</li>\n<li>Experience in writing multi-threaded programs requiring concurrency and synchronization mechanisms.</li>\n<li>Experience delivering and operating large-scale, highly available distributed systems.</li>\n<li>Experience with database internals especially query optimization, and query execution.</li>\n<li>Proven ability to drive tasks to completion and take ownership of projects.</li>\n</ul>\n<p>Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build.</p>\n<p>Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice to know more about how we collect, use and transfer the personal data of our candidates.</p>\n",
      "how_to_apply": "<p><a href=\"https://ad.doubleclick.net/ddm/clk/436616238;288615889;d?https://www.amazon.jobs/en-gb/jobs/1301778/software-development-engineer-amazon-redshift-spectrum?cmpid=JBOTAW6344B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid\">https://ad.doubleclick.net/ddm/clk/436616238;288615889;d?https://www.amazon.jobs/en-gb/jobs/1301778/software-development-engineer-amazon-redshift-spectrum?cmpid=JBOTAW6344B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1NTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f9c00b96c89446d6f59713f496d9455eb310a29a/aws.jpg"
    },
    {
      "id": "acae0e98-7cbd-43d5-891a-3ada33637f76",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/acae0e98-7cbd-43d5-891a-3ada33637f76",
      "created_at": "Thu Dec 03 15:00:38 UTC 2020",
      "company": "Amazon Web Services AWS",
      "company_url": "https://aws.amazon.com/de/",
      "location": "Berlin",
      "title": "Software Development Engineer - Amazon Redshift SQL Compiler",
      "description": "<p>We are searching for Software Development Engineers with passion for building easy to use large-scale enterprise cloud software optimized for massive query execution. If you are motivated by the fact that your code helps thousands of the world biggest companies to run millions of SQL queries smoothly and with high performance through our distributed cloud system – this role is for you!</p>\n<p>Our cloud data warehouse Amazon Redshift manages all the work needed to set up, operate, and scale a data warehouse, from provisioning capacity and installing software to monitoring and backing up the cluster, to applying patches and upgrades. With Redshift Spectrum, our customers can easily query data from Amazon S3, thereby scaling their warehouse out to Exabytes and allowing them to integrate data in all kinds of file formats from their data lake into their analytics.</p>\n<p>As Software Development Engineer at Amazon Redshift SQL Compiler, you will:</p>\n<ul>\n<li>Participate in the design and development of state-of-the-art SQL compiler engines</li>\n<li>Define query rewrite rules and optimize query execution time in distributed database</li>\n<li>Participate in code and design reviews to maintain our high development standards.</li>\n<li>Operate a large-scale, distributed service in the cloud.</li>\n</ul>\n<p>Joining the Amazon Redshift SQL Compiler team gives you the opportunity to:</p>\n<ul>\n<li>Work on the latest technology, as we constantly build the latest research concepts into Redshift Spectrum.</li>\n<li>Be part of something big, as you are working on a key pillar of AWSs extensive service portfolio and thousands of Amazon Redshift customers benefit from your contributions.</li>\n<li>Learn from the best, as you are working on challenging engineering tasks in a team of very experienced experts that are close to support you.</li>\n<li>Be part of a great team, as we invest a lot to create an inclusive environment that allows you to perform at your best, while maintaining a fun atmosphere.</li>\n</ul>\n<p>BASIC QUALIFICATIONS</p>\n<ul>\n<li>3 or more years experience in professional software development</li>\n<li>Experience in designing, implementing, executing and analyzing complex software system</li>\n<li>Bachelors or Master’s in Computer Science or Engineering, or equivalent experience</li>\n<li>Good working knowledge of relational databases, algebra, and SQL</li>\n<li>Ability to write high-quality code that is robust and easy to maintain.</li>\n<li>Ability to work in a fast paced and agile development environment.</li>\n<li>Experience debugging, diagnosing, and trouble-shooting software.</li>\n<li>Good communication skills, analytical abilities, and design skills.</li>\n</ul>\n<p>PREFERRED QUALIFICATIONS</p>\n<ul>\n<li>Masters or PhD in Computer Science</li>\n<li>Experience in working on SQL compiler and code compilation engines</li>\n<li>Experience with database internals especially SQL optimization, query execution, and automation</li>\n<li>Experience with parser, normalization, and cache management in database systems</li>\n<li>Experience in working on distributed database systems</li>\n<li>Good understanding of parallel computing, system efficiency and scalability.</li>\n<li>Experience in characterizing, debugging and correcting configuration issues in large scale distributed systems</li>\n</ul>\n<p>Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build.</p>\n<p>Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice to know more about how we collect, use and transfer the personal data of our candidates.</p>\n",
      "how_to_apply": "<p><a href=\"https://ad.doubleclick.net/ddm/clk/436616238;288615892;x?https://www.amazon.jobs/en/jobs/1065263/software-development-engineer-amazon-redshift-sql-compiler?cmpid=JBOTAW6343B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid\">https://ad.doubleclick.net/ddm/clk/436616238;288615892;x?https://www.amazon.jobs/en/jobs/1065263/software-development-engineer-amazon-redshift-sql-compiler?cmpid=JBOTAW6343B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0tTIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5fec6365afe7e794da53ba549a8bc56b68cb1fb0/aws.jpg"
    },
    {
      "id": "2dd205cd-99cd-4d7d-9993-71b848758c01",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/2dd205cd-99cd-4d7d-9993-71b848758c01",
      "created_at": "Thu Dec 03 14:52:42 UTC 2020",
      "company": "Amazon Web Services AWS",
      "company_url": "https://aws.amazon.com/de/",
      "location": "Berlin",
      "title": "Software Development Engineer – Backend – AWS Console Platform",
      "description": "<p>The AWS Console Platform team looks for an experienced engineer, who is passionate about web technologies and building services.</p>\n<p>We are the team that runs the platform which serves the user interfaces for all of AWS.\nOur mission is to make it as easy as possible for product teams in AWS to serve and deploy their UIs. Our team supported 1.957 service or feature launches in 2018. To allow AWS services to deliver, we dive deep on automation and web technologies.</p>\n<p>Your responsibilities will include:</p>\n<ul>\n<li>Innovate and simplify the process of creating user interfaces for all Amazon Web Services.</li>\n<li>Design, implement, and operate new web services on serverless technology.</li>\n<li>Solve problems that span multiple layers of the application.</li>\n<li>Closely collaborate with engineering teams around the globe.</li>\n<li>Automate all the things.</li>\n<li>Research web technology trends.</li>\n<li>Help the team grow professionally.</li>\n</ul>\n<p>As an engineer on our team, you'll have the freedom to set the future direction of this platform.</p>\n<p>We'd love to see how your solutions will help both AWS customers and AWS service teams build user interfaces even more efficiently.</p>\n<p>If you have a passion for how web applications should be built, care about making other developers’ lives better and want to work with excellent engineers to solve interesting technology problems, you'll fit right in.</p>\n<p>Our team is located in the heart of Berlin, Germany.</p>\n<p>BASIC QUALIFICATIONS</p>\n<ul>\n<li>Ability to work in a diverse team</li>\n<li>4+ years' experience as a software developer</li>\n<li>Proficiency in at least one programming language, e.g. JavaScript, Java, Python, or Ruby</li>\n<li>Willingness to relocate to Berlin, Germany</li>\n</ul>\n<p>PREFERRED QUALIFICATIONS</p>\n<ul>\n<li>Bachelor’s Degree or higher in Computer Science or a similar degree</li>\n<li>Experience developing customer-facing web services or applications</li>\n<li>Experience operating a service</li>\n<li>Experience communicating technical concepts to a non-technical audience</li>\n<li>Experience working on large projects</li>\n<li>Interest in web browsers and frontend development</li>\n</ul>\n<p>Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success and we make recruiting decisions based on your experience and skills. We welcome applications from all members of society irrespective of age, gender, disability, sexual orientation, race, religion or belief.</p>\n",
      "how_to_apply": "<p><a href=\"https://ad.doubleclick.net/ddm/clk/436616238;288615898;d?https://www.amazon.jobs/en/jobs/990699/software-development-engineer-backend-aws-console-platform?cmpid=JBOTAW6342B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid\">https://ad.doubleclick.net/ddm/clk/436616238;288615898;d?https://www.amazon.jobs/en/jobs/990699/software-development-engineer-backend-aws-console-platform?cmpid=JBOTAW6342B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjZSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b3b21032fb0cf4882a83d245721adc6938c237c9/aws.jpg"
    },
    {
      "id": "6a1b8822-cf30-478f-887a-a989fff53b31",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/6a1b8822-cf30-478f-887a-a989fff53b31",
      "created_at": "Thu Dec 03 14:46:39 UTC 2020",
      "company": "Amazon Web Services AWS",
      "company_url": "https://aws.amazon.com/de/",
      "location": "Dresden",
      "title": "Software Development Engineer",
      "description": "<p>At the Amazon Development Center in Dresden, Germany, we build the foundation of the Amazon EC2 virtualization platforms. Our teams are responsible for the development and maintenance of the Amazon hypervisors and Linux Kernels that make the engine of the EC2 compute servers. The Dresden based teams also own the development and support of the Linux operating system kernel running on almost every Amazon Server worldwide. Being part of Amazon means constantly driving innovation and working on complex technical challenges every day.</p>\n<p>What is Amazon EC2? <a href=\"https://aws.amazon.com/ec2/\">https://aws.amazon.com/ec2/</a></p>\n<p>Check out this video to see what the office looks like and how beautiful the Dresden area is: <a href=\"https://youtu.be/NyJQL6keFBA\">https://youtu.be/NyJQL6keFBA</a></p>\n<p>If you are passionate about developing software, and you want to build solutions to challenging problems that directly reach millions of people, there may be no better place than Amazon for you to impact the world!</p>\n<p>The Position</p>\n<p>We are looking for a Software Development Engineer to work on the lowest layer of Amazon EC2 software stack, touching the Linux kernel and our Hypervisors, developing salient features such as Live Migration.</p>\n<ul>\n<li>You will develop new features, performance optimizations, and reliability improvements for Amazon EC2.</li>\n<li>You will maintain and build the infrastructure that monitors and tests key EC2 features.</li>\n<li>You will monitor live operation metrics to ensure that we are delivering the best experience to our customers at any time.</li>\n</ul>\n<p>BASIC QUALIFICATIONS</p>\n<ul>\n<li>BS in Computer Science or related discipline, or equivalent work experience</li>\n<li>Strong programming skills in C, C++</li>\n<li>Experience in low level software development.</li>\n<li>Strong desire to build, a sense of ownership, urgency, and drive</li>\n<li>Knowing German language is not required for this position.</li>\n</ul>\n<p>PREFERRED QUALIFICATIONS</p>\n<ul>\n<li>Experience working on the Linux Kernel</li>\n<li>Experience in virtualization (Xen, KVM) technologies</li>\n<li>Experience developing CI and testing automation systems</li>\n<li>Programming skills in Python</li>\n</ul>\n<p>“Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (<a href=\"https://www.amazon.jobs/en/privacy/eu\">https://www.amazon.jobs/en/privacy/eu</a> ) to know more about how we collect, use and transfer the personal data of our candidates.”</p>\n",
      "how_to_apply": "<p><a href=\"https://ad.doubleclick.net/ddm/clk/436616238;288615904;r?https://www.amazon.jobs/en/jobs/823342/software-development-engineer?cmpid=JBOTAW6341B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid\">https://ad.doubleclick.net/ddm/clk/436616238;288615904;r?https://www.amazon.jobs/en/jobs/823342/software-development-engineer?cmpid=JBOTAW6341B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnlSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6b3bb4bef0cc2ed9db2ee29027cf3dab9eb63f1b/aws.jpg"
    },
    {
      "id": "33f85014-0510-47d6-9fe6-7e8134a246b2",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/33f85014-0510-47d6-9fe6-7e8134a246b2",
      "created_at": "Thu Dec 03 14:43:09 UTC 2020",
      "company": "Amazon Web Services AWS",
      "company_url": "https://aws.amazon.com/de/",
      "location": "Berlin",
      "title": "Software Development Engineer - AWS Identity",
      "description": "<p>Amazon Web Services (AWS) is the world leader in providing a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of businesses across 190 countries!</p>\n<p>Our team is part of AWS Identity, Resource Management, owns the AWS Resource Groups service and is actively developing new products and services for Amazon Web Services.</p>\n<p>The ideal candidate is passionate about software development and has a track record of collaboratively designing, implementing, and launching new products or features. The ability to mentor others and build software within a positive team environment are key to the role.</p>\n<p>Come join a team of bright, passionate, and customer obsessed developers. We'd love to talk to you!</p>\n<p>BASIC QUALIFICATIONS</p>\n<ul>\n<li>A Bachelor’s degree in Computer Science or equivalent combination of technical education and work experience</li>\n<li>4+ years of software development experience</li>\n<li>Experience building software systems that have been successfully delivered to customers</li>\n<li>Self-directed and capable of working effectively in a fast-paced environment</li>\n<li>Strong Communication skills</li>\n<li>Willing to relocate to Berlin, Germany</li>\n</ul>\n<p>PREFERRED QUALIFICATIONS</p>\n<ul>\n<li>Bachelor’s Degree or higher in Computer Science or a similar degree</li>\n<li>Experience owning mission critical, 24x7 systems.</li>\n<li>Ability to take a project from scoping requirements through actual launch of the project.</li>\n<li>Strong understanding of either Kotlin, Java, Go or a comparable programming language</li>\n<li>Experience with NoSQL databases</li>\n<li>Start-up experience</li>\n<li>Interest in or experience developing production web services or Service Oriented Architectures</li>\n<li>Able to work in a diverse team</li>\n</ul>\n<p>Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (<a href=\"https://www.amazon.jobs/en/privacy/eu\">https://www.amazon.jobs/en/privacy/eu</a>) to know more about how we collect, use and transfer the personal data of our candidates.</p>\n<p>We believe passionately that employing a diverse workforce is central to our success and we make recruiting decisions based on your experience and skills. We welcome applications from all members of society irrespective of age, gender, disability, sexual orientation, race, religion or belief.</p>\n",
      "how_to_apply": "<p><a href=\"https://ad.doubleclick.net/ddm/clk/436616238;288615910;o?https://www.amazon.jobs/en/jobs/1256618/software-development-engineer-aws-identity?cmpid=JBOTAW6340B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid\">https://ad.doubleclick.net/ddm/clk/436616238;288615910;o?https://www.amazon.jobs/en/jobs/1256618/software-development-engineer-aws-identity?cmpid=JBOTAW6340B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnFSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--99c8a29746516b5f1c668f3049a1d3f8433357de/aws.jpg"
    },
    {
      "id": "24a037f5-0fc6-45f2-8288-90ee484d741c",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/24a037f5-0fc6-45f2-8288-90ee484d741c",
      "created_at": "Thu Dec 03 14:37:02 UTC 2020",
      "company": "Amazon Web Services AWS",
      "company_url": "https://aws.amazon.com/de/",
      "location": "Aachen",
      "title": "Sr. Software Development Engineer - AWS",
      "description": "<p>Join us to create a new team for a new AWS service!\nWe bring the power of Machine Learning (ML) to new application fields. With products such as Amazon Transcribe, Amazon Rekognition and Amazon Sagemaker, we are setting the standard for high-performance, easy-to-use and cost-effective ML services. Our team expands this portfolio to new applications and industries.</p>\n<p>As a Senior Software Development Engineer, you will play a key role in building a new team and leading it into uncharted territory. The team will be responsible for designing, developing, testing, and deploying distributed machine learning systems and large-scale solutions for our world-wide customer base. You will collaborate closely with a team of ML scientists to influence our overall strategy and define the team’s road map. You will also drive the system architecture, spearhead best practices that enable a quality product, and help coach and develop junior engineers. A successful candidate will have an established background in engineering distributed software systems, a strong technical ability, great communication skills, and a motivation to achieve results in a fast paced environment.</p>\n<p>BASIC QUALIFICATIONS</p>\n<ul>\n<li>Bachelor of Science (BS) in Computer Science, Electrical Engineering or similar</li>\n<li>10+ years of industry experience with at least some experience as team lead or architect</li>\n<li>Extensive experience in distributed systems</li>\n<li>Strong programming skills in at least one object-oriented language (such as C++, C#, Java, etc.)</li>\n<li>Mastery of the tools of the trade (e.g. experience with Linux, software development environments (SDEs), modern programming languages and open-source technologies)</li>\n<li>Experience in design for scalability, performance and reliability</li>\n<li>Sharp analytical abilities and proven design skills</li>\n<li>Strong sense of ownership, customer obsession, and drive to make systems work end-to-end</li>\n</ul>\n<p>PREFERRED QUALIFICATIONS</p>\n<ul>\n<li>Advanced degree such as Master of Science (MS), or PhD</li>\n<li>Experience in Internet of Things (IoT) system development, including IoT frameworks, embedded software, cloud development, web development, communication protocols, embedded Linux</li>\n<li>Excellence in technical communication with peers and non-technical cohorts</li>\n<li>Demonstrated ability to achieve stretch goals in a highly innovative and fast paced environment</li>\n</ul>\n<p>Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We value your passion to discover, invent, simplify and build. Our salaries are\nnegotiable.</p>\n<p>Explore all AWS Germany Senior Software Engineering roles available, meet our team members and get prepared for your interviews via link: <a href=\"https://awsseniorsoftwaregermany.splashthat.com/\">https://awsseniorsoftwaregermany.splashthat.com/</a></p>\n",
      "how_to_apply": "<p><a href=\"https://ad.doubleclick.net/ddm/clk/436616238;288625354;r?https://www.amazon.jobs/en/jobs/1160827/sr-software-development-engineer-aws?cmpid=JBOTAW6339B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid\">https://ad.doubleclick.net/ddm/clk/436616238;288625354;r?https://www.amazon.jobs/en/jobs/1160827/sr-software-development-engineer-aws?cmpid=JBOTAW6339B&amp;utm_source=github.com&amp;utm_campaign=aws&amp;utm_medium=job_board&amp;utm_content=job_posting&amp;ss=paid</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmlSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b0cc2f575f05b42525f2b5655e8e3df6e93e4722/aws.jpg"
    },
    {
      "id": "beeb797b-1793-4de4-a72c-96cb638ce7f0",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/beeb797b-1793-4de4-a72c-96cb638ce7f0",
      "created_at": "Thu Dec 03 12:01:25 UTC 2020",
      "company": "Renewi",
      "company_url": "https://www.renewi.com/nl-nl",
      "location": "Eindhoven ",
      "title": "Salesforce Tester",
      "description": "<p>Heb jij passie voor het test vak en blijf je graag op de hoogte van de laatste technologische innovaties? Heb jij oog voor detail, ben je snel, accuraat, behulpzaam en leergierig? En wil je – last but not least – jouw kennis en kunde inzetten bij een bedrijf dat midden in de circulaire economie staat? Lees dan snel verder!</p>\n<p><strong>DevOps Tester Salesforce &amp; Customer facing platforms</strong>\n<strong>(fulltime en standplaats in overleg)</strong></p>\n<p>Jij bent die positieve enthousiaste DevOps tester die iedereen in zijn team wil hebben. Je staat stevig in je schoenen en kunt je standpunten daarom goed beargumenteren. Jij kunt adviseren welke tool te gebruiken, deze installeren en daarmee een test framework neerzetten. Je bent technisch sterk en daarnaast inhoudelijk van alles op de hoogte. Je coördineert en delegeert daar waar mogelijk ook (test)taken aan teamleden. Proactief pak je ook taken op buiten je eigen specialisme.</p>\n<h2>Jouw nieuwe uitdaging</h2>\n<p>Het Salesforce scrum team is gestart met de voorbereiding voor implementatie van CI/CD en streeft daarbij naar vergaande test automation. Hiervoor zijn we op zoek naar ervaren (Salesforce) tester die de lead kan nemen in het opzetten en inrichten van een teststrategie en de automation daarvan. Daarnaast ondersteun je in deze rol het customer engagement team met het opzetten van en uitvoering geven aan professioneel testmanagement voor de mijn-omgeving van klanten, waar de front-end middels middleware connecteert met diverse backend systemen.</p>\n<p>Als lid van het team zorg je er samen met je teamleden voor dat iedere sprint kwalitatief goede functionaliteiten worden opgeleverd. Met een specialisme in software testen, besteed jij vooral tijd aan het testen van de nieuw ontwikkelde functionaliteit. Je bent betrokken bij het opstellen van acceptatiecriteria, testplannen, het bepalen van de teststrategie en het realiseren van de functionele testscripts en de daadwerkelijke uitvoer. Daarbij streef je naar een vergaande automatisatie van de testen.</p>\n<p>Je krijgt hierbij de ruimte om met je eigen ideeën aan de slag te gaan. Je maakt risico (in)schattingen en werkt de documentatie bij, helpt bij implementaties en integraties.</p>\n<h2>Wat maakt jou de DevOps Tester die we zoeken?</h2>\n<ul>\n<li>Je beschikt over een HBO werk- en denkniveau en hebt 2 tot 5 jaar relevante werkervaring.</li>\n<li>Je bent communicatief sterk (zowel in Engels als Nederlands), toont initiatief en beschikt over een drive om continue te verbeteren.</li>\n<li>Je staat stevig in je schoenen en bent bekend met de dynamiek binnen een sterk veranderende organisatie en processen.</li>\n<li>Je bent analytisch, creatief en oplossingsgerichtVanzelfsprekend heb je ervaring met DevOps en Agile / Scrum.</li>\n<li>Je hebt ervaring met test methodieken, keten testen en regressie testen.</li>\n<li>Je kent het Salesforce platform van binnen en buiten en je bent op de hoogte van de nieuwe ontwikkelingen. Je hebt kennis en ervaring met meerdere testtools (bijv. Provar, RPA, Selenium, etc).</li>\n<li>Je bent bekend met CI/CD, Bitbucket, AzureDevOps.</li>\n<li>Je hebt voldoende kennis van de Nederlandse en Engelse taal</li>\n</ul>\n<h2>Jouw nieuwe team</h2>\n<p>Je gaat rapporteren aan de Head of CoE Customer Engagement en wordt onderdeel van het CoE Customer Engagement (in totaal 14 collega’s). Dit Center of Excellence ondersteunt de divisies in de ambitie om het klantcontact verder te digitaliseren door het onderhouden en verder uitbouwen van zowel het CRM pakket Salesforce als de digitale platformen (website, portals, apps). De CoE streeft naar continue verbetering en toepassing van best practices en is bezig met een transformatie naar meer agile en DevOps way of working.</p>\n<h2>Hoe maken wij jou blij?</h2>\n<ul>\n<li>Een uitdagende werkomgeving die volop in beweging en ontwikkeling is met veel ruimte om mee te denken over en invloed uit te oefenen op o.a. onze processen en verbeterprojecten.</li>\n<li>Je mag mee op onze Agile- en digitaliseringsreis en dus andere manier van werken.</li>\n<li>Gepassioneerde, betrokken en helpende collega’s van wie je veel kan leren.</li>\n<li>De nodige flexibiliteit in je werk, je locaties en werktijden.</li>\n<li>Een marktconform salaris met goede pensioenregeling, een laptop en mobiele telefoon.</li>\n</ul>\n<p><strong>Kun jij niet wachten om in deze uitdagende functie aan de slag te gaan?</strong></p>\n<p>Reageer dan uiterlijk 17 december a.s. via de <strong>\"solliciteer\"</strong> button. We kijken uit naar je sollicitatie!</p>\n<p>Wil je eerst meer informatie? Mail dan naar Christel Jongh, Senior Recruiter, via: <a href=\"mailto:Christel.Jongh@renewi.com\">Christel.Jongh@renewi.com</a></p>\n<p>Wij voeren de wervingsprocedure voor deze vacature in eigen beheer uit. Acquisitie naar aanleiding van deze vacature wordt dus niet op prijs gesteld en hierop wordt ook niet gereageerd.</p>\n<p><a href=\"https://vonq.io/3om3JHX\">Klik hier voor het sollicitatieformulier!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/3om3JHX\">Klik hier voor het sollicitatieformulier!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUNSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f572aa1a8d330404b0086453ac2ab57f59588e0b/renewi.jpeg"
    },
    {
      "id": "86fb6ad3-abc3-4ac7-aa02-54514d45c456",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/86fb6ad3-abc3-4ac7-aa02-54514d45c456",
      "created_at": "Thu Dec 03 12:47:38 UTC 2020",
      "company": "bene : studio",
      "company_url": "http://benestudio.co/join-us",
      "location": "Budapest",
      "title": "Senior React & Node Engineer (Remote / Relocation to European Union)",
      "description": "<p>Join bene : studio</p>\n<p>TO BUILD PRODUCTS</p>\n<ul>\n<li>which are diverse, from healthcare to real estate</li>\n<li>making better the lives of the people globally</li>\n<li>with the latest JavaScript technologies</li>\n<li>using your creativity, empowerment and team player attitude</li>\n</ul>\n<p>TO GAIN EXPERIENCE</p>\n<ul>\n<li>from the varied, 1-6 months long projects</li>\n<li>within the English-speaking, international, growing team of highly skilled engineers, who passed the famously challenging bene : studio assessment</li>\n<li>during the journey of your Professional Development Plan</li>\n<li>with the help of your dedicated Mentor</li>\n</ul>\n<p>TO SHARE YOUR KNOWLEDGE</p>\n<ul>\n<li>as a Mentor within the team</li>\n<li>at our blog or one of the leading meetups, conferences</li>\n<li>at bene : studio Workshops!, the popular cutting-edge tech workshops</li>\n</ul>\n<p>TO REFRESH YOURSELF</p>\n<ul>\n<li>by enjoying the flexible schedule</li>\n<li>relying on the stable, calculable job and salary</li>\n<li>in the team which won the Loveable Workplace Prize</li>\n<li>in your home or at the bike, dog and family friendly Office of the Year 2016, where you can have a -  massage, play ping-pong or drink a coffee/fröccs at the in-house café</li>\n</ul>\n<p>TO RELOCATE</p>\n<ul>\n<li>into the heart of Europe, to the beautiful, safe and cheap Budapest</li>\n<li>with the adaptation guidance, flight ticket, temporary housing and visa services provided by us</li>\n</ul>\n<p>TO RECEIVE FROM US</p>\n<ul>\n<li>a MacBook Pro</li>\n<li>competitive salary</li>\n<li>with the paid leaves and sick-leaves</li>\n<li>promotion reflecting the improvement of your skills, experiences and your contribution to the company</li>\n</ul>\n<p>IF YOU MET THE REQUIREMENTS OF</p>\n<ul>\n<li>5+ years experience in software engineering</li>\n<li>JavaScript ES6</li>\n<li>HTML5, CSS3</li>\n<li>React.js</li>\n<li>Redux</li>\n<li>Node.js</li>\n<li>SQL &amp; noSQL</li>\n<li>Algorithms, data structures</li>\n<li>AWS &amp;/or Azure</li>\n<li>Strong systems design skills</li>\n<li>Experienced in all phases of the software development lifecycle</li>\n<li>Being the tech lead of one or more projects at a time</li>\n<li>Deeper knowledge of a CI tool</li>\n</ul>\n<p>OR EVEN GET ADVANTAGES HAVING</p>\n<ul>\n<li>Mobile development experience</li>\n<li>Knowledge of infrastructure as code software tools</li>\n</ul>\n",
      "how_to_apply": "<p>Click here to apply:\n<a href=\"https://l.benestudio.co/React_Node_Engineer\">https://l.benestudio.co/React_Node_Engineer</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdW1SIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3da96d80ee1d1edd22b8e8a1cb4d4147802037ca/bene%20_%20studio.png"
    },
    {
      "id": "ea2899d5-c9ca-40cd-b5ca-4221714c03f7",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/ea2899d5-c9ca-40cd-b5ca-4221714c03f7",
      "created_at": "Thu Dec 03 10:31:15 UTC 2020",
      "company": "Usercentrics GmbH",
      "company_url": "https://usercentrics.com",
      "location": "Munch Germany ",
      "title": "UI Team Lead Software Engineer ( React or Angular ) (m / f / d)",
      "description": "<p>Usercentrics is a market leader in the area of enterprise consent management platforms (CMP) and empowers companies to obtain, manage and document the consent of their users across platforms. Usercentrics’ solution is easy-to-implement, fully customizable and legally compliant.</p>\n<p>We’re looking for an energetic and creative Team Lead Software Engineer (m/f/d) to join our team located in the centre of Munich! Revolutionising an entire industry is exciting, but not easy. That’s why we need you! Become a part of our international team and let our enthusiasm infect you as we build the leading consent software!</p>\n<p>#Your Responsibilities</p>\n<ul>\n<li>Leading a team that consists of supportive and passionate software engineers (local and remote)</li>\n<li>Orchestrating the design, development and delivery of our data service products.</li>\n<li>Collaborating with PM/Product Owner and other developers, guide through to planning and grooming sessions and drive team’s discussions on system architecture and component design</li>\n<li>Support and guide the team to ensure all committed stories for the sprint are completed per the sprint goal</li>\n<li>Reviewing other team members’ code and providing corrections and feedback in a professional, skill-building way</li>\n<li>Driving innovation and continuous improvement by empowering and enabling your team.</li>\n<li>Taking over the responsibility for performance management and career development of your team.</li>\n</ul>\n<p>#You Have</p>\n<ul>\n<li>5+ years of experience writing and deploying high-quality production code combined with object-oriented software design abilities.</li>\n<li>2+ years of experience in technical leadership and people management of at least 3-5 team members</li>\n<li>In-depth knowledge of React or Angular ( Typescript, Node.js is nice to have )</li>\n<li>Agile development experience and focus on UI</li>\n<li>Have a product-oriented mindset: you like offering technical solutions to business problems.</li>\n<li>Type S(tartup) personality: smart, ethical, friendly, hard-working and proactive.</li>\n<li>Hands on experience with GraphQL and/or MongoDB is a plus.</li>\n<li>Experience with GCP or another cloud provider (AWS, Azure, …) is a plus.</li>\n</ul>\n<p>#Your Perks</p>\n<ul>\n<li>A fantastic team, flat hierarchies &amp; lots of freedom to be creative</li>\n<li>Flexible working hours incl. the option for home office</li>\n<li>Great events with a fun and enthusiastic team and trainers, massages, meditation</li>\n<li>Subsidised gym memberships and a weekly lunch by our personal happiness manager</li>\n<li>Central in one of Munich's top locations incl. a great office</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://usercentrics-gmbh-jobs.personio.de//job/266497?language=#apply\">https://usercentrics-gmbh-jobs.personio.de//job/266497?language=#apply</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFdSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ac1fa08bb00c891526152a73d676bf115d00b762/190208-UCS-Logo-800px.png"
    },
    {
      "id": "9e6f0ccf-69dc-4a58-8b75-ecb4a81eed25",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9e6f0ccf-69dc-4a58-8b75-ecb4a81eed25",
      "created_at": "Thu Dec 03 09:46:02 UTC 2020",
      "company": "Pinpoint",
      "company_url": "https://vonq.io/33CKMIX",
      "location": "St. Helier, Jersey",
      "title": "Senior Software Developer (Rails & React)",
      "description": "<h2>We are accepting remote applicants located within 2 hours of the UK timezone for this role.</h2>\n<p>Technology is the core of our business and we're looking for developers who share our passion for tackling complexity and building software that is simple, beautiful and scalable.</p>\n<h2>Key Responsibilities</h2>\n<p>Working as part of a small dynamic team of developers, your responsibilities will be varied.</p>\n<h2>You will:</h2>\n<ul>\n<li>Turn product requirements into functional features.</li>\n<li>Contribute to all parts of the software development process from architectural design and task planning all the way through to implementation, testing, and documentation.</li>\n<li>Help ensure that all code written conforms to our coding standards and best practices.</li>\n<li>Suggest improvements to our technology stack, coding standards, and processes.</li>\n<li>Review code submitted by other developers, offering feedback and improvements.</li>\n</ul>\n<h2>Skills, Knowledge &amp; Expertise</h2>\n<p>Every member of our development team is expected to be able to work on any part of our technology stack, so we're looking for candidates who are skilled in all aspects of the development lifecycle.</p>\n<p>Our technology stack is almost exclusively Ruby on Rails / React. Whilst knowledge of these isn't required, you'll need to be able to up-skill in them quickly.</p>\n<h2>You must:</h2>\n<ul>\n<li>Have a robust understanding of HTML, SCSS, and version control such as Git.</li>\n<li>Have a solid understanding of an MVC framework (e.g. Ruby on Rails).</li>\n<li>Have a solid understanding of a Javascript framework (e.g. React, Vue, Angular).</li>\n<li>Have at least three years' worth of experience working as a developer full time.</li>\n</ul>\n<h2>You will ideally:</h2>\n<ul>\n<li>Have knowledge of Typescript.</li>\n</ul>\n<h2>We're looking for like minded individuals who:</h2>\n<ul>\n<li>Keep abreast of the latest technologies and developments in the industry.</li>\n<li>Enjoy problem solving.</li>\n<li>Have a keen attention to detail and take pride in their work.</li>\n</ul>\n<p>We care deeply about code quality, use continuous integration and deploy to production multiple times per day. Our technology stack can be viewed at: <a href=\"https://stackshare.io/Japestrale/pinpoint\">https://stackshare.io/Japestrale/pinpoint</a></p>\n<h2>Benefits</h2>\n<p>We care deeply about making Pinpoint an incredible place to work and as such invest a significant amount of time and energy into creating and maintaining a company culture that provides our team with a generous level of support whilst inspiring them to do their best work.</p>\n<h2>Some of our benefits are:</h2>\n<ul>\n<li>Full healthcare coverage for you and your family.</li>\n<li>Generous personal development budget. Want to buy books or go on courses? We'll help facilitate that.</li>\n<li>Top of the line equipment: each developer is provided with a 27\" iMac and two 27\" 4k monitors.</li>\n<li>Flexible working hours. Need to leave in the middle of the day to pick your kids up? No problem. We prioritise output over being in the office at set hours.</li>\n<li>Competitive salary with regular pay reviews.</li>\n<li>Generous option grants.</li>\n</ul>\n<h2>You'll enjoy working here if you:</h2>\n<ul>\n<li>Like being challenged.</li>\n<li>Are the sort of person who enjoys being able to get on with things with minimal management oversight.</li>\n<li>Are keen to work with talented developers and improve your own skillset.</li>\n<li>Are a fan of sending gifs to colleagues.</li>\n</ul>\n<p><a href=\"https://vonq.io/33CKMIX\">Click here for the application form!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/33CKMIX\">Click here for the application form!</a></p>\n",
      "company_logo": null
    },
    {
      "id": "23142439-c599-420c-a456-2af883055b77",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/23142439-c599-420c-a456-2af883055b77",
      "created_at": "Thu Dec 03 09:16:05 UTC 2020",
      "company": "Usercentrics GmbH",
      "company_url": "http:",
      "location": "Munich Germany",
      "title": "Senior Software Engineer ( React ) (m / f / d)",
      "description": "<p>Usercentrics is a growing software company headquartered in Munich. We are a team of diverse expert professionals united by the passion for privacy and the drive to build something big. We embrace change and value agility.</p>\n<p>We’re looking for an energetic and creative Senior Software Engineer (m/f/d) to join our team located in the centre of Munich! Revolutionising an entire industry is exciting, but not easy. That’s why we need you! Become a part of our international team and let our enthusiasm infect you as we build the leading consent software!</p>\n<p>#Your Responsibilities</p>\n<ul>\n<li>Designing and building core services and interfaces that support our products‚</li>\n<li>Collaborating with PM/Product Owner and other developers, contribute to planning and grooming sessions and drive team’s discussions on system architecture and component design</li>\n<li>Working on a  team that consists of supportive and passionate software engineers</li>\n<li>Support the team to ensure all committed stories for the sprint are completed per the sprint goal</li>\n<li>Reviewing other team members’ code and providing corrections and feedback in a professional, skill-building way</li>\n<li>Helping to build high-performing teams, improve and mentor the technical skills within your team and create development opportunities for them</li>\n</ul>\n<p>#You Have</p>\n<ul>\n<li>4+ years of experience writing and deploying high-quality production code to deliver business value.</li>\n<li>Have a passion and track record for designing and building scalable services and interfaces.‚</li>\n<li>In-depth knowledge of React ( Typescript, Node.js is nice to have )</li>\n<li>The ability to accomplish multiple sophisticated software development tasks with minimal direction.</li>\n<li>Agile development experience.</li>\n<li>Experience mentoring other team members</li>\n<li>Have a product-oriented mindset: you like offering technical solutions to business problems.</li>\n<li>Type S(tartup) personality: smart, ethical, friendly, hard-working and proactive.</li>\n<li>Hands on experience with GraphQL and/or MongoDB is a plus.</li>\n<li>Experience with GCP or another cloud provider (AWS, Azure, …) is a plus.</li>\n</ul>\n<p>#Your Perks</p>\n<ul>\n<li>A fantastic team, flat hierarchies &amp; lots of freedom to be creative</li>\n<li>Flexible working hours incl. the option for home office</li>\n<li>Great events with a fun and enthusiastic team and trainers, massages, meditation</li>\n<li>Subsidised gym memberships and a weekly lunch by our personal happiness manager</li>\n<li>Central in one of Munich's top locations incl. a great office</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://usercentrics-gmbh-jobs.personio.de//job/266412?language=#apply\">https://usercentrics-gmbh-jobs.personio.de//job/266412?language=#apply</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdE9SIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0fa2362cde03a0c87f728fb9cf34031c952b8639/190208-UCS-Logo-800px.png"
    },
    {
      "id": "0bbcbdda-acf3-490a-9903-f3b711d0b8d8",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/0bbcbdda-acf3-490a-9903-f3b711d0b8d8",
      "created_at": "Wed Dec 02 21:21:10 UTC 2020",
      "company": "Canon Medical Research USA, Inc.",
      "company_url": null,
      "location": "Vernon Hills, IL (Chicago)",
      "title": "Senior/Principal Embedded Software Engineer (CT)",
      "description": "<p>COMPANY DESCRIPTION\nCanon Medical Research USA, Inc. (CMRU) is a multi-modality R&amp;D organization creating next-generation medical imaging systems. It is equipped with cutting-edge instrumentation, prototyping, hardware labs and scientific computing facilities in order to perform research targeted to pre-clinical and clinical CT, PET, MRI, and X-ray systems. For those who like to develop new technologies and research new ways of using them, Canon is a rewarding place to work, due to its focus on innovation as the lifeblood of new products.</p>\n<p>CMRU is committed to recognizing and appreciating the variety of characteristics that make individuals unique in an atmosphere that promotes work/life balance and celebrates individual and collective achievement. We are especially interested in qualified candidates who can contribute, through their experience, education, research and/or service, to the diversity and excellence of our organization and the scientific and engineering community at large.</p>\n<p>CMRU offers a great work environment, professional development, challenging careers, and competitive compensation and benefits. We are an equal opportunity employer (EOE).</p>\n<p>SUMMARY OF POSITION\nCMRU has two immediate openings for an Embedded Software Engineer in our CT business unit located in Vernon Hills, Illinois, a northern suburb of Chicago.</p>\n<p>The Embedded Software Engineer will work with a team to design and implement high-quality embedded software for large medical devices from requirements to production. The engineer is expected to participate in the designing of solutions that meet customer needs, document the design, write clear, concise code, comment code as appropriate, and create documentation outlining code functionality.</p>\n<p>RESPONSIBILITIES</p>\n<ul>\n<li>Analyze software requirements documentation and consult with the author as needed.</li>\n<li>Formulate a software design using industry best practices and document it appropriately.</li>\n<li>Implement the software design by coding.</li>\n<li>Design and execute the unit test plan to verify the coded software.</li>\n<li>Coordinate communication with vendors related to project materials.</li>\n<li>Contribute in the creation of software requirements and specifications.</li>\n<li>Contribute to the corporate IP portfolio.</li>\n</ul>\n<p>QUALIFICATIONS</p>\n<p>Education</p>\n<ul>\n<li>B.S or M.S. in computer science, electrical engineering, and a minimum of 3+ years C/C++ related experience.</li>\n</ul>\n<p>Experience</p>\n<ul>\n<li>Understanding of computer architecture principles.</li>\n<li>Proven experience in embedded systems design with preemptive, multitasking real-time operating systems.</li>\n<li>Familiarity with software configuration management tools, defect tracking tools, and peer review.</li>\n<li>Knowledge or experience in GPU programming experience helpful.</li>\n<li>Education and/or experience with image processing techniques.</li>\n<li>Experience with programming for Real-Time Operating Systems (RTOS).</li>\n<li>Experience designing software for multi-threaded and/or multi-processing environments, including parallel processing.</li>\n<li>Experience in mathematics and scientific algorithm implementation and optimization.</li>\n</ul>\n<p>Key Requirements for Principal Embedded Software Engineer (CT)</p>\n<ul>\n<li>10+ years of industry C/C++ development experience with a strong understand of software architecture</li>\n<li>Technical/project lead and other leadership experience desired</li>\n</ul>\n<p>Key Competencies</p>\n<ul>\n<li>Excellent analytical problem-solving skills</li>\n<li>Initiative</li>\n<li>Solution orientation</li>\n<li>Relationship building</li>\n<li>Communication—verbal, written and listening</li>\n<li>Time and task management</li>\n</ul>\n<p>Travel</p>\n<ul>\n<li>Ability to complete domestic and occasional international travel (up to 2% of time)</li>\n</ul>\n",
      "how_to_apply": "<p>To apply, go to <a href=\"http://www.research.us.medical.canon\">www.research.us.medical.canon</a>.</p>\n",
      "company_logo": null
    },
    {
      "id": "dfa9f75c-7be5-449c-a152-c3eabf915223",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/dfa9f75c-7be5-449c-a152-c3eabf915223",
      "created_at": "Wed Dec 02 20:39:31 UTC 2020",
      "company": "Frontline Wildfire",
      "company_url": "https://www.frontlinewildfire.com/",
      "location": "Remote (US Pacific TZ)",
      "title": "Senior Software Engineer",
      "description": "<p>Our mission is to protect homes, families and communities from wildfire disaster, which we've been doing successfully now for two years.</p>\n<p>The problem that we’re solving is protecting homes and helping people safely navigate a wildfire situation. To protect homes, our system defends against embers, the #1 cause of structure loss from wildfires. To help people navigate a wildfire situation, we’re providing better mapping and alert resources so that our customers can track wildfire activity near them and receive important emergency notifications from the best resources available.</p>\n<p>You'd be just the second full time software engineer, so this is a great opportunity to have a significant impact on a very interesting and meaningful product.</p>\n<p>You're an experienced generalist with a deep T in web and Elixir.  You take ownership, know how to balance your work and personal life, are comfortable moving fast, pushing boundaries, and breaking things.  You're a straight talker who tells it like it is, and finds no shame in being wrong.  You work well in a team, supporting people when they need it, and getting out of their way when they don't.</p>\n<h3>Skills</h3>\n<ul>\n<li>Expert in Elixir and Phoenix, with strong experience in websockets and API development</li>\n<li>Expert in the web stack: HTML, CSS &amp; JS</li>\n<li>Expert in SQL DBs, especially Postgres</li>\n<li>Familiar and comfortable with GIS and spatial queries in PostGIS</li>\n<li>Experience with MQTT, VerneMQ or IoT in general is a bonus</li>\n<li>Any C (Linux), Python or mobile dev also a bonus</li>\n</ul>\n<p>The role is mostly dev, but there'll be occasional ops and support until we grow enough to have a dedicated ops team.  You need to be ok being one of two engineers sharing these duties.  With team members in Colorado, Wyoming and California, we've always been a fully remote and distributed team.  We tend to operate on Pacific time, but software dev will generally be asynchronous.</p>\n<p>Pay is negotiable based on experience, but we're looking to fill the role in the $120-150k range.  We have an unlimited vacation policy, assistance is available for setting up a home office if necessary, and we have a generous equity plan for all employees.</p>\n<p>In your application, please include a sample of code that you're proud of and explain why you're proud of it.</p>\n",
      "how_to_apply": "<p>Email resume, cover letter, and code sample to <a href=\"mailto:jking@frontlinewildfire.com\">jking@frontlinewildfire.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdENSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--84cdcb4f34539915ea012c12d1320d4afeb50934/Screen%20Shot%202020-12-01%20at%2014.13.21.png"
    },
    {
      "id": "1d837bd6-9265-4a88-bc9d-9cbc07908857",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/1d837bd6-9265-4a88-bc9d-9cbc07908857",
      "created_at": "Wed Dec 02 19:20:33 UTC 2020",
      "company": "Linqto, Inc.",
      "company_url": "https://linqto.com",
      "location": "Remote in U.S.",
      "title": "Senior Software Engineer",
      "description": "<p><strong>Job Overview</strong></p>\n<p>We are looking for an experienced Senior Software Engineer to join our growing engineering team. The ideal candidate has strong back-end development expertise in web services, REST APIs, and databases. They will be experienced in designing, deploying, and administering the platform hosted in AWS cloud. They must be at ease working in an agile environment with little supervision, have experience working remotely on a full-time basis to achieve aggressive deliverables with high levels of quality.</p>\n<p>This opportunity includes a competitive salary and benefits package.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Working from Agile Stories, assist the Product Owner, front-end developers, and quality engineers to understand and document all necessary story requirements.</li>\n<li>Design and develop back-end functionality in a Java Spring environment using test-driven methodologies.</li>\n<li>Maintain, support and enhance existing systems and platforms.</li>\n<li>Lead the AWS cloud-based systems administration of the Linqto platform, to include HADR, configuring multi-zone redundancies, elastic clusters, load balancers, implement security, self healing, alarms, etc.</li>\n<li>Actively continue to develop and refine your skills, by adopting and implementing best practices in an environment of continuous improvement.</li>\n<li>Perform regular performance profiling, and security audits, and optimize as appropriate.</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>Minimum 5 years experience working with Java and the Spring framework, SQL databases, persistence mechanisms like Spring Data, JPA, Hibernate, or equivalent, creating web services with REST APIs on back-end systems.</li>\n<li>Minimum 2 years experience working with Amazon Web Services (AWS) to design, deploy and maintain complex, highly scalable topologies.</li>\n<li>Bachelor’s Degree in computer science or equivalent work experience.</li>\n<li>Experience with test-driven development and the JUnit framework.</li>\n<li>Experience with SCRUM/Agile development methodologies.</li>\n<li>Strong experience with Linux and MacOS, and shell scripting.</li>\n<li>Experience working remotely, having developed strong work habits and techniques of self-motivation in order to deliver on multiple competing priorities with little supervision.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Experience with build automation and source code control technologies like Maven, Git, etc.</li>\n<li>DevOps experience administering TeamCity or Jenkins a plus.</li>\n<li>Experience developing financial applications a plus.</li>\n</ul>\n<p><strong>About Linqto</strong></p>\n<p><a href=\"https://linqto.com\">Linqto</a> is a privately held U.S. company that makes it simple to access global private securities markets. By accessing its efficient technology-enabled investment platform, accredited investors can identify, evaluate, invest in and trade securities in the world's leading private companies. Linqto also provides founders, venture capital investors, and employees liquidity without having to wait for an IPO, acquisition, or other liquidity event. Linqto makes investing in private markets as simple as investing in public markets.</p>\n",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:erik@linqto.com\">erik@linqto.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczJSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cf2750ab49fd72805a34e1a71f9a277ae3bceb95/logo.png"
    },
    {
      "id": "04c55caa-3e46-42ae-94e9-05163eb5dd3e",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/04c55caa-3e46-42ae-94e9-05163eb5dd3e",
      "created_at": "Wed Dec 02 16:56:06 UTC 2020",
      "company": "LogicFlow AG",
      "company_url": "https://www.logicflow.ai/",
      "location": "Zurich",
      "title": "LogicFlow AG",
      "description": "<p>Möchtest du die Automatisierung in der Softwareindustrie definieren? Dann könnte LogicFlow der richtige Arbeitgeber für dich sein! Wir haben eine einzigartige Technologie auf Basis von Machine Learning entwickelt, die es uns ermöglicht, Code-Übersetzungsaufgaben zu automatisieren. Wir sind bestrebt, die Übersetzung der menschlichen Sprache in Code voranzutreiben, damit jeder sofort Software erstellen kann. Unsere Technologie macht uns zu einem führenden Unternehmen für Softwaremigration.</p>\n<p><strong>Aufgaben</strong></p>\n<p>Als (Full-Stack) Angular Engineer arbeitest du eng mit einem talentierten Entwicklerteam zusammen, um Migrationsprojekte von AngularJS zu Angular durchzuführen, unser Tool zur automatisierten Codeübersetzung zu verbessern, an Kundenprojekten teilzunehmen und an der Entwicklung neuer Komponenten in TypeScript/Angular zu arbeiten.</p>\n<p><strong>Qualifikation</strong></p>\n<ul>\n<li>Umfangreiche Erfahrung in Angular2+</li>\n<li>Umfangreiche Erfahrung in HTML/CSS, Typescript/Javascript</li>\n<li>Erfahrung mit Kundenprojekten</li>\n<li>Version Control in Git</li>\n<li>DevOps</li>\n<li>Fliessend Englisch und Deutsch</li>\n</ul>\n<p><em>Bonuspunkte:</em></p>\n<ul>\n<li>AngularJS</li>\n<li>Konzeption und Entwicklung von Rest-APIs in C # mit .NET Core</li>\n<li>Cloud-Architektur (Azure)</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Abwechslungsreiche Aufgaben in einem motivierten und freundlichen Team</li>\n<li>Ehrgeizige Vision um die Automatisierung in der Softwareentwicklungsbranche voranzutreiben</li>\n<li>Flache Hierarchien; vertrauensvolle und freundliche Unternehmenskultur</li>\n<li>Einblick in die Zürcher Start-up-Szene und Zugang zu einem etablierten Netzwerk</li>\n<li>Wettbewerbsfähiges Vergütungspaket</li>\n<li>Von zuhause aus arbeiten</li>\n</ul>\n<p><em>Du bringst:</em></p>\n<ul>\n<li>Leidenschaft für Codequalität und Best Development Practices</li>\n<li>Arbeitest gerne mit Kunden zusammen</li>\n<li>Autonome, proaktive und strukturierte Arbeitsweise</li>\n<li>Motiviert einem wachsenden Unternehmen beizutragen</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://logicflow.join.com/jobs/1634771-full-stack-angular-entwickler?pid=757e7cf81db3118dbbf1&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=full-stack%2Bangular%2Bentwickler\">https://logicflow.join.com/jobs/1634771-full-stack-angular-entwickler?pid=757e7cf81db3118dbbf1&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=full-stack%2Bangular%2Bentwickler</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc21SIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0edb432b47d1611f306d1fc48843270a06dedae3/nbdnaef9vjpxptji9mxl.png"
    },
    {
      "id": "c2beb2b6-9190-4ca7-b0ca-7804b768dc87",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/c2beb2b6-9190-4ca7-b0ca-7804b768dc87",
      "created_at": "Wed Dec 02 15:44:42 UTC 2020",
      "company": "Shell Business operations, Chennai",
      "company_url": "https://vonq.io/39GP0mu",
      "location": "Chennai",
      "title": "Associate Data Scientist",
      "description": "<h2>General Position Definition</h2>\n<ul>\n<li>Incumbent is responsible for developing analytical models for projects collaborating with different business stakeholders &amp; other partners and working across a range of technologies and tools.</li>\n<li>The ideal candidate has strong background in quantitative skills (like statistics, mathematics, advanced computing, machine learning) and has applied those skills in solving real world problems across different businesses / functions.</li>\n</ul>\n<h2>Purpose</h2>\n<ul>\n<li>Develops analytics models using specialized tools based on the business problem and data available</li>\n<li>Identifies the right set of models and develops the right code / package to execute them</li>\n<li>Evaluates the validity of the model (both scientifically as well as from a business perspective)</li>\n<li>Support the Data Science Team Lead in design and execution of analytics projects</li>\n<li>Work with Shell stakeholders and subject matter experts to complete tasks and deliverables on projects</li>\n</ul>\n<h2>Skills</h2>\n<h2>Stakeholder Engagement Skills</h2>\n<ul>\n<li>Working collaboratively across multiple sets of stakeholders – business SMEs, IT, Data teams, Analytics resources, etc. to deliver on project deliverables and tasks</li>\n<li>Identify actionable insights that directly address challenges / opportunities</li>\n<li>Articulate business insights and recommendations (based on model output) to respective stakeholders</li>\n<li>Understanding business KPI's, frameworks and drivers for performance</li>\n<li>Proficiency Level:<strong>Skill</strong>\n</li>\n</ul>\n<h2>Education Requirement/Field of Study :</h2>\n<ul>\n<li>3+ years of relevant experience in Retail domain</li>\n<li>Advanced university degree in Mathematics, Statistics, Engineering, Economics, Quantitative Finance, OR, etc.</li>\n<li>Good interpersonal communication skills and influencing skills</li>\n<li>Eagerness to learn and ability to work with limited supervision</li>\n</ul>\n<h2>Requirements :</h2>\n<h2>Industry / Functional Expertise</h2>\n<ul>\n<li>Provide deep business expertise preferably Oil &amp; Gas - Upstream or Downstream businesses. (If these are not available, willing to consider other industries that are similar or related - manufacturing, mining, power generation, etc.)</li>\n</ul>\n<h2>or</h2>\n<h2>functional expertise in any one or more of the following industry / functional areas</h2>\n<ul>\n<li>\n<strong>Customer / Marketing</strong>– pricing analytics, churn prediction, cross-sell / up-sell, Market Basket Analysis, Product Recommendation, Marketing Mix Modeling, Campaign design and effectiveness testing, Network Modeling, Customer segmentation, propensity analysis, customer lifetime value, profitability analysis, Customer experience (incl. voice of customer), CRM, Loyalty program management,</li>\n<li>\n<strong>Supply Chain / Spend</strong>: Demand &amp; Supply Forecasting, Spend Analytics, Vendor Scoring, Pricing analysis (buy-side), product substitution analysis, product portfolio optimization, Tail spend analysis, logistics / network / route optimization, Contract Compliance</li>\n<li>Proficiency Level:<strong>Mastery</strong>\n</li>\n</ul>\n<h2>Modeling and Technology Skills</h2>\n<ul>\n<li>Good expertise in machine learning techniques (supervised and unsupervised) statistics / mathematics / operations research including (but not limited to):\n<ul>\n<li>\n<strong>Advanced Machine learning techniques</strong>: Decision Trees, Neural Networks, Deep Learning, Support Vector Machines, Clustering, Bayesian Networks, Reinforcement Learning, Feature Reduction / engineering, Anomaly deduction, Natural Language Processing (incl. Theme deduction, sentiment analysis, Topic Modeling), Natural Language Generation</li>\n</ul>\n</li>\n</ul>\n<h2>and/or</h2>\n<ul>\n<li>\n<strong>Statistics / Mathematics</strong>: Data Quality Analysis, Data identification, Hypothesis testing, Univariate / Multivariate Analysis, Cluster Analysis, Classification/PCA, Factor Analysis, Linear Modeling, Logit/Probit Model, Affinity &amp; Association, Time Series, DoE, distribution / probability theory</li>\n</ul>\n<h2>and/or</h2>\n<ul>\n<li>\n<strong>Operations Research</strong>: Sensitivity Analysis – Shadow price, Allowable decrease or increase, Transportation problem &amp; variants, Allocation Problem &amp; variants, Selection problem, Multi-criteria decision-making, models, DEA, Employee Scheduling, Knapsack problem, Supply Chain Problem &amp; variants, Location Selection, Network designing – VRP, TSP, Heuristics Modeling</li>\n<li>Strong experience in specialized analytics tools and technologies (including, but not limited to)\n<ul>\n<li>Python, Azure Analysis Services</li>\n<li>Spotfire, PowerBI</li>\n<li>Awareness of Data Bricks, Apache Spark, Hadoop</li>\n<li>Awareness of Agile / Scrum ways of working</li>\n</ul>\n</li>\n<li>Identify the right modeling approach(es) for given scenario and articulate why the approach fits</li>\n<li>Assess data availability and modeling feasibility</li>\n<li>Review interpretation of models results</li>\n<li>Evaluate model fit and based on business / function scenario</li>\n<li>Proficiency Level:<strong>Skill-to-Mastery</strong>\n</li>\n</ul>\n<h2>Special Challenges</h2>\n<ul>\n<li>Rapid onboarding on projects, understanding analytics goal and working with ill-defined datasets</li>\n<li>Communicating technical jargon in plain English to colleagues within Data Science team and outside</li>\n<li>Virtual working with network of colleagues located throughout the globe</li>\n</ul>\n<p><a href=\"https://vonq.io/39GP0mu\">Click here for the application form!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/39GP0mu\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc09SIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e4460d8b2e1d39d0812c5c93a3d6bc1fab32eef8/Shell%20logo.jpg"
    },
    {
      "id": "2315d8ae-9e9b-4b73-a98e-8c383cdf532e",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/2315d8ae-9e9b-4b73-a98e-8c383cdf532e",
      "created_at": "Wed Dec 02 15:19:10 UTC 2020",
      "company": "Shell Business operations, Chennai",
      "company_url": null,
      "location": "Chennai",
      "title": "Data Scientist - Retail",
      "description": "<h2>General Position Definition</h2>\n<ul>\n<li>This role will drive analytics and data science for one or more of Shell’s Retail business teams</li>\n<li>The ideal candidate is passionate about delivering commercial value and insights through Retail Analytics and Data Science</li>\n<li>We help the business team’s answer some of the following questions:\n<ul>\n<li>What is the right assortment and mix of products to drive category growth?</li>\n<li>How responsive are our products to price changes?</li>\n<li>Which of our competitors impact our sales and pricing?</li>\n<li>How can we improve the customer experience at our outlets?</li>\n<li>Which customers are most likely to churn?</li>\n</ul>\n</li>\n<li>Candidate should be able to ask the right questions, ability to move from data to insight to action, break down strategic &amp; operational questions from different Retail teams and structurally answer them with data driven insights</li>\n<li>Incumbent is responsible for working on a range of technologies and tools collaborating directly with the Retail stakeholders &amp; other partners</li>\n</ul>\n<h2>Education Requirement/Field of Study :</h2>\n<ul>\n<li>Minimum 5-7 years of relevant experience in Retail Analytics</li>\n<li>Preferred experience in Retail, CPG or E-commerce</li>\n<li>Good interpersonal communication skills and influencing skills</li>\n<li>Eagerness to learn and ability to work with limited supervision</li>\n<li>Advanced university degree in Mathematics, Statistics, Engineering, Economics, etc.</li>\n</ul>\n<h2>Requirements : Skills</h2>\n<h2>Industry / Functional Expertise</h2>\n<ul>\n<li>Provide deep business expertise in Retail/CPG businesses:\n<ul>\n<li>\n<strong>Category Analytics</strong>:Range reviews, Assortment planning, identifying trends and patterns in category performance, new product launches</li>\n<li>\n<strong>Pricing Analytics</strong>:UnderstandingPrice elasticity, evaluating impact of competitor pricing, impact of pricing changes on margins</li>\n<li>\n<strong>Marketing and Promotion Analytics</strong>: Campaign design and promo effectiveness testing, churn prediction, cross-sell / up-sell, Market Basket Analysis, Customer segmentation, propensity analysis, customer lifetime value, market mix modeling</li>\n<li>\n<strong>Store Analytics</strong>:Leverage data and visualization to create actionable insights for on ground store teams, territory and district managers</li>\n</ul>\n</li>\n<li>Should have strong story telling skills: Ability to explain complex data and models to business teams</li>\n<li>Proficiency Level:<strong>Mastery</strong>\n</li>\n</ul>\n<h2>Stakeholder Engagement Skills</h2>\n<ul>\n<li>Working collaboratively across multiple sets of stakeholders – business SMEs, IT, Data teams, Analytics resources to deliver on project deliverables and tasks</li>\n<li>Identify actionable insights that directly address Retail Team’s challenges / opportunities</li>\n<li>Articulate business insights and recommendations to respective stakeholders</li>\n<li>Understanding business KPI's, frameworks and drivers for performance</li>\n<li>Proficiency Level:<strong>Mastery</strong>\n</li>\n</ul>\n<h2>Technology Skills</h2>\n<ul>\n<li>Strong experience in specialized analytics tools and technologies (including, but not limited to)\n<ul>\n<li>Azure Databricks, Alteryx</li>\n<li>Power BI, Spotfire or other visualization tools</li>\n<li>Python, R</li>\n</ul>\n</li>\n<li>\n<strong>Statistics / Machine Learning</strong>: Data Quality Analysis, Exploratory data analysis, Hypothesis testing, Univariate / Multivariate Analysis, Classification/PCA, Factor Analysis, Linear Modeling, Affinity &amp; Association, Time Series, Decision Trees, sentiment analysis, Clustering</li>\n<li>Identify the right approach(es) for given scenario and articulate why the approach fits</li>\n<li>Assess data availability and modeling feasibility</li>\n<li>Proficiency Level:<strong>Skill-to-Mastery</strong>\n</li>\n</ul>\n<h2>Special Challenges</h2>\n<ul>\n<li>Easily analyzes, draws and synthesizes important insights from complex data.</li>\n<li>Extremely curious and self-driven to understand business performance through data.</li>\n<li>Ability to translate a business question into a well-defined analytical plan that includes data requirements for technical resources to extract the necessary data.</li>\n<li>Rapid onboarding on projects, understanding analytics goal and working with ill-defined datasets</li>\n<li>Communicating technical jargon in plain English to colleagues within Data Science team and outside</li>\n<li>Virtual working with network of colleagues located throughout the globe</li>\n</ul>\n<p><a href=\"https://vonq.io/37r0DeO\">Click here for the application form!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/37r0DeO\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjZSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--08ca12e0c881890cbb091208b7bcb9fe78bc6749/Shell%20logo.jpg"
    },
    {
      "id": "3fc15bd7-3217-4526-a805-2a48364c5a11",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/3fc15bd7-3217-4526-a805-2a48364c5a11",
      "created_at": "Wed Dec 02 14:48:39 UTC 2020",
      "company": "Shell Business operations, Bangalore",
      "company_url": "https://vonq.io/3og0XUt",
      "location": "Bangalore",
      "title": "Full Stack Engineer",
      "description": "<h2>Job Description:</h2>\n<p>An exciting opportunity to work at the new Engineering organization in Shell IT. We are looking for a talented Full Stack Developer with great interpersonal skills to join our team. Shell’s business has been built on a foundation of innovative technology and skilled people. By providing energy to sustain people’s lives over 125 years, Shell is one of the world’s leading companies. IT Engineering gives you an opportunity to make an impact that matters – be it in complex predictive maintenance and inventory management solutions to optimize uptime of our Upstream assets or innovative solutions that satisfy customers at one of our 49,000 branded service stations, the world’s largest retail network.</p>\n<p>Your growth is our future in IT Engineering. Information technology supports all aspects of our businesses and we have some of the world’s most complex problems to solve. You will not only get an opportunity to work with the latest technology, but with the scale of Shell, you will also get the opportunity to shape future digital technology working with the biggest players in the technology industry. With open source a key tenet of our technology choices, you will also get the opportunity to contribute back to the software community. The diversity of positions on offer are bound to help you grow in your career.</p>\n<p>Working with other computer scientists and software engineers in Shell, IT Engineering offers a unique opportunity for you to make an impact across a complex integrated energy value chain serving all lines of business in the Group. You could be creating new customer services in the largest Lubricants business globally, or innovating ways to grow an Aviation business which refuels five aircrafts every minute. With Shell investing significantly in renewables, there will be several opportunities to power our green engine too.</p>\n<p>IT Engineering drives business value through providing world class technical, functional and consulting expertise to deliver the right skills, at the right time, in the right place. In IT Engineering you will have opportunities to work on IT projects, programmes and products across the value chain of Shell. Our technical career paths will support your personal development through learning and certifications. We are the home of technical talent where you can grow your career, develop leading edge skills and deepen your business knowledge. Comprising of six capability centres, we bring together natural sets of skills at scale, providing our customers with size and depth in terms of business and platform knowledge. The capability centres promote continuous improvement of functional excellence, giving you the methods, standards, best practices, platforms, tools and external insights to support and accelerate your capability development. Our communities of practice provide access to expertise and learning, where your skills and passion for innovation and excellence will thrive.</p>\n<p>You are expected to be a seasoned software engineer having proven software engineering credentials delivering software products/applications generating business value. You are expected to be driven towards building quality software at pace. You would need to have a continuous improvement mindset, driving value-based process, product/application optimization.</p>\n<p>We’re looking to hone full stack developers with the ability to tackle complex problem areas in terms of people, industry and scenario. You should be able to plan, manage and execute a course of work, be highly independent, confident in your abilities and flexible enough to adapt to a fluid project landscape.</p>\n<p>You will be working closely with product owners and designers so strong knowledge of product and design will be helpful.</p>\n<h2>Key Accountabilities:</h2>\n<ul>\n<li>Solution consultation and development in accordance to the enterprise technology principles, methods, standards, and practices.</li>\n<li>Estimation, solution design, detailed technical design, application technical deliverables including code, associated tests and documentation.</li>\n<li>Contribution to functional excellence in terms of definition and maintenance of standards, methods and tools, bringing in best practices from market standard implementations.</li>\n<li>Manage complex integration scenarios and interfaces between on-premise solutions, cloud and legacy systems.</li>\n</ul>\n<h2>Skills &amp; Requirements:</h2>\n<ul>\n<li>Looking to invite passionate developers with varying software development experience ranging from 5 years to very senior profiles with 20 years’ experience, with a relevant Full Stack profile (experience in front-end, back-end, cloud automation and orchestration)</li>\n<li>Must have strong foundation in one or more of C#, Python or Java Script</li>\n<li>Proficient in Functional &amp; Object-Oriented Programming, Design Patterns with expertise in one or more of the Cloud-Native technologies (C#, Python, .NET Core, Web API, PostgreSQL, HTML5, CSS3, Golang, React.js, Node.js, Graph QL, etc).</li>\n<li>Thorough understanding of containers and functions. Deployment experience with Kubernetes (K8s) or Functions is a plus.</li>\n<li>Highly desirable to have experience deploying workloads to Azure or AWS with strong knowledge and understanding of the cloud provider’s API / associated services and infrastructure and configuration as code frameworks (Terraform &amp; Ansible)</li>\n<li>Experience using Cloud Native CI/CD tools (Azure Pipelines/Circle CI/Jenkins X) is highly desirable.</li>\n<li>Knowledge of other Cloud (Amazon Web Services, Cloudera etc), and Integration (BizTalk, Logic Apps, MuleSoft etc) technologies is highly desirable.</li>\n<li>Demonstrated ability of design and development of applications/ products utilizing a variety of architecture principles, including microservices architecture.</li>\n<li>Demonstrated application of the best practices in various stages of the software development life cycle.</li>\n<li>Experience working in agile teams with demonstrated application of the principles.</li>\n</ul>\n<p><a href=\"https://vonq.io/3og0XUt\">Click here for the application form!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/3og0XUt\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmlSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--197f3dd2f255149c662baa1521dbbec48856d52c/Shell%20logo.jpg"
    },
    {
      "id": "247ed817-b1e5-4b2c-b9eb-3733b69aefb8",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/247ed817-b1e5-4b2c-b9eb-3733b69aefb8",
      "created_at": "Wed Dec 02 14:50:50 UTC 2020",
      "company": "Universiteit Utrecht ",
      "company_url": "https://vonq.io/36vvdVn",
      "location": "Utrecht ",
      "title": "Research Engineer (0.8 - 1.0 FTE)",
      "description": "<h2>Research Engineer (0.8 - 1.0 FTE)</h2>\n<h2>Job description</h2>\n<p>Are you experienced in digital research infrastructures? The Research Engineering team at Utrecht University is looking for an experienced Research Engineer. This team supports Researchers in applying digital technologies, in various stages of their research. We help Researchers with technological challenges on, for example data handling and computing. But we also consult on methodological issues, like the selection of the most suitable research approach or the validation of results.</p>\n<p>In our engineering projects, we closely work together with Researchers from a wide variety of domains and for a specific period. Our unique approach combines experience in both academic research and software engineering. Our team consists of a diverse group of engineers with a variety of skills and expertise.</p>\n<h2>Your job</h2>\n<p>In particular we are looking for an engineer with experience in digital research infrastructures. You will interact with various infrastructure providers, both internal and external. Together you will develop solutions for efficient computing and data handling in research projects.\nYou will be expected to closely manage your engineering projects.\nYou maintain good working relationships with Researchers and stakeholders.\nAs a member of the team you will contribute to its success. You actively participate in the team strategy and support less experienced colleagues.</p>\n<h2>Qualifications</h2>\n<p>Expertise</p>\n<ul>\n<li>Considerable experience with software development in an academic environment;</li>\n<li>Master's or PhD degree;</li>\n<li>Experience with development and use of scientific software;</li>\n<li>Proficiency in Python, R and/or C;</li>\n<li>Engineering experience with Linux, shell scripting and version control (Git);</li>\n<li>Engineering experience with cloud computing, high performance computing and/or databases;</li>\n<li>Experience with machine learning, data/text mining, workflows and/or efficient computing.</li>\n</ul>\n<p>Competencies</p>\n<ul>\n<li>Excellent communication and collaboration skills;</li>\n<li>Proven organizational and time management skills;\n-Ability to work independently;</li>\n<li>Strong analytical skills;</li>\n<li>Flexible approach and manner.</li>\n<li>Good English language/reading/writing skills.</li>\n</ul>\n<h2>Offer</h2>\n<p>We offer a temporary position (0.8 - 1.0 FTE) for a period of one year. In case of a positive performance evaluation, a permanent position is a possibility. You will receive a laptop and smartphone from the University Library. The gross salary - depending on previous qualifications and experience - ranges between €3,746 and €5,127 (scale 11 according to the Collective Labour Agreement Dutch Universities) per month for a full-time employment. Salaries are supplemented with a holiday bonus of 8% and a year-end bonus of 8.3% per year. In addition, Utrecht University offers excellent secondary conditions, including an attractive retirement scheme, (partly paid) parental leave and flexible employment conditions (multiple choice model). More information about working at Utrecht University can be found here.</p>\n<h2>About the organization</h2>\n<p>A better future for everyone. This ambition motivates our scientists in executing their leading research and inspiring teaching. At Utrecht University, the various disciplines collaborate intensively towards major societal themes. Our focus is on Dynamics of Youth, Institutions for Open Societies, Life Sciences and Sustainability.</p>\n<p>The University Corporate Offices provide integrated support to the Board of Utrecht University. The eight corporate offices assist the Executive Board in drawing up and implementing the annual executive agenda and the four-yearly Strategic Plan and in providing support services.</p>\n<p>The Information Technology Services (ITS) department is responsible for the central IT services of the entire university. About 8,000 internal employees and 30,000 students use the services of ITS. ITS provides several IT services, tools and infrastructure to support Utrecht University Researchers in their work. Examples of what we offer in research support are research engineering, research data repositories, computing and data analysis platforms, electronic lab notebooks and security tooling.</p>\n<h2>Additional information</h2>\n<p>For more information about the position, please contact Frank Heere (Department Manager Research &amp; Data Management Services) at <a href=\"mailto:f.h.heere@uu.nl\">f.h.heere@uu.nl</a> or +31 6 26 73 28 43.</p>\n<h2>Apply</h2>\n<p>Everyone deserves to feel at home at our university. We welcome employees with a wide variety of backgrounds and perspectives. Are you interested? If so, please send your application with your curriculum vitae and motivation letter for the attention of Frank Heere using the <strong>\"Apply\"</strong> button.</p>\n<p>Please note: Due to the current situation regarding the Corona virus (COVID-19) the process of selection and interviews may be subject to change.</p>\n<h2>The application deadline is</h2>\n<p>20/12/2020</p>\n<p><a href=\"https://vonq.io/36vvdVn\">Click here for the application form!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/36vvdVn\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcnVSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9b07b8df65959a86301e7e648571fde39cc3fc2e/Universiteit+Utrecht.jpg"
    },
    {
      "id": "03f76ce2-213b-43aa-8127-7e6885a08a28",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/03f76ce2-213b-43aa-8127-7e6885a08a28",
      "created_at": "Wed Dec 02 14:26:47 UTC 2020",
      "company": "Shell Business operations, Bangalore",
      "company_url": "https://vonq.io/3ogSW1q",
      "location": "Bangalore",
      "title": "Machine Learning Engineer",
      "description": "<p>The Machine Learning Engineer is responsible for unlocking value for the business through data. Able to identify, mature and deliver opportunities through the value funnel that demonstrate benefits. Strong understanding of the digital and data revolution and its current and future impacts on business. Able to translate business strategy into data-specific actions and interventions, to assess the benefits of new technologies and trends, and have deep understanding of digitalization and data &amp; analytics. Strong stakeholder and change management skills and ability to partner and influence across the organizational ecosystem, including the Business, IT, TDM, Digital Centre of Excellence and Finance &amp; Data Operations.</p>\n<h2>Job Description</h2>\n<p>Machine Learning Engineer will support our various business vertical teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes.</p>\n<h2>Accountabilities:</h2>\n<ul>\n<li>Research and develop statistical learning models for data analysis</li>\n<li>Collaborate with product management and engineering departments to understand company needs and devise possible solutions</li>\n<li>Keep up-to-date with latest technology trends</li>\n<li>Communicate results and ideas to key decision makers</li>\n<li>Implement new statistical or other mathematical methodologies as needed for specific models or analysis</li>\n<li>Optimize joint development efforts through appropriate database use and project design</li>\n</ul>\n<h2>Special Challenges:</h2>\n<p><strong>Technical Skills:</strong></p>\n<ul>\n<li>Demonstrated skill in the use of one or more analytic software tools or languages (e.g., R, Python, Pyomo, Julia/Jump, Matlab, SAS,SQL)</li>\n<li>Demonstrated skill at data cleansing, data quality assessment, and using analytics for data assessment</li>\n<li>End-to-end system design: data analysis, feature engineering, technique selection &amp; implementation, debugging, and maintenance in production.</li>\n<li>Profound understanding of skills like outlier handling, data imputation, bias, variance, cross validation etc.</li>\n<li>Demonstrated skill in modeling techniques, including but not limited to Predictive modeling, Supervised learning, Unsupervised learning, Machine Learning, Statistical Modeling, Natural language processing, Recommendation engines,</li>\n<li>Demonstrated skill in analytic prototyping, analytic scaling, and solutions integration</li>\n<li>Developing hypotheses and set up your own problem frameworks to test for the best solutions</li>\n<li>Knowledge of data visualization tools - ggplot, Dash, d3.js and Matplottlib (or any other data visualization like PowerBI, Tableau, Spotfire)</li>\n<li>Generating insights for a business context</li>\n</ul>\n<h2>Desirable:</h2>\n<ul>\n<li>Experience with cloud technologies for building, deploying and delivering data science applications is desired (preferably in Microsoft Azure)</li>\n<li>Experience in Tensorflow, Keras, Theano, Text Mining is desirable but not mandatory</li>\n<li>Experience to work in Agile and DevOps processes.</li>\n</ul>\n<h2>Core Skills:</h2>\n<ul>\n<li>Bachelor or master degree in information technology, computer science, business administration or a related discipline.</li>\n</ul>\n<h2>Leadership Skills:</h2>\n<ul>\n<li>Strong stakeholder management and influencing skills. Able to articulate a vision and build support for that vision in the wider team and organization.</li>\n<li>Ability to self-start and direct efforts based on high-level business objectives</li>\n<li>Strong collaboration and leadership skills with the ability to coach and develop teams to meet new challenges.</li>\n<li>Strong interpersonal, communication, facilitation and presentation skills.</li>\n<li>Work through complex interfaces across organizational and geographic boundaries</li>\n<li>Excellent analytical, planning and problem solving skills</li>\n</ul>\n<h2>Job Experience Requirements:</h2>\n<ul>\n<li>Utilize an advanced knowledge level of the Data Science Toolbox to participate in the entire Data Science Project Lifecycle and execute end-to-end Data Science project</li>\n<li>Work end-to-end on Data Science developments contributing to all aspects of the project lifecycle</li>\n<li>Should be able to handle big data, structured, unstructured data and manage the data for further analytical processes</li>\n<li>Have an analytical thought process and ability to process complex information.</li>\n<li>Keep customers as focus of analysis insight and recommendation.</li>\n<li>Help define business objectives/customer needs by capturing the right requirements from the right customers.</li>\n<li>Can take defined problems and identify resolution paths and opportunities to solve them; which you validate by defining hypotheses and driving experiments</li>\n<li>Can identify unstructured problems and articulate opportunities to form new analytics project ideas</li>\n<li>Use and understand the key performance indicators (KPIs) and diagnostics to measure performance against business goals</li>\n<li>Compile integrate and analyze data from multiple sources to identify trends expose new opportunities and answer ongoing business questions</li>\n<li>Execute hypothesis-driven analysis to address business questions issues and opportunities</li>\n<li>Build validate and manage advanced models (e.g. explanatory predictive) using statistical and/or other analytical methods</li>\n<li>Are familiar working within Agile Project Management methodologies / structures</li>\n<li>Analyze results using statistical methods and work with senior team members to make recommendations to improve customer experience and business result</li>\n<li>Have the ability to conceptualize formulate prototype and implement algorithms to capture customer behavior and solve business problems</li>\n<li>Analyze results using statistical methods to make recommendations to improve customer experience and business results</li>\n</ul>\n<h2>Interested?</h2>\n<p><a href=\"https://vonq.io/3ogSW1q\">Click here for the application form!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/3ogSW1q\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcTJSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--376cde3ccb0a2a562d25de7cfc361e8460d587bf/Shell%20logo.jpg"
    },
    {
      "id": "9cc73009-b73d-4ed0-a6b3-7da236236464",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9cc73009-b73d-4ed0-a6b3-7da236236464",
      "created_at": "Wed Dec 02 14:27:31 UTC 2020",
      "company": "Shell Business operations, Chennai",
      "company_url": "https://vonq.io/3gaTeV3",
      "location": "Chennai",
      "title": "Data Science Team Lead",
      "description": "<p>The Data Science Team is tasked with delivering tangible value to business units within Shell through data-driven decision making.</p>\n<h2>Role:</h2>\n<ul>\n<li>This position is part of Finance &amp; Data Operations Data Science team leading a small team of data scientists delivering advanced analytics projects for different businesses within Shell. The individual will join a growing global data science organization spanning both on/offshore.</li>\n<li>Incumbent is responsible for developing analytical models for projects collaborating with different business stakeholders &amp; other partners and working across a range of technologies and tools.</li>\n<li>\n<strong>Critical skill:</strong> Managing tough stakeholders and exceeding their expectations. This role has very demanding global stakeholders and the candidate will need to work closely with them and ensure error free delivery of existing projects. Also will need to demonstrate ability and skills required for taking on advanced analytics projects</li>\n<li>The ideal candidate has strong background in quantitative skills (like statistics, mathematics, advanced computing, machine learning) and has applied those skills in solving real world problems across different businesses / functions.</li>\n<li>Candidates will need to develop deep expertise in Shell data sources and operation of analytical tools so that they can not only answer business questions but follow their own initiative to further drill down to find the true underlying reasons. Business Questions are likely to relate to Range optimisation, Promotion effectiveness, On-Shelf availability, Pricing optimisation, Performance decomposition, Store clustering and identifying purchase patterns.</li>\n</ul>\n<h2>Dimensions :</h2>\n<ul>\n<li>Lead the execution of analytics projects within the portfolio</li>\n<li>Design and articulate the data science solution relevant to the business problem / opportunity</li>\n<li>Lead identification of appropriate data science models and evaluate their fitment for the available data</li>\n<li>Articulate the insights from the models in business-friendly language and explain the workings of the model for business adoption</li>\n<li>Provide support to the business value manager in managing the portfolio</li>\n</ul>\n<h2>Education Requirement/Field of Study:</h2>\n<p> </p>\n<h2>Project Management</h2>\n<ul>\n<li>Execute end-to-end analytics projects - Project scoping, sourcing data, managing modeling, translating model results into business insights, and helping business partner understand insights and make decisions accordingly (help generate value for organization through analytics)</li>\n<li>Creating project management plan, running status update meetings, coordinating deliverables and timelines, and managing risks to project delivery</li>\n<li>Recognize the level of statistical knowledge in business stakeholders vs. analytics experts vs. IT resources and articulating how analytics will be applied appropriately</li>\n<li>Manage different moving parts - business stakeholders, IT, Analytics Resources, Data Experts, SMEs, etc. for the successful execution of the projects (executing multiple projects at a time will be considered a plus)</li>\n<li>Proficiency Level: Mastery</li>\n</ul>\n<h2>Special Challenges</h2>\n<ul>\n<li>Deliver practical working solutions from a new and developing conceptual area.</li>\n<li>Develop understanding of data analytics in colleagues to the level they each require recognizing that level is very different for different stakeholders and project team members.</li>\n<li>Virtual working with network of colleagues located throughout the globe.</li>\n</ul>\n<h2>Requirements :</h2>\n<p> </p>\n<h2>Stakeholder Management Skills</h2>\n<ul>\n<li>Working with demanding and difficult stakeholders who are highly analytical. The candidate should be able to demonstrate advanced analytics skills to them and ensure all projects are error free</li>\n<li>Forming close relationships with business stakeholders across businesses / functions to comprehensively understand their areas of operation and apply those in project execution</li>\n<li>Clearly articulate the challenges / opportunities in business / function that can be supported by analytics</li>\n<li>Deliver actionable insights that directly address challenges / opportunities</li>\n<li>Guide articulation of business insights and recommendations (based on model output) based on understanding of business / function and respective stakeholders</li>\n<li>Understanding of business governance and control structures &amp; selecting the right analytical approaches which are consistent with businesses control/governance framework</li>\n<li>Understanding business KPI's, frameworks and drivers for performance</li>\n<li>Proficiency Level: <strong>Mastery</strong>\n</li>\n</ul>\n<h2>Industry / Functional Expertise</h2>\n<p>Prior experience of 8+ years in Retail (or similar) industry as an analytics/BI professional OR expertise in Retail sales &amp; marketing. Functional expertise in any one or more of the following industry / functional areas</p>\n<ul>\n<li>\n<strong>Pricing Analytics</strong> -Price Elasticity, Optimization, Price Trial Evaluation and Forecasting</li>\n<li>\n<strong>Customer / Marketing</strong>– churn prediction, cross-sell / up-sell, Market Basket Analysis, Product Recommendation, Marketing Mix Modeling, Campaign design and effectiveness testing, Network Modeling, Customer segmentation, propensity analysis, customer lifetime value, profitability analysis,\nCustomer experience (incl. voice of customer), CRM, Loyalty program management,</li>\n<li>\n<strong>Supply Chain / Spend</strong>: Demand &amp; Supply Forecasting, Spend Analytics, Vendor Scoring, Pricing analysis (buy-side), product substitution analysis, product portfolio optimization, Tail spend analysis, logistics / network / route optimization, Contract Compliance</li>\n<li>Proficiency Level:<strong>Skill-to-Mastery</strong>\n</li>\n</ul>\n<h2>Modeling and Technology Skills</h2>\n<ul>\n<li>Deep expertise in machine learning techniques (supervised and unsupervised) statistics / mathematics / operations research including (but not limited to):\n<ul>\n<li>\n<strong>Statistics / Mathematics</strong>: Data Quality Analysis, Data identification, Hypothesis testing, Univariate / Multivariate Analysis, Cluster Analysis, Classification/PCA, Factor Analysis, Linear Modeling, Affinity &amp; Association, Time Series, DoE, distribution / probability theory</li>\n</ul>\n</li>\n<li>Strong experience in specialized analytics tools and technologies (including, but not limited to)\n<ul>\n<li>Python, R</li>\n<li>Alteryx,Spotfire, Tableau</li>\n<li>Ability to search, extract, load &amp; visualize data from data bases using pre-defined reports and new ad hoc queries (using BI self service)</li>\n<li>Proven ability to use visualization software packages – Spotfire, Tableau as an advantage and to make state of art presentations using MS ppt</li>\n<li>Identify the right modeling approach(es) for given scenario and articulate why the approach fits</li>\n<li>Assess data availability and modeling feasibility</li>\n<li>Review interpretation of models results</li>\n<li>Retail experience (Must) Convenience Retail experience ( good to have)</li>\n<li>Master of MS Power Point (Must)</li>\n<li>Story telling: capacity of presenting data in an easy and compelling way</li>\n<li>Ability to work under pressure as numbers of request from business are growing and expectations is to grow even more due to the success of the work done so far</li>\n<li>Strong analytical mindset and real passion for Data, drilling data for insight and learning new things every day in a pro-active way.</li>\n<li>Evaluate model fit and based on business / function scenario</li>\n<li>Proficiency Level:<strong>Mastery</strong>\n</li>\n</ul>\n</li>\n</ul>\n<h2>Interested?</h2>\n<p>Apply now by using the application form!</p>\n<p><a href=\"https://vonq.io/3gaTeV3\">Click here for the application form!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/3gaTeV3\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckNSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1f2bb1d326e3c0d8c48e346ba3befd8cf2c61b62/Shell.png"
    },
    {
      "id": "cd7378a6-5fe3-4cf2-a55f-3726f850813b",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/cd7378a6-5fe3-4cf2-a55f-3726f850813b",
      "created_at": "Wed Dec 02 12:46:35 UTC 2020",
      "company": "Farmy AG",
      "company_url": "https://www.farmy.ch/",
      "location": "Barcelona",
      "title": "Ruby on Rails Platform Team-Lead",
      "description": "<p>Farmy AG is an established Swiss-based e-commerce company is hiring Software Engineers to beef up its App Development and Digital Laboratory team. We’re the No. 1 in several nominations as reported by the Swiss e-Commerce Awards 2015 / 2017 / 2019. The job location is in Barcelona, Spain as this is where our software engineering team is working from in tight coordination with Farmy headquarters in Zurich and Lausanne in Switzerland.</p>\n<p>Farmy develops and runs an organic and local food retail platform that connects customers with farmers’ product supplies directly. When you place an order with Farmy, you get fresh food, which a day before was collected at the farmyard, right to your doorstep or your favorite cafe – a thing, no conventional retail chain can give you. Our customers love eating healthy and fresh food, and with over 12'5000 products on sale in our catalog, we do try to satisfy their appetite with every update.</p>\n<p>Our company is growing rapidly, after 6 successful years in the Swiss market, preparing for expansion and we’re hiring.</p>\n<p>The working environment will be a nice digital office space in barrio San Martín with friendly people, delicious coffee and fine activity options around the place.</p>\n<p><strong>Tasks</strong></p>\n<p>Team-lead developer position assumes a flexible role in a mostly full-stack team while working on increasing team skills, solving complex software engineering problems and coordinating frontend and backend developers, communicating with business units and sprint planning.</p>\n<p>You'll be leading a small but versatile team of several frontend and backend engineers, maintaining and extending a Ruby monolith app platform with a surrounding ecosystem of Ruby, Python and Node.js services.</p>\n<p>You will report directly to the CTO.</p>\n<p><strong>Requirements</strong></p>\n<p><em>Technical Skills Required:</em></p>\n<ul>\n<li>Ruby on Rails experience is a must, the platform is Ruby-based, utilizing a lot of popular libraries;</li>\n<li>AngularJS AND ReactJS skill is a must;</li>\n<li>HTML5 Stack: JS, SASS, HAML and Javascript ES6;</li>\n<li>Rails framework and ecosystem;</li>\n<li>High-level Linux/Unix skills, Unix shell should feel like home.</li>\n<li>RESTful APIs and modern authentication patterns;</li>\n<li>Git processes, conflict resolution, merging, etc.</li>\n<li>Atlassian Jira management workflow, understanding of time/resource tracking features;</li>\n<li>Practical machine learning and predictions experience will yield a large number of extra points!;</li>\n<li>Android Java platform and/or Apple Swift knowledge are totally not required but will yield extra points, as we have a small code-base using these, which requires maintenance and improvements.</li>\n</ul>\n<p><em>Language Skills Required:</em></p>\n<ul>\n<li>High spoken and written English proficiency (all communication is done in English, the team speaks English and Castellano)</li>\n<li>German proficiency will be a plus but is not required (although you’ll be often working with German, French and English content)</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Anual educational budget</li>\n<li>Sports subscription in the club just below the office.</li>\n<li>Very flexible 40 hours, fixed contract, compatible with your personal issues that may arise every now and then.</li>\n</ul>\n<p><strong>We’re looking for a dedicated person, who loves programming big and complex things and just can’t stop thinking about it. If you’re like that, please feel welcome to drop us a line!</strong></p>\n",
      "how_to_apply": "<p><a href=\"https://farmy.join.com/jobs/1624596-ruby-on-rails-platform-team-lead?pid=9b761b671bb1b4703b84&amp;utm_source=stackoverflow&amp;utm_medium=paid&amp;utm_campaign=stackoverflow%2Blinkedin%2Bpackage&amp;utm_content=ruby%2Bon%2Brails%2Bplatform%2Bteam-lead\">https://farmy.join.com/jobs/1624596-ruby-on-rails-platform-team-lead?pid=9b761b671bb1b4703b84&amp;utm_source=stackoverflow&amp;utm_medium=paid&amp;utm_campaign=stackoverflow%2Blinkedin%2Bpackage&amp;utm_content=ruby%2Bon%2Brails%2Bplatform%2Bteam-lead</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUNSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--89ef27a4cdf9a7d712e9aed316416686d4646cce/logo-square-header-corona-65b3139aace7eda4752aaa63b1d7b204775d66a76c8a82c1d1d78726793a96a4.png"
    },
    {
      "id": "e0714497-d1b7-4411-b6b6-39cf49bc3a24",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/e0714497-d1b7-4411-b6b6-39cf49bc3a24",
      "created_at": "Wed Dec 02 11:51:26 UTC 2020",
      "company": "Shell Business operations, Bangalore",
      "company_url": "https://vonq.io/3lqRA2h",
      "location": "Bangalore",
      "title": "Sr. Machine Learning Engineer",
      "description": "<p>The Sr. Machine Learning Engineer is responsible for unlocking value for the business through data. Able to identify, mature and deliver opportunities through the value funnel that demonstrate benefits. Strong understanding of the digital and data revolution and its current and future impacts on business. Able to translate business strategy into data-specific actions and interventions, to assess the benefits of new technologies and trends, and have deep understanding of digitalization and data &amp; analytics. Strong stakeholder and change management skills and ability to partner and influence across the organizational ecosystem, including the Business, IT, TDM, Digital Centre of Excellence and Finance &amp; Data Operations.</p>\n<h2>Job Description:</h2>\n<p>Sr. Machine Learning Engineer will support our various business vertical teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes.</p>\n<h2>Accountabilities:</h2>\n<ul>\n<li>Research and develop statistical learning models for data analysis</li>\n<li>Collaborate with product management and engineering departments to understand company needs and devise possible solutions</li>\n<li>Keep up-to-date with latest technology trends</li>\n<li>Communicate results and ideas to key decision makers</li>\n<li>Implement new statistical or other mathematical methodologies as needed for specific models or analysis</li>\n<li>Optimize joint development efforts through appropriate database use and project design</li>\n</ul>\n<h2>Leadership Skills:</h2>\n<ul>\n<li>Strong stakeholder management and influencing skills. Able to articulate a vision and build support for that vision in the wider team and organization.</li>\n<li>Ability to self-start and direct efforts based on high-level business objectives</li>\n<li>Strong collaboration and leadership skills with the ability to coach and develop teams to meet new challenges.</li>\n<li>Strong interpersonal, communication, facilitation and presentation skills.</li>\n<li>Work through complex interfaces across organizational and geographic boundaries</li>\n<li>Excellent analytical, planning and problem solving skills</li>\n<li>Utilize an advanced knowledge level of the Data Science Toolbox to participate in the entire Data Science Project Lifecycle and execute end-to-end Data Science project</li>\n<li>Work end-to-end on Data Science developments contributing to all aspects of the project lifecycle</li>\n<li>Should be able to handle big data, structured, unstructured data and manage the data for further analytical processes</li>\n<li>Have an analytical thought process and ability to process complex information.</li>\n<li>Keep customers as focus of analysis insight and recommendation.</li>\n<li>Help define business objectives/customer needs by capturing the right requirements from the right customers.</li>\n<li>Can take defined problems and identify resolution paths and opportunities to solve them; which you validate by defining hypotheses and driving experiments</li>\n<li>Can identify unstructured problems and articulate opportunities to form new analytics project ideas</li>\n<li>Use and understand the key performance indicators (KPIs) and diagnostics to measure performance against business goals</li>\n<li>Compile integrate and analyze data from multiple sources to identify trends expose new opportunities and answer ongoing business questions</li>\n<li>Execute hypothesis-driven analysis to address business questions issues and opportunities</li>\n<li>Build validate and manage advanced models (e.g. explanatory predictive) using statistical and/or other analytical methods</li>\n<li>Are familiar working within Agile Project Management methodologies / structures\nAnalyze results using statistical methods and work with senior team members to make recommendations to improve customer experience and business results</li>\n<li>Have the ability to conceptualize formulate prototype and implement algorithms to capture customer behavior and solve business problems</li>\n<li>Analyze results using statistical methods to make recommendations to improve customer experience and business results</li>\n<li>Demonstrated skill in the use of one or more analytic software tools or languages (e.g., R, Python, Pyomo, Julia/Jump, Matlab, SAS,SQL)</li>\n<li>Demonstrated skill at data cleansing, data quality assessment, and using analytics for data assessment</li>\n<li>End-to-end system design: data analysis, feature engineering, technique selection &amp; implementation, debugging, and maintenance in production.</li>\n<li>Profound understanding of skills like outlier handling, data imputation, bias, variance, cross validation etc.</li>\n<li>Demonstrated skill in modeling techniques, including but not limited to Predictive modeling, Supervised learning, Unsupervised learning, Machine Learning, Statistical Modeling, Natural language processing, Recommendation engines.</li>\n<li>Demonstrated skill in analytic prototyping, analytic scaling, and solutions integration</li>\n<li>Developing hypotheses and set up your own problem frameworks to test for the best solutions</li>\n<li>Knowledge of data visualization tools - ggplot, Dash, d3.js and Matplottlib (or any other data visualization like Tableau, Qlikview)</li>\n<li>Generating insights for a business context</li>\n</ul>\n<h2>Desirable:</h2>\n<ul>\n<li>Experience with cloud technologies for building, deploying and delivering data science applications is desired (preferably in Microsoft Azure)</li>\n<li>Experience in Tensorflow, Keras, Theano, Text Mining is desirable but not mandatory</li>\n<li>Experience to work in Agile and DevOps processes.</li>\n</ul>\n<h2>Core Skills:</h2>\n<ul>\n<li>Bachelor or master degree in information technology, computer science, business administration or a related discipline.</li>\n<li>Certified in Agile Product Owner / SCRUM master and/or other Agile techniques</li>\n</ul>\n<h2>Interested?</h2>\n<p>Apply now by using the applicationform.</p>\n<p><a href=\"https://vonq.io/3lqRA2h\">Click here for the application form!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/3lqRA2h\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcHlSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2d36298c188e337975188695ffb216295a63d536/Shell.png"
    },
    {
      "id": "6c5e30ab-4485-4505-8693-8056bacefb47",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/6c5e30ab-4485-4505-8693-8056bacefb47",
      "created_at": "Wed Dec 02 11:39:49 UTC 2020",
      "company": "Shell India Markets Pvt. Ltd.",
      "company_url": "https://vonq.io/36uHBEV",
      "location": "Bangalore",
      "title": "HPC & AI Resident",
      "description": "<p>The world faces energy challenges that are becoming more complex each day. We are looking for people who share our passion for taking on these challenges with cutting edge technology, innovative thinking and commitment to manage risks. Shell develops and operates some of the largest, most complex energy projects in the world, we always endeavour to work at the leading edge of technical innovation.</p>\n<h2>About Digital Centre of Expertise</h2>\n<p>Shell’s Digital Centre of Expertise, part of Shell’s Technology business unit offers the opportunity to lead the digital transformation of the energy industry. We are a world leading community of industrial scientists and engineers committed to using cutting edge R&amp;D to take us through the energy transition into a winning position in a low carbon world.</p>\n<h2>About Shell.ai Residency Programme</h2>\n<p>Shell.ai is a change programme designed to support the adoption of AI at scale across Shell through a common platform, community and shared best practices. Shell.ai Residency Programme is a global program sponsored by the Shell Digital Centre of Expertise, the programme offers residents the opportunity to develop deep, technical expertise across the spectrum of AI, learning more about the energy industry and working in agile teams to develop new solutions that can optimise current processes, enable workforce and unlock new business models.</p>\n<p>The Shell.ai Residency Programme is a 2-year, full-time, immersive programme, which you to gain experience working on a variety of AI projects across Shell globally. The Programme offers Residents the opportunity to collaborate with like-minded innovators, experts and mentors, while deepening technical expertise across the spectrum of AI.</p>\n<p>As an AI Resident you will get to be involved in real time projects specifically matched to your interests and abilities and to get an insight into our day-to-day business operations. You’ll receive performance evaluations from your mentor and/or direct supervisor, and you’ll find out what the energy industry is really like, from the inside. The Shell.ai Residency Program offers you an amazing opportunity for learning and discovery. You will enjoy a unique opportunity to:</p>\n<ul>\n<li>Develop deep technical expertise working on the latest AI related projects</li>\n<li>Collaborate with like-minded innovators and AI residents community across the globe, Shell experts and mentors</li>\n<li>Channel your efforts from ideation to execution working to rapidly deploy solutions</li>\n<li>Deploy solutions across a breadth of Shell businesses - from Exploration to Trading, or Retail to New Energies</li>\n</ul>\n<h2>Where you fit?</h2>\n<p>The 4th industrial revolution (digitalization) is shaping Shell’s energy transition. The energy company of the future will be powered, at an unprecedented scale, by sophisticated data centric and computational simulation algorithms crafted through AI, deep learning (DL), machine learning (ML), computational physics and advanced visualization (VR, AR).</p>\n<p>Shell plans to have access to a top-tier High-Performance-Computing (HPC) facility to enable the discovery of new resources and the creation of data driven algorithms dedicated to solving our most challenging business opportunities.</p>\n<h2>What’s the role?</h2>\n<p>As a member of the Visual and HPC team, your typical day will involve working side-by-side with accomplished software engineers, world-class researchers and domain experts.</p>\n<p>The team focuses on the delivery of faster and better business decisions through Digital and Computational algorithms. The team relies heavily on its depth of expertise in High-Performance-Computing and Visualization. The work will consist primarily in improving existing computational workflows and in developing new ones to reach best price performance, by leveraging the latest advancements in both Software and Hardware technologies. The embedding of State-of-the-art visualization technologies in workflows to derive additional insights for better decision making is also part of the work. Solutions provided by our team have been deployed in various Shell products across both the Upstream and Downstream businesses.</p>\n<p>The Shell.ai resident VHPC role is at the helm of convergence of HPC and AI in Shell. It will be focused on working with application developers and scientists in Shell to optimize performance of existing AI-ML workflows for a variety of next generation compute infrastructure/platforms. Opportunities also include building future digital solutions by integrating multiple technologies (AR/VR/NLP/HPC/…)</p>\n<p>As part of AI Residency program you will get to work with different global cross-discipline teams on long research challenges where your artificial intelligence and machine learning knowledge, in integration with domain sciences will take us further into the digital world. In next 2 years you will get to work on following fields:</p>\n<ul>\n<li>Identify performance optimization and parallelization opportunities for faster business decisions</li>\n<li>Deliver performance optimizations for Digital and Computational workflows</li>\n<li>Integrate multiple digital technologies to build and deliver solutions</li>\n<li>Build deep understanding of the next generation technology roadmap and its impact on Shell workflows and applications</li>\n</ul>\n<h2>What we need from you?</h2>\n<p>We’re keen to speak to applicants with a Master’s or PhD degree in Computer Science / Maths / Engineering / Science or similar discipline</p>\n<p>Along with your strong experience in the delivery of analytics solutions within a corporate or academic environment, we’d also hope to see as many of the following on your CV:</p>\n<ul>\n<li>3+ years of demonstratable experience with performance optimization of applications</li>\n<li>Proficiency in building AI-ML workflows using latest frameworks (Tensorflow, Keras, PyTorch, Caffe,</li>\n<li>Development experience with one or more HPC accelerator programming environments such as Nvidia GPUs, Intel Xeon Phi etc.</li>\n<li>Knowledge of modern HPC systems, CPU/GPU architectures and execution models</li>\n<li>Programming knowledge of C, C++, Fortran, Python, or Java and understanding of data structures and Algorithms</li>\n<li>Experience with performance tools such as Nvidia nvprof, Nvidia Nsight, Intel Vtune, Intel Advisor and Intel Inspector</li>\n<li>Good understanding of Cloud Computing environments such as AWS, Azure and containerization technologies such as Dockers, Singularity</li>\n</ul>\n<h2>Our values</h2>\n<p>Shell is a company with shared values. Honesty, integrity, and respect aren't simply a strapline: they are a part of everything we do. What's more, Shell is an equal opportunities company, and we place the highest possible value on the diversity of our people and our inclusive approach.</p>\n<p>Join us and you’ll belong to a world where you can feel pride in your achievements and propel your career with global opportunities</p>\n<h2>An innovative place to work</h2>\n<p>Join us and you’ll be adding your talent and imagination to a business with the ambition to shape the future – whether by investing in renewables, exploring new ways to store energy or developing technology that helps the world to use energy more efficiently, everyone at Shell does their part.</p>\n<h2>An inclusive place to work</h2>\n<p>To power progress together, we need to attract and develop the brightest minds and make sure every voice is heard. Here are just some of the ways we’re nurturing an inclusive environment – one where you can express your ideas, extend your skills and reach your potential…</p>\n<ul>\n<li>We’re creating a space where people with disabilities can excel through transparent recruitment process, workplace adjustments and ongoing support in their roles. Feel free to let us know about your circumstances when you apply, and we’ll take it from there.</li>\n<li>We’re striving to be a pioneer of an inclusive and diverse workplace, promoting equality for employees regardless of sexual orientation or gender identity. We've retained our title as a top employer for women in India for past 3 consecutive years since 2016.</li>\n<li>We consider ourselves a flexible employer and want to support you finding the right balance. We encourage you to discuss this with us in your application.</li>\n</ul>\n<h2>A rewarding place to work</h2>\n<p>We’re huge advocates for career development. We’ll encourage you to try new roles and experience new settings. By pushing people to reach their potential, we frequently help them find skills they never knew they had, or make career moves they never thought possible</p>\n<p>Through all of this, and combining our ideas through a creative, collaborative environment and global operations – we have developed and will continue to nurture a unique workplace with an impressive range of benefits to ensure that joining Shell is an inspired and rewarding career choice for everyone.</p>\n<h2>Interested?</h2>\n<p>Apply now by using the application form!</p>\n<p><a href=\"https://vonq.io/36uHBEV\">Click here for the application form!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/36uHBEV\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcHFSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--499a30cca3ec3695e9de4be059008aacfaec9a56/Shell.png"
    }
  ]
}
